sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
/*!
    \file    gd32a7xx_enet.c
    \brief   ENET driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_enet.h"

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)

#define ENET_BUFFER_LENGTH                          (128U)
#define MTL_TX_FIFO_SIZE                            ENET_TXQ_SIZE_4096BYTES
#define MTL_RX_FIFO_SIZE                            ENET_RXQ_SIZE_4096BYTES
#define GCL_GATE_CONTROL_OFFSET                     (24U)
#define MMC_INTERRUPT_MASK_VALUE                    (0xFFFFFFFU)
#define MMC_IPC_INTERRUPT_MASK_VALUE                (0x3FFF3FFFU)
#define MAC_ADDR_HIGH_MASK                          (0xFFFF0000U)
#define EIPG_BIT_TIMES_STEP                         (8U)
#define EIPG_BIT_TIMES_START_VAL                    (104U)
#define EIPG_BIT_TIMES_POSITION                     (3U)
#define WRITE_BACK_DELAY                            (0xFFU)

#if defined   (__CC_ARM)                                    /*!< ARM compiler */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x24048000"))) enet_descriptors_struct  txdesc_tab[ENET_TXBUF_NUM]                  ;  /*!< ENET TxDMA descriptor */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x24048078"))) enet_tbs_enhanced_descriptors_struct  tbs_txdesc_tab[ENET_TXBUF_NUM] ;  /*!< ENET TxDMA enhanced descriptor */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x24048140"))) enet_descriptors_struct  rxdesc_tab[ENET_RXBUF_NUM]                  ;  /*!< ENET RxDMA descriptor */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x240481B8"))) uint8_t rx_buff[ENET_RXBUF_NUM][ENET_RXBUF_SIZE]                     ;  /*!< ENET receive buffer */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x24049F90"))) uint8_t tx_buff[ENET_TXBUF_NUM][ENET_TXBUF_SIZE]                     ;  /*!< ENET transmit buffer */

 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404BD68"))) enet_descriptors_struct  txdesc_tab1[ENET_TXBUF_NUM]                 ;  /*!< ENET TxDMA descriptor */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404BDE0"))) enet_tbs_enhanced_descriptors_struct  tbs_txdesc_tab1[ENET_TXBUF_NUM];  /*!< ENET TxDMA enhanced descriptor */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404BEA8"))) enet_descriptors_struct  rxdesc_tab1[ENET_RXBUF_NUM]                 ;  /*!< ENET RxDMA descriptor */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404BF20"))) uint8_t rx_buff1[ENET_RXBUF_NUM][ENET_RXBUF_SIZE]                    ;  /*!< ENET receive buffer */
 __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404DCF8"))) uint8_t tx_buff1[ENET_TXBUF_NUM][ENET_TXBUF_SIZE]                    ;  /*!< ENET transmit buffer */

#elif defined ( __ICCARM__ )                                            /*!< IAR compiler */
#pragma data_alignment=8
#pragma location=0x24048000
enet_descriptors_struct  txdesc_tab[ENET_TXBUF_NUM];                    /*!< ENET TxDMA descriptor */
#pragma data_alignment=8
#pragma location=0x24048078
enet_tbs_enhanced_descriptors_struct  tbs_txdesc_tab[ENET_TXBUF_NUM];   /*!< ENET TxDMA enhanced descriptor */
#pragma data_alignment=8
#pragma location=0x24048140
enet_descriptors_struct  rxdesc_tab[ENET_RXBUF_NUM];                    /*!< ENET RxDMA descriptor */
#pragma data_alignment=8
#pragma location=0x240481B8
uint8_t rx_buff[ENET_RXBUF_NUM][ENET_RXBUF_SIZE];                       /*!< ENET receive buffer */
#pragma data_alignment=8
#pragma location=0x24049F90
uint8_t tx_buff[ENET_TXBUF_NUM][ENET_TXBUF_SIZE];                       /*!< ENET transmit buffer */

#pragma data_alignment=8
#pragma location=0x2404BD68
enet_descriptors_struct  txdesc_tab1[ENET_TXBUF_NUM];                   /*!< ENET TxDMA descriptor */
#pragma data_alignment=8
#pragma location=0x2404BDE0
enet_tbs_enhanced_descriptors_struct  tbs_txdesc_tab1[ENET_TXBUF_NUM];  /*!< ENET TxDMA enhanced descriptor */
#pragma data_alignment=8
#pragma location=0x2404BEA8
enet_descriptors_struct  rxdesc_tab1[ENET_RXBUF_NUM];                   /*!< ENET RxDMA descriptor */
#pragma data_alignment=8
#pragma location=0x2404BF20
uint8_t rx_buff1[ENET_RXBUF_NUM][ENET_RXBUF_SIZE];                      /*!< ENET receive buffer */
#pragma data_alignment=8
#pragma location=0x2404DCF8
uint8_t tx_buff1[ENET_TXBUF_NUM][ENET_TXBUF_SIZE];                      /*!< ENET transmit buffer */

#elif defined (__GNUC__)        /* GNU Compiler */
enet_descriptors_struct  txdesc_tab[ENET_TXBUF_NUM]                   __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x24048000")));  /*!< ENET TxDMA descriptor */
enet_tbs_enhanced_descriptors_struct  tbs_txdesc_tab[ENET_TXBUF_NUM]  __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x24048078")));  /*!< ENET TxDMA enhanced descriptor */
enet_descriptors_struct  rxdesc_tab[ENET_RXBUF_NUM]                   __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x24048140")));  /*!< ENET RxDMA descriptor */
uint8_t rx_buff[ENET_RXBUF_NUM][ENET_RXBUF_SIZE]                      __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x240481B8")));  /*!< ENET receive buffer */
uint8_t tx_buff[ENET_TXBUF_NUM][ENET_TXBUF_SIZE]                      __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x24049F90")));  /*!< ENET transmit buffer */

enet_descriptors_struct  txdesc_tab1[ENET_TXBUF_NUM]                  __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404BD68")));  /*!< ENET TxDMA descriptor */
enet_tbs_enhanced_descriptors_struct  tbs_txdesc_tab1[ENET_TXBUF_NUM] __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404BDE0")));  /*!< ENET TxDMA enhanced descriptor */
enet_descriptors_struct  rxdesc_tab1[ENET_RXBUF_NUM]                  __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404BEA8")));  /*!< ENET RxDMA descriptor */
uint8_t rx_buff1[ENET_RXBUF_NUM][ENET_RXBUF_SIZE]                     __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404BF20")));  /*!< ENET receive buffer */
uint8_t tx_buff1[ENET_TXBUF_NUM][ENET_TXBUF_SIZE]                     __attribute__((aligned(8))) __attribute__((section(".ARM.__at_0x2404DCF8")));  /*!< ENET transmit buffer */

#endif /* __CC_ARM */


