sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
/* global transmit and receive descriptors pointers */
enet_descriptors_struct  *dma_current_txdesc = NULL;
enet_descriptors_struct  *dma_current_rxdesc = NULL;
/* structure pointer of enhanced descriptor for TBS */
enet_tbs_enhanced_descriptors_struct  *dma_current_tbs_txdesc = NULL;


/* global transmit and receive descriptors pointers */
enet_descriptors_struct  *dma_current_txdesc1 = NULL;
enet_descriptors_struct  *dma_current_rxdesc1 = NULL;
/* structure pointer of enhanced descriptor for TBS */
enet_tbs_enhanced_descriptors_struct  *dma_current_tbs_txdesc1 = NULL;

/* init structure parameters for ENET initialization */
static enet_initpara_struct enet_initpara = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0,0, 0, 0, 0, 0, 0, 0, 0, 0, 0,0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
static uint32_t enet_unknow_err = 0U;
/* array of register offset for debug information get */
static const uint16_t enet_reg_tab[] = {
    0x0000, 0x0004, 0x0008, 0x000C, 0x0010, 0x0014, 0x0050, 0x0054, 0x0058, 0x0060, 0x0064,

    0x0070, 0x0090, 0x0094, 0x00A0, 0x00A4, 0x00A8, 0x00B0, 0x00B4, 0x00B8, 0x00C0, 0x00C4,

    0x00D0, 0x00D4, 0x00D8, 0x00DC, 0x0110, 0x0114, 0x011C, 0x0120, 0x0124, 0x0128, 0x0140,

    0x0148, 0x014C, 0x0200, 0x0204, 0x0210, 0x0230, 0x0234, 0x0240, 0x0244, 0x0300, 0x0304,

    0x0308, 0x030C, 0x0310, 0x0314, 0x0700, 0x0704, 0x0708, 0x070C, 0x0710, 0x0714, 0x0718,

    0x071C, 0x0720, 0x0724, 0x0728, 0x072C, 0x0730, 0x0734, 0x0738, 0x073C, 0x0740, 0x0744,

    0x0748, 0x074C, 0x0750, 0x0754, 0x0758, 0x075C, 0x0760, 0x0764, 0x0768, 0x076C, 0x0770,

    0x0774, 0x0778, 0x0780, 0x0784, 0x0788, 0x078C, 0x0790, 0x0794, 0x0798, 0x079C, 0x07A0,

    0x07A4, 0x07A8, 0x07AC, 0x07B0, 0x07B4, 0x07B8, 0x07BC, 0x07C0, 0x07C4, 0x07C8, 0x07CC,

    0x07D0, 0x07D4, 0x07D8, 0x07DC, 0x07E0, 0x07E4, 0x07EC, 0x07F0, 0x07F4, 0x07F8, 0x0800,

    0x0808, 0x0810, 0x0814, 0x0818, 0x081C, 0x0820, 0x0824, 0x0828, 0x082C, 0x0830, 0x0834,

    0x0838, 0x083C, 0x0840, 0x0844, 0x0850, 0x0854, 0x0858, 0x085C, 0x0860, 0x0864, 0x0868,

    0x086C, 0x0870, 0x0874, 0x0878, 0x087C, 0x0880, 0x0884, 0x08A0, 0x08A4, 0x08A8, 0x08AC,

    0x08C0, 0x08C4, 0x08C8, 0x08CC, 0x08D0, 0x08D4, 0x0900, 0x0904, 0x0910, 0x0914, 0x0918,

    0x091C, 0x0930, 0x0934, 0x0940, 0x0944, 0x0948, 0x094C, 0x0960, 0x0964, 0x0970, 0x0974,

    0x0978, 0x097C, 0x0990, 0x0994, 0x09A0, 0x09A4, 0x09A8, 0x09AC, 0x0A70, 0x0A74, 0x0B00,

    0x0B04, 0x0B08, 0x0B0C, 0x0B10, 0x0B14, 0x0B18, 0x0B1C, 0x0B20, 0x0B24, 0x0B28, 0x0B30,

    0x0B34, 0x0B50, 0x0B54, 0x0B58, 0x0B5C, 0x0B60, 0x0B64, 0x0B68, 0x0B6C, 0x0B70, 0x0B80,

    0x0B84, 0x0B88, 0x0B8C, 0x0B90, 0x0B94, 0x0B98, 0x0B9C, 0x0BA0, 0x0BA4, 0x0BA8, 0x0BAC,

    0x0BB0, 0x0BB4, 0x0BB8, 0x0BBC, 0x0C00, 0x0C08, 0x0C0C, 0x0C10, 0x0C20, 0x0C30, 0x0C40, 

    0x0C50, 0x0C54, 0x0C58, 0x0C60, 0x0C64, 0x0C68, 0x0C70, 0x0C80, 0x0C84, 0x0C90, 0x0C94,

    0x0CA0, 0x0CA4, 0x0CA8, 0x0CAC, 0x0CB0, 0x0CB4, 0x0CB8, 0x0CC0, 0x0CC4, 0x0CC8, 0x0CCC,

    0x0CD0, 0x0CD4, 0x0CD8, 0x0CE0, 0x0CE4, 0x0D00, 0x0D04, 0x0D08, 0x0D14, 0x0D18, 0x0D2C,

    0x0D30, 0x0D34, 0x0D38, 0x0D3C, 0x0D40, 0x0D44, 0x0D48, 0x0D50, 0x0D54, 0x0D58, 0x0D5C,

    0x0D60, 0x0D64, 0x0D6C, 0x0D70, 0x0D74, 0x0D78, 0x0D7C, 0x1000, 0x1004, 0x1008, 0x100C,

    0x1050, 0x1080, 0x1100, 0x1104, 0x1108, 0x1114, 0x111C, 0x1120, 0x1128, 0x112C, 0x1130,

    0x1134, 0x1138, 0x113C, 0x1144, 0x114C, 0x1154, 0x115C, 0x1160, 0x1164, 0x1168, 0x1180,

    0x1184, 0x1188, 0x1194, 0x119C, 0x11A0, 0x11A8, 0x11AC, 0x11B0, 0x11B4, 0x11B8, 0x11BC,

    0x11C4, 0x11CC, 0x11D4, 0x11DC, 0x11E0, 0x11E4, 0x11E8
};

/* ENET registers reset value */
static const uint32_t enet_reg_reset_value[] = {
    0x00008000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x03E80000, 0x00000000, 0x00000000, 0x00001053, 0x00000000, 0x0A0973F5, 0x211829A6, 0x04041041, 0x6C370E31, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x8000FFFF, 0xFFFFFFFF,

    0x0000FFFF, 0xFFFFFFFF, 0x0000FFFF, 0xFFFFFFFF, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

