sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000018, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x803F003F, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,

    0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000
};
#ifdef USE_DELAY
/* user can provide more timing precise ENET_DELAY_ function */
#define ENET_DELAY(x)                              delay_ms(x)
#else
/* insert a delay time */
static void enet_delay(uint32_t ncount);
/* default ENET_DELAY_ function with less precise timing */
#define ENET_DELAY(x)                              enet_delay(x)
#endif

/*!
    \brief      deinitialize the ENET module
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_deinit(void)
{
    uint32_t offset, limit;
    offset = 0U;

    limit = sizeof(enet_reg_tab) / sizeof(uint16_t);

    for(; offset < limit; offset++) {
        REG32((ENET) + enet_reg_tab[offset]) = enet_reg_reset_value[offset];
    }
    rcu_periph_reset_enable(RCU_ENETRST);
    rcu_periph_reset_disable(RCU_ENETRST);
}


/*!
    \brief    configure the parameters which are usually less cared for initialization
                note -- this function must be called before enet_init(), otherwise
                configuration will be no effect
    \param[in]  option: different function option, which is related to several parameters,
                only one parameter can be selected which is shown as below, refer to enet_option_enum
      \arg        FORWARD_OPTION: choose to configure the frame forward related parameters
      \arg        DMABUS_OPTION: choose to configure the DMA bus mode related parameters
      \arg        DMACH0_MAXBURST_OPTION: choose to configure the DMA channel 0 max burst related parameters
      \arg        DMACH1_MAXBURST_OPTION: choose to configure the DMA channel 1 max burst related parameters
      \arg        DMA_ARBITRATION_OPTION: choose to configure the DMA arbitration related parameters
      \arg        TX0STORE_OPTION: configure the transmit queue 0 store forward mode related parameters
      \arg        RX0STORE_OPTION: configure the receive queue 0 store forward mode related parameters
      \arg        TX1STORE_OPTION: configure the transmit queue 1 store forward mode related parameters
      \arg        RX1STORE_OPTION: configure the receive queue 1 store forward mode related parameters
      \arg        VLAN_CONFIG_OPTION: configure the VLAN tag related parameters
      \arg        VLAN_COMPARISON_OPTION: configure the VLAN tag related parameters
      \arg        VLAN_INSERT_OPTION: configure the VLAN tag insertion or replacement related parameters
      \arg        INNERVLAN_INSERT_OPTION : configure the INNER VLAN tag insertion or replacement related parameters
      \arg        FLOWCTL_OPTION: configure the flow control related parameters
      \arg        HASHH_OPTION: configure the hash list high 32-bit related parameters
      \arg        HASHL_OPTION: configure the hash list low 32-bit related parameters
      \arg        FILTER_OPTION: configure the frame filter control related parameters
      \arg        HALFDUPLEX_OPTION: configure the halfduplex related parameters
      \arg        FULLDUPLEX_OPTION: configure the fullduplex related parameters
      \arg        PACKETSIZE_OPTION: configure the packet size related parameters
      \arg        TIMER_OPTION: configure the frame timer related parameters
      \arg        MACCONTROL_OPTION: configure the frame timer related parameters
      \arg        INTERFRAMEGAP_OPTION: configure the inter frame gap related parameters
      \arg        ECCCONTROL_OPTION: configure the ECC control related parameters
      \arg        DPPCONTROL_OPTION: configure the DPP control related parameters
      \arg        FSMCONTROL_OPTION: configure the FSM control related parameters
      \arg        ESTCONTROL_OPTION: configure the EST control related parameters
      \arg        FPECONTROL_OPTION: configure the FPE control related parameters
    \param[in]  para: the related parameters according to the option
                all the related parameters should be configured which are shown as below
                      FORWARD_OPTION related parameters:
                      -  ENET_AUTO_PADCRC_STRIP_ENABLE/ ENET_AUTO_PADCRC_STRIP_DISABLE ;
                      -  ENET_TYPEPACKET_CRC_STRIP_ENABLE/ ENET_TYPEPACKET_CRC_STRIP_DISABLE ;
                      -  ENET_RXQ0_FORWARD_ERRFRAMES_ENABLE/ ENET_RXQ0_FORWARD_ERRFRAMES_DISABLE ;
                      -  ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES_ENABLE/ ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES_DISABLE ;
                      -  ENET_RXQ1_FORWARD_ERRFRAMES_ENABLE/ ENET_RXQ1_FORWARD_ERRFRAMES_DISABLE ;
                      -  ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES_ENABLE/ ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES_DISABLE .
                      DMABUS_OPTION related parameters:
                      -  ENET_ADDRESS_ALIGN_ENABLE/ ENET_ADDRESS_ALIGN_DISABLE ;
                      -  ENET_FIXED_BURST_ENABLE/ ENET_FIXED_BURST_DISABLE ;
                      -  ENET_MIXED_BURST_ENABLE/ ENET_MIXED_BURST_DISABLE ;
                      DMACH0_MAXBURST_OPTION related parameters:  
                      -  ENET_RXDP_1BEAT/ ENET_RXDP_2BEAT/ ENET_RXDP_4BEAT/
                         ENET_RXDP_8BEAT/ ENET_RXDP_16BEAT/ ENET_RXDP_32BEAT/
                         ENET_RXDP_8xPGBL_8BEAT/ ENET_RXDP_8xPGBL_16BEAT/
                         ENET_RXDP_8xPGBL_32BEAT/ ENET_RXDP_8xPGBL_64BEAT/
                         ENET_RXDP_8xPGBL_128BEAT/ ENET_RXDP_8xPGBL_256BEAT;
                      -  ENET_PGBL_1BEAT/ ENET_PGBL_2BEAT/ ENET_PGBL_4BEAT/
                         ENET_PGBL_8BEAT/ ENET_PGBL_16BEAT/ ENET_PGBL_32BEAT/
                         ENET_PGBL_8xPGBL_8BEAT/ ENET_PGBL_8xPGBL_16BEAT/
                         ENET_PGBL_8xPGBL_32BEAT/ ENET_PGBL_8xPGBL_64BEAT/
                         ENET_PGBL_8xPGBL_128BEAT/ ENET_PGBL_8xPGBL_256BEAT;
                      DMACH1_MAXBURST_OPTION related parameters:  
                      -  ENET_RXDP_1BEAT/ ENET_RXDP_2BEAT/ ENET_RXDP_4BEAT/
                         ENET_RXDP_8BEAT/ ENET_RXDP_16BEAT/ ENET_RXDP_32BEAT/
                         ENET_RXDP_8xPGBL_8BEAT/ ENET_RXDP_8xPGBL_16BEAT/
                         ENET_RXDP_8xPGBL_32BEAT/ ENET_RXDP_8xPGBL_64BEAT/
                         ENET_RXDP_8xPGBL_128BEAT/ ENET_RXDP_8xPGBL_256BEAT;
                      -  ENET_PGBL_1BEAT/ ENET_PGBL_2BEAT/ ENET_PGBL_4BEAT/
                         ENET_PGBL_8BEAT/ ENET_PGBL_16BEAT/ ENET_PGBL_32BEAT/
                         ENET_PGBL_8xPGBL_8BEAT/ ENET_PGBL_8xPGBL_16BEAT/
                         ENET_PGBL_8xPGBL_32BEAT/ ENET_PGBL_8xPGBL_64BEAT/
                         ENET_PGBL_8xPGBL_128BEAT/ ENET_PGBL_8xPGBL_256BEAT;
                      DMA_ARBITRATION_OPTION related parameters:
                      -  ENET_ARBITRATION_RXTX_1_1 / ENET_ARBITRATION_RXTX_2_1 / ENET_ARBITRATION_RXTX_3_1 \
                         / ENET_ARBITRATION_RXTX_4_1 / ENET_ARBITRATION_RXTX_5_1 / ENET_ARBITRATION_RXTX_6_1 \
                         / ENET_ARBITRATION_RXTX_7_1 / ENET_ARBITRATION_RXTX_8_1 / ENET_ARBITRATION_TXRX_1_1 \
                         / ENET_ARBITRATION_TXRX_2_1 / ENET_ARBITRATION_TXRX_3_1 / ENET_ARBITRATION_TXRX_4_1 \
                         / ENET_ARBITRATION_TXRX_5_1 / ENET_ARBITRATION_TXRX_6_1 / ENET_ARBITRATION_TXRX_7_1 \
                         / ENET_ARBITRATION_TXRX_8_1.
                      TX0STORE_OPTION related parameters:
                      -  ENET_TX_MODE_STOREFORWARD/ ENET_TX_MODE_CUTTHROUGH ;
                      -  ENET_TX_THRESHOLD_32BYTES/ ENET_TX_THRESHOLD_64BYTES/
                         ENET_TX_THRESHOLD_96BYTES/ ENET_TX_THRESHOLD_128BYTES/
                         ENET_TX_THRESHOLD_192BYTES/ ENET_TX_THRESHOLD_256BYTES/
                         ENET_TX_THRESHOLD_284BYTES/ ENET_TX_THRESHOLD_512BYTES.
                      RX0STORE_OPTION related parameters:
                      -  ENET_RX_MODE_STOREFORWARD/ ENET_RX_MODE_CUTTHROUGH ;
                      -  ENET_RX_THRESHOLD_32BYTES/ ENET_RX_THRESHOLD_64BYTES/
                         ENET_RX_THRESHOLD_96BYTES/ ENET_RX_THRESHOLD_128BYTES ;
                      TX1STORE_OPTION related parameters:
                      -  ENET_TX_MODE_STOREFORWARD/ ENET_TX_MODE_CUTTHROUGH ;
                      -  ENET_TX_THRESHOLD_32BYTES/ ENET_TX_THRESHOLD_64BYTES/
                         ENET_TX_THRESHOLD_96BYTES/ ENET_TX_THRESHOLD_128BYTES/
                         ENET_TX_THRESHOLD_192BYTES/ ENET_TX_THRESHOLD_256BYTES/
                         ENET_TX_THRESHOLD_284BYTES/ ENET_TX_THRESHOLD_512BYTES.
                      RX1STORE_OPTION related parameters:
                      -  ENET_RX_MODE_STOREFORWARD/ ENET_RX_MODE_CUTTHROUGH ;
                      -  ENET_RX_THRESHOLD_32BYTES/ ENET_RX_THRESHOLD_64BYTES/
                         ENET_RX_THRESHOLD_96BYTES/ ENET_RX_THRESHOLD_128BYTES ;
                      VLAN_CONFIG_OPTION related parameters:
                      -  ENET_RXINVLAN_ENABLE/ ENET_RXINVLAN_DISABLE ;
                      -  ENET_INVLANSTRIP_DISABLE/ ENET_INVLANSTRIP_PASS ;
                      -  ENET_INVLANSTRIP_NOPASS/ ENET_INVLANSTRIP_ENABLE ;
                      -  ENET_INVLANCOMPARISON_ENABLE/ ENET_INVLANCOMPARISON_DISABLE ;
                      -  ENET_DOUBLEVLAN_ENABLE/ ENET_DOUBLEVLAN_DISABLE ;
                      -  ENET_VLANHASHMATCH_ENABLE/ ENET_VLANHASHMATCH_DISABLE ;
                      -  ENET_RXOUTVLAN_ENABLE/ ENET_RXOUTVLAN_DISABLE ;
                      -  ENET_OUTVLANSTRIP_DISABLE/ ENET_OUTVLANSTRIP_PASS ;
                      -  ENET_OUTVLANSTRIP_NOPASS/ ENET_OUTVLANSTRIP_ENABLE ;
                      -  ENET_VLANTYPECHECK_ENABLE/ ENET_VLANTYPECHECK_DISABLE ;
                      -  ENET_SVLANHASHMATCH_ENABLE/ ENET_SVLANHASHMATCH_DISABLE ;
                      -  ENET_SVLAN_ENABLE/ ENET_SVLAN_DISABLE ;
                      -  ENET_VLANINVERSEMATCH_ENABLE/ ENET_VLANINVERSEMATCH_DISABLE ;
                      -  ENET_VLANTAGHASHCOMPARISON_12BIT/ ENET_VLANTAGHASHCOMPARISON_16BIT ;
                      VLAN_COMPARISON_OPTION related parameters:
                      -  MAC_VLAN_TAG_FILTER0 / MAC_VLAN_TAG_FILTER1 /
                         MAC_VLAN_TAG_FILTER2 / MAC_VLAN_TAG_FILTER3;
                      -  ENET_VLANTAGCOMPARISON_INNER/ ENET_VLANTAGCOMPARISON_OUTER ;
                      -  ENET_SVLANTAGMATCH_ENABLE/ ENET_SVLANTAGMATCH_DISABLE ;
                      -  ENET_VLANTYPECOMPARISON_ENABLE/ ENET_VLANTYPECOMPARISON_DISABLE;
                      -  ENET_VLANTAGCOMPARISON_12BIT/ ENET_VLANTAGCOMPARISON_16BIT;
                      -  ENET_VLANTAGCOMPARISON_ENABLE/ ENET_VLANTAGCOMPARISON_DISABLE ;
                      -  MAC_VLAN_TAG_DATA_VID(regval);
                      VLAN_INSERT_OPTION related parameters:
                      -  ENET_VLANTAG_FROM_DES / ENET_VLANTAG_FROM_REG ;
                      -  ENET_VLANTAG_INSERT_REPLACE_SVLAN / ENET_VLANTAG_INSERT_REPLACE_CVLAN ;
                      -  ENET_VLANTAG_PRIORITY_ENABLE/ ENET_VLANTAG_PRIORITY_DISABLE ;
                      -  ENET_VLANTAG_NO_OPERATIOM/ ENET_VLANTAG_DELETION /
                         ENET_VLANTAG_INSERTATION/ ENET_VLANTAG_REPLACEMENT ;
                      INNERVLAN_INSERT_OPTION related parameters:
                      -  ENET_INNER_VLANTAG_FROM_DES / ENET_INNER_VLANTAG_FROM_REG ;
                      -  ENET_INNER_VLANTAG_INSERT_REPLACE_SVLAN / ENET_INNER_VLANTAG_INSERT_REPLACE_CVLAN ;
                      -  ENET_INNER_VLANTAG_PRIORITY_ENABLE/ ENET_INNER_VLANTAG_PRIORITY_DISABLE ;
                      -  ENET_INNER_VLANTAG_NO_OPERATIOM/ ENET_INNER_VLANTAG_DELETION /
                         ENET_INNER_VLANTAG_INSERTATION/ ENET_INNER_VLANTAG_REPLACEMENT ;
                      -  MAC_INNER_VLAN_TAG_DATA_VID(regval)
                      FLOWCTL_OPTION related parameters:
                      -  MAC_Q0_TX_FLOW_CTRL_PT(regval) ;
                      -  ENET_ZERO_QUANTA_PAUSE_ENABLE/ ENET_ZERO_QUANTA_PAUSE_DISABLE ;
                         ENET_PAUSETIME_MINUS4/ ENET_PAUSETIME_MINUS28/
                         ENET_PAUSETIME_MINUS36/ ENET_PAUSETIME_MINUS144/
                         ENET_PAUSETIME_MINUS256/ENET_PAUSETIME_MINUS256_2 ;
                      -  ENET_MAC0_AND_UNIQUE_ADDRESS_PAUSEDETECT/ ENET_UNIQUE_PAUSEDETECT ;
                      -  ENET_RX_FLOWCONTROL_ENABLE/ ENET_RX_FLOWCONTROL_DISABLE ;
                      -  ENET_TX_FLOWCONTROL_ENABLE/ ENET_TX_FLOWCONTROL_DISABLE ;
                      -  ENET_RXQ0_HARDWARE_FLOW_CONTROL_ENABLE/ ENET_RXQ0_HARDWARE_FLOW_CONTROL_DISABLE ;
                      -  ENET_RXQ1_HARDWARE_FLOW_CONTROL_ENABLE/ ENET_RXQ1_HARDWARE_FLOW_CONTROL_DISABLE ;
                      HASHH_OPTION related parameters:
                      -  0x0~0xFFFF FFFFU
                      HASHL_OPTION related parameters:
                      -  0x0~0xFFFF FFFFU
                      FILTER_OPTION related parameters:
                      -  ENET_SRC_FILTER_NORMAL_ENABLE/ ENET_SRC_FILTER_INVERSE_ENABLE/
                         ENET_SRC_FILTER_DISABLE ;
                      -  ENET_DEST_FILTER_INVERSE_ENABLE/ ENET_DEST_FILTER_INVERSE_DISABLE ;
                      -  ENET_MULTICAST_FILTER_HASH_OR_PERFECT/ ENET_MULTICAST_FILTER_HASH/
                         ENET_MULTICAST_FILTER_PERFECT/ ENET_MULTICAST_FILTER_NONE/
                         ENET_MULTICAST_FILTER_PASS;
                      -  ENET_DROP_NONTCPUDP_ENABLE/ENET_DROP_NONTCPUDP_DISABLE;
                      -  ENET_VLAN_FILTER_ENABLE/ENET_VLAN_FILTER_DISABLE;
                      -  ENET_L3L4_FILTER_ENABLE/ENET_L3L4_FILTER_DISABLE;
                      -  ENET_UNICAST_FILTER_EITHER/ ENET_UNICAST_FILTER_HASH/
                         ENET_UNICAST_FILTER_PERFECT ;
                      -  ENET_PCF_PREVENT_ALL/ ENET_PCF_PREVENT_PAUSEFRAME/
                         ENET_PCF_FORWARD_ALL/ ENET_PCF_FORWARD_FILTERED .
                      HALFDUPLEX_OPTION related parameters:
                      -  ENET_CARRIERSENSE_ENABLE/ ENET_CARRIERSENSE_DISABLE
                      -  ENET_RECEIVEOWN_ENABLE/ ENET_RECEIVEOWN_DISABLE ;
                      -  ENET_RETRYTRANSMISSION_ENABLE/ ENET_RETRYTRANSMISSION_DISABLE
                      -  ENET_BACKOFFLIMIT_10/ ENET_BACKOFFLIMIT_8/
                         ENET_BACKOFFLIMIT_4/ ENET_BACKOFFLIMIT_1 ;
                      -  ENET_DEFERRALCHECK_ENABLE/ ENET_DEFERRALCHECK_DISABLE
                      FULLDUPLEX_OPTION related parameters:
                      -  ENET_FULLDUPLEX_CARRIERSENSE_ENABLE/ ENET_FULLDUPLEX_CARRIERSENSE_DISABLE ;
                      -  ENET_PREAMBLE_LENGTH_7BYTE/ ENET_PREAMBLE_LENGTH_5BYTE/
                         ENET_PREAMBLE_LENGTH_3BYTE;
                      PACKETSIZE_OPTION related parameters:
                      -  ENET_2KMAX_PACKET_ENABLE/ ENET_2KMAX_PACKET_DISABLE ;
                      -  ENET_JUMBO_PACKET_ENABLE/ ENET_JUMBO_PACKET_DISABLE ;
                      -  ENET_GIANT_PACKET_LIMIT_ENABLE/ ENET_GIANT_PACKET_LIMIT_DISABLE ;
                      TIMER_OPTION related parameters:
                      -  ENET_WATCHDOG_ENABLE/ ENET_WATCHDOG_DISABLE ;
                      -  ENET_JABBER_ENABLE/ ENET_JABBER_DISABLE ;
                      MACCONTROL_OPTION related parameters:
                      -  ENET_ARP_OFFLOAD_ENABLE/ ENET_ARP_OFFLOAD_DISABLE ;
                      -  ENET_SARC_INTERNAL_SIGNAL/ ENET_SARC_ADDR0_INSERT/
                         ENET_SARC_ADDR0_REPLACE/ ENET_SARC_ADDR1_INSERT/ 
                         ENET_SARC_ADDR1_REPLACE;
                      INTERFRAMEGAP_OPTION related parameters:
                      -  ENET_INTERPACKETGAP_96BIT/ ENET_INTERPACKETGAP_88BIT/
                         ENET_INTERPACKETGAP_80BIT/ ENET_INTERPACKETGAP_72BIT/
                         ENET_INTERPACKETGAP_64BIT/ ENET_INTERPACKETGAP_56BIT/
                         ENET_INTERPACKETGAP_48BIT/ ENET_INTERPACKETGAP_40BIT ;
                      ECCCONTROL_OPTION related parameters:
                      -  ENET_MTL_TXFIFO_ECC_ENABLE/ ENET_MTL_TXFIFO_ECC_DISABLE ;
                      -  ENET_MTL_RXFIFO_ECC_ENABLE/ ENET_MTL_RXFIFO_ECC_DISABLE ;
                      -  ENET_RETRYTRANSMISSION_ENABLE/ ENET_RETRYTRANSMISSION_DISABLE ;
                      -  ENET_MTL_EST_ECC_ENABLE/ ENET_MTL_EST_ECC_DISABLE;
                      -  ENET_MTL_RXP_ECC_ENABLE/ ENET_MTL_RXP_ECC_DISABLE;
                      -  ENET_MTL_EST_ECC_ENABLE/ ENET_MTL_EST_ECC_DISABLE.
                      DPPCONTROL_OPTION related parameters:
                      -  ENET_DATA_PATH_PARITY_PROTECTION_ENABLE/ ENET_DATA_PATH_PARITY_PROTECTION_DISABLE ;
                      -  ENET_DPP_ODD_PARITY_ENABLE/ ENET_DPP_ODD_PARITY_DISABLE ;
                      -  ENET_DPP_PARITY_ON_SLAVE_INTERFACE_ENABLE/ ENET_DPP_ODD_PARITY_DISABLE ;
                      -  ENET_DPP_IPETID_ENABLE/ ENET_DPP_IPETID_DISABLE ;
                      -  ENET_DPP_IPETRD_ENABLE/ ENET_DPP_IPETRD_DISABLE ;
                      -  ENET_DPP_IPEMTF_ENABLE/ ENET_DPP_IPEMTF_DISABLE ;
                      -  ENET_DPP_IPEMTS_ENABLE/ ENET_DPP_IPEMTS_DISABLE ;
                      -  ENET_DPP_IPERID_ENABLE/ ENET_DPP_IPERID_DISABLE ;
                      -  ENET_DPP_IPEMTBU_ENABLE/ ENET_DPP_IPEMTBU_DISABLE ;
                      -  ENET_DPP_IPEMTFC_ENABLE/ ENET_DPP_IPEMTFC_DISABLE ;
                      -  ENET_DPP_IPEMRWC_ENABLE/ ENET_DPP_IPEMRWC_DISABLE ;
                      FSMCONTROL_OPTION related parameters:
                      -  ENET_PTP_DOMAIN_LARGE_MODE/ ENET_PTP_DOMAIN_NORMAL_MODE ;
                      -  ENET_APP_DOMAIN_LARGE_MODE/ ENET_APP_DOMAIN_NORMAL_MODE ;
                      -  ENET_CSR_DOMAIN_LARGE_MODE/ ENET_CSR_DOMAIN_NORMAL_MODE ;
                      -  ENET_RX_DOMAIN_LARGE_MODE/ ENET_RX_DOMAIN_NORMAL_MODE ;
                      -  ENET_TX_DOMAIN_LARGE_MODE/ ENET_TX_DOMAIN_NORMAL_MODE ;
                      -  ENET_PTP_FSM_PARITY_ERROR_INJECTION_ENABLE/ ENET_PTP_FSM_PARITY_ERROR_INJECTION_DISABLE ;
                      -  ENET_APP_FSM_PARITY_ERROR_INJECTION_ENABLE/ ENET_APP_FSM_PARITY_ERROR_INJECTION_DISABLE ;
                      -  ENET_CSR_FSM_ONEHOTPROTECTION_ERROR_INJECTION_ENABLE/ ENET_CSR_FSM_ONEHOTPROTECTION_ERROR_INJECTION_DISABLE ;
                      -  ENET_RX_FSM_PARITY_ERROR_INJECTION_ENABLE/ ENET_RX_FSM_PARITY_ERROR_INJECTION_DISABLE ;
                      -  ENET_TX_FSM_PARITY_ERROR_INJECTION_ENABLE/ ENET_TX_FSM_PARITY_ERROR_INJECTION_DISABLE ;
                      -  ENET_PTP_FSM_TIMEOUT_ERROR_INJECTION_ENABLE/ ENET_PTP_FSM_TIMEOUT_ERROR_INJECTION_DISABLE ;
                      -  ENET_APP_FSM_TIMEOUT_ERROR_INJECTION_ENABLE/ ENET_APP_FSM_TIMEOUT_ERROR_INJECTION_DISABLE ;
                      -  ENET_CSR_FSM_TIMEOUT_ERROR_INJECTION_ENABLE/ ENET_CSR_FSM_TIMEOUT_ERROR_INJECTION_DISABLE ;
                      -  ENET_RX_FSM_TIMEOUT_ERROR_INJECTION_ENABLE/ ENET_RX_FSM_TIMEOUT_ERROR_INJECTION_DISABLE ;
                      -  ENET_TX_FSM_TIMEOUT_ERROR_INJECTION_ENABLE/ ENET_TX_FSM_TIMEOUT_ERROR_INJECTION_DISABLE ;
                      -  ENET_PTP_FSM_TIMEOUT_ERROR_INJECTION_ENABLE/ ENET_PTP_FSM_TIMEOUT_ERROR_INJECTION_DISABLE ;
                      -  ENET_FSM_PARITY_FEATURE_ENABLE/ ENET_FSM_PARITY_FEATURE_DISABLE ;
                      -  ENET_FSM_TIMEOUT_FEATURE_ENABLE/ ENET_FSM_TIMEOUT_FEATURE_DISABLE ;
                      ESTCONTROL_OPTION related parameters:
                      -  ENET_EST_ENABLE/ ENET_EST_DISABLE ;
                      -  ENET_QUICK_ASSERT_HLBF_ERR_ENABLE / ENET_QUICK_ASSERT_HLBF_ERR_DISABLE;
                      -  ENET_EST_DONT_DROP_SIZE_ERR_FRAME / ENET_EST_DROP_SIZE_ERR_FRAME;
                      -  ENET_EST_DROP_SCHEDULING_ERR_FRAME / ENET_EST_DONT_DROP_SCHEDULING_ERR_FRAME;
                      -  ENET_GCL_INTERATE_4 / ENET_GCL_INTERATE_8 /
                         ENET_GCL_INTERATE_16 / ENET_GCL_INTERATE_32;
                      -  ENET_GCL_TIME_INTERVAL_LEFT_SHIFT_0/ ENET_GCL_TIME_INTERVAL_LEFT_SHIFT_1/
                         ENET_GCL_TIME_INTERVAL_LEFT_SHIFT_2/ ENET_GCL_TIME_INTERVAL_LEFT_SHIFT_7;
                      -  MTL_EST_CONTROL_CTOV(regval);
                      -  MTL_EST_CONTROL_PTOV(regval);
                      FPECONTROL_OPTION related parameters:
                      -  ENET_GCL_LEVEL_BASED_HOLD_TRANSITION_ENABLE / ENET_GCL_LEVEL_BASED_HOLD_TRANSITION_DISABLE;
                      -  ENET_FPE_Q0_AS_PREEMPTABLE/ ENET_FPE_Q1_AS_PREEMPTABLE;
                      -  ENET_FPE_ADD_FRAG_SIZE_64B/ ENET_FPE_ADD_FRAG_SIZE_128B /
                         ENET_FPE_ADD_FRAG_SIZE_192B / ENET_FPE_ADD_FRAG_SIZE_256B;
    \param[out] none
    \retval     none
*/
void enet_initpara_config(enet_option_enum option, uint32_t para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((FORWARD_OPTION == option) && NOT_ENET_FORWARD_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((DMABUS_OPTION == option) && NOT_ENET_DMABUS_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((DMACH0_MAXBURST_OPTION == option || DMACH1_MAXBURST_OPTION == option) && NOT_ENET_DMACH_MAXBURST_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((DMA_ARBITRATION_OPTION == option) && NOT_ENET_DMA_ARBITRATION_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((TX0STORE_OPTION == option || TX1STORE_OPTION == option) && NOT_ENET_TXSTORE_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((RX0STORE_OPTION == option || RX1STORE_OPTION == option) && NOT_ENET_RXSTORE_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((VLAN_CONFIG_OPTION == option) && NOT_ENET_VLAN_CONFIG_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((VLAN_COMPARISON_OPTION == option) && NOT_ENET_VLAN_COMPARISON_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((VLAN_INSERT_OPTION == option) && NOT_ENET_VLAN_INSERT_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((INNERVLAN_INSERT_OPTION == option) && NOT_ENET_INNERVLAN_INSERT_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((FLOWCTL_OPTION == option) && NOT_ENET_FLOWCTL_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((FILTER_OPTION == option) && NOT_ENET_FILTER_OPTION(para)) {
