sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((HALFDUPLEX_OPTION == option) && NOT_ENET_HALFDUPLEX_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((PACKETSIZE_OPTION == option) && NOT_ENET_PACKETSIZE_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((TIMER_OPTION == option) && NOT_ENET_TIMER_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((MACCONTROL_OPTION == option) && NOT_ENET_MACCONTROL_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((INTERFRAMEGAP_OPTION == option) && NOT_ENET_INTERFRAMEGAP_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((ECCCONTROL_OPTION == option) && NOT_ENET_ECCCONTROL_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((DPPCONTROL_OPTION == option) && NOT_ENET_DPPCONTROL_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((FSMCONTROL_OPTION == option) && NOT_ENET_FSMCONTROL_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((ESTCONTROL_OPTION == option) && NOT_ENET_ESTCONTROL_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else if((FPECONTROL_OPTION== option) && NOT_ENET_FPECONTROL_OPTION(para)) {
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(option) {
        case FORWARD_OPTION:
            /* choose to configure forward_frame, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)FORWARD_OPTION;
            enet_initpara.forward_frame = para;
            break;
        case DMABUS_OPTION:
            /* choose to configure dmabus_mode, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)DMABUS_OPTION;
            enet_initpara.dmabus_mode = para;
            break;
        case DMACH0_MAXBURST_OPTION:
            /* choose to configure dmach0_maxburst, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)DMACH0_MAXBURST_OPTION;
            enet_initpara.dmach0_maxburst = para;
            break;
        case DMACH1_MAXBURST_OPTION:
            /* choose to configure dmach1_maxburst, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)DMACH1_MAXBURST_OPTION;
            enet_initpara.dmach1_maxburst = para;
            break;
        case DMA_ARBITRATION_OPTION:
            /* choose to configure dma_arbitration, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)DMA_ARBITRATION_OPTION;
            enet_initpara.dma_arbitration = para;
            break;
        case TX0STORE_OPTION:
            /* choose to configure store_forward_mode, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)TX0STORE_OPTION;
            enet_initpara.tx0store_forward_mode = para;
            break;
        case RX0STORE_OPTION:
            /* choose to configure store_forward_mode, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)RX0STORE_OPTION;
            enet_initpara.rx0store_forward_mode = para;
            break;
        case TX1STORE_OPTION:
            /* choose to configure store_forward_mode, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)TX1STORE_OPTION;
            enet_initpara.tx1store_forward_mode = para;
            break;
        case RX1STORE_OPTION:
            /* choose to configure store_forward_mode, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)RX1STORE_OPTION;
            enet_initpara.rx1store_forward_mode = para;
            break;
        case VLAN_CONFIG_OPTION:
            /* choose to configure vlan_config, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)VLAN_CONFIG_OPTION;
            enet_initpara.vlan_config = para;
            break;
        case VLAN_COMPARISON_OPTION:
            /* choose to configure vlan_config, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)VLAN_COMPARISON_OPTION;
            enet_initpara.vlan_compare = para;
            break;
        case VLAN_INSERT_OPTION:
            /* choose to configure vlan_config, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)VLAN_INSERT_OPTION;
            enet_initpara.vlan_insert = para;
            break;
        case INNERVLAN_INSERT_OPTION:
            /* choose to configure vlan_config, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)INNERVLAN_INSERT_OPTION;
            enet_initpara.innervlan_insert = para;
            break;
        case FLOWCTL_OPTION:
            /* choose to configure flow_control, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)FLOWCTL_OPTION;
            enet_initpara.flow_control = para;
            break;
        case HASHH_OPTION:
            /* choose to configure hashtable_high, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)HASHH_OPTION;
            enet_initpara.hashtable_high = para;
            break;
        case HASHL_OPTION:
            /* choose to configure hashtable_low, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)HASHL_OPTION;
            enet_initpara.hashtable_low = para;
            break;
        case FILTER_OPTION:
            /* choose to configure framesfilter_mode, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)FILTER_OPTION;
            enet_initpara.framesfilter_mode = para;
            break;
        case HALFDUPLEX_OPTION:
            /* choose to configure halfduplex_param, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)HALFDUPLEX_OPTION;
            enet_initpara.halfduplex_param = para;
            break;
        case FULLDUPLEX_OPTION:
            /* choose to configure halfduplex_param, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)FULLDUPLEX_OPTION;
            enet_initpara.fullduplex_param = para;
            break;
        case PACKETSIZE_OPTION:
            /* choose to configure halfduplex_param, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)PACKETSIZE_OPTION;
            enet_initpara.packetsize_config = para;
            break;
        case TIMER_OPTION:
            /* choose to configure timer_config, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)TIMER_OPTION;
            enet_initpara.timer_config = para;
            break;
        case MACCONTROL_OPTION:
            /* choose to configure timer_config, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)MACCONTROL_OPTION;
            enet_initpara.maccontrol_param = para;
            break;
        case INTERFRAMEGAP_OPTION:
            /* choose to configure interframegap, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)INTERFRAMEGAP_OPTION;
            enet_initpara.interframegap = para;
            break;
        case ECCCONTROL_OPTION:
            /* choose to configure ecccontrol, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)ECCCONTROL_OPTION;
            enet_initpara.ecccontrol = para;
            break;
        case DPPCONTROL_OPTION:
            /* choose to configure dppcontrol, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)DPPCONTROL_OPTION;
            enet_initpara.dppcontrol = para;
            break;
        case FSMCONTROL_OPTION:
            /* choose to configure fsmcontrol, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)FSMCONTROL_OPTION;
            enet_initpara.fsmcontrol = para;
            break;
        case ESTCONTROL_OPTION:
            /* choose to configure fsmcontrol, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)ESTCONTROL_OPTION;
            enet_initpara.estcontrol = para;
            break;
        case FPECONTROL_OPTION:
            /* choose to configure fsmcontrol, and save the configuration parameters */
            enet_initpara.option_enable |= (uint32_t)FPECONTROL_OPTION;
            enet_initpara.fpecontrol = para;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      initialize ENET parameter structure with a default value
    \param[in]  type: the type of ENET parameter struct
                only one parameter can be selected which is shown as below:
      \arg        ENET_MTL0_INIT_STRUCT: the ENET MTL0 initial struct
      \arg        ENET_MTL1_INIT_STRUCT: the ENET MTL1 initial struct
      \arg        ENET_DMA_CH0_INIT_STRUCT: the ENET DMA channel0 initial struct
      \arg        ENET_DMA_CH0_INIT_STRUCT: the ENET DMA channel1 initial struct
      \arg        ENET_MAC_INIT_STRUCT: the ENET MAC initial struct
      \arg        ENET_TXQ1_CBS_INIT_STRUCT: the ENET MAC initial struct
      \arg        ENET_PHY_CFG_INIT_STRUCT: the ENET PHY config initial struct
      \arg        ENET_EST_CFG_INIT_STRUCT: the ENET EST config initial struct
      \arg        ENET_FPE_CFG_INIT_STRUCT: the ENET FPE config initial struct
    \param[in]  p_struct: the pointer of the specific struct
    \param[out] none
    \retval     none
*/
void enet_struct_para_init(enet_struct_type_enum type, void *p_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(p_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
     {
    /* get type of the struct */
    switch(type) {
    /* used for enet_init() */
    case ENET_MTL0_INIT_STRUCT:
        ((enet_mtl_config_struct *)p_struct)->TxqAlgo = WEIGHTED_ROUND_ROBIN;
        ((enet_mtl_config_struct *)p_struct)->Txqthreshold = TX_THRESHOLD_32BYTES;
        ((enet_mtl_config_struct *)p_struct)->Txqforwardmode = TX_MODE_STOREFORWARD;
        ((enet_mtl_config_struct *)p_struct)->Txweight = 0x1U;
        ((enet_mtl_config_struct *)p_struct)->Txprioritysel = 0;
        ((enet_mtl_config_struct *)p_struct)->Txqmode = QUE_OP_MODE_ENABLE;
        ((enet_mtl_config_struct *)p_struct)->RxqAlgo = WEIGHTED_STRICT_PRIORITY;
        ((enet_mtl_config_struct *)p_struct)->Rxqthreshold = RX_THRESHOLD_32BYTES;
        ((enet_mtl_config_struct *)p_struct)->Rxqforwardmode = RX_MODE_STOREFORWARD;
        ((enet_mtl_config_struct *)p_struct)->Rxweight = 1;
        ((enet_mtl_config_struct *)p_struct)->Rxprioritysel = 0;
        ((enet_mtl_config_struct *)p_struct)->Rxqmode = QUE_OP_MODE_ENABLE;
        ((enet_mtl_config_struct *)p_struct)->dmachsel = DMACH0;
        break;
    case ENET_MTL1_INIT_STRUCT:
        ((enet_mtl_config_struct *)p_struct)->TxqAlgo = WEIGHTED_ROUND_ROBIN;
        ((enet_mtl_config_struct *)p_struct)->Txqthreshold = TX_THRESHOLD_32BYTES;
        ((enet_mtl_config_struct *)p_struct)->Txqforwardmode = TX_MODE_STOREFORWARD;
        ((enet_mtl_config_struct *)p_struct)->Txweight = 0x1U;
        ((enet_mtl_config_struct *)p_struct)->Txprioritysel = 0;
        ((enet_mtl_config_struct *)p_struct)->Txqmode = QUE_OP_MODE_ENABLE;
        ((enet_mtl_config_struct *)p_struct)->RxqAlgo = WEIGHTED_STRICT_PRIORITY;
        ((enet_mtl_config_struct *)p_struct)->Rxqthreshold = RX_THRESHOLD_32BYTES;
        ((enet_mtl_config_struct *)p_struct)->Rxqforwardmode = RX_MODE_STOREFORWARD;
        ((enet_mtl_config_struct *)p_struct)->Rxweight = 1;
        ((enet_mtl_config_struct *)p_struct)->Rxprioritysel = 0;
        ((enet_mtl_config_struct *)p_struct)->Rxqmode = QUE_OP_MODE_ENABLE;
        ((enet_mtl_config_struct *)p_struct)->dmachsel = DMACH1;
        break;
    case ENET_DMA_CH0_INIT_STRUCT:
        ((enet_dma_config_struct *)p_struct)->interruptmode = INT_MODE0;
        ((enet_dma_config_struct *)p_struct)->addrbeats = 1;
        ((enet_dma_config_struct *)p_struct)->burstlength = 64;
        ((enet_dma_config_struct *)p_struct)->bufsize = ENET_RXBUF_SIZE;
        ((enet_dma_config_struct *)p_struct)->priorityratio = ARBITRATION_RXTX_1_1;
        ((enet_dma_config_struct *)p_struct)->DmaTxAlgo = FIXED_PRIORITY_DMA_TX;
        ((enet_dma_config_struct *)p_struct)->DmaScheme = FIXED_PRIORITY_DMA_SCHEME;
        break;
    case ENET_DMA_CH1_INIT_STRUCT:
        ((enet_dma_config_struct *)p_struct)->interruptmode = INT_MODE0;
        ((enet_dma_config_struct *)p_struct)->addrbeats = 1;
        ((enet_dma_config_struct *)p_struct)->burstlength = 32;
        ((enet_dma_config_struct *)p_struct)->bufsize = ENET_RXBUF_SIZE;
        ((enet_dma_config_struct *)p_struct)->priorityratio = ARBITRATION_RXTX_1_1;
        ((enet_dma_config_struct *)p_struct)->DmaTxAlgo = FIXED_PRIORITY_DMA_TX;
        ((enet_dma_config_struct *)p_struct)->DmaScheme = FIXED_PRIORITY_DMA_SCHEME;
        break;
    case ENET_MAC_INIT_STRUCT:                             
        ((enet_mac_config_struct *)p_struct)->Speedstatus = MAC_LAYER_SPEED_100M;
        ((enet_mac_config_struct *)p_struct)->Duplexstatus = ENET_FULL_DUPLEX;
        ((enet_mac_config_struct *)p_struct)->MacConfig = ENET_TYPEPACKET_CRC_STRIP_DISABLE | ENET_AUTO_PADCRC_STRIP_DISABLE | ENET_WATCHDOG_ENABLE \
                | ENET_JABBER_ENABLE | ENET_JUMBO_PACKET_ENABLE | ENET_LOOPBACKMODE_DISABLE | ENET_ARP_OFFLOAD_ENABLE\
                | ENET_CARRIERSENSE_DISABLE | ENET_RECEIVEOWN_DISABLE | ENET_FULLDUPLEX_CARRIERSENSE_ENABLE \
                | ENET_RETRYTRANSMISSION_ENABLE | ENET_DEFERRALCHECK_DISABLE | ENET_BACKOFFLIMIT_10 | ENET_PREAMBLE_LENGTH_7BYTE \
                | ENET_2KMAX_PACKET_DISABLE | ENET_GIANT_PACKET_LIMIT_DISABLE | ENET_CHECKSUMOFFLOAD_DISABLE \
                | ENET_INTERPACKETGAP_96BIT;
        ((enet_mac_config_struct *)p_struct)->FilterConfig = ENET_L3L4_FILTER_DISABLE \
                | ENET_CONTROL_PACKET_PREVENT_PAUSEFRAME | ENET_RECEIVE_ALL_DISABLE | ENET_DROP_NONTCPUDP_DISABLE \
                | ENET_BROADCASTFRAMES_ENABLE | ENET_MULTICAST_FILTER_PASS | ENET_DEST_FILTER_INVERSE_DISABLE \
                | ENET_PROMISCUOUS_DISABLE | ENET_VLAN_FILTER_DISABLE;
        ((enet_mac_config_struct *)p_struct)->Txqflowctrl = MAC_Q0_TX_FLOW_CTRL_PT(0) | ENET_ZERO_QUANTA_PAUSE_DISABLE \
                | ENET_PAUSETIME_MINUS4 | ENET_TX_FLOWCONTROL_DISABLE | ENET_BACK_PRESSURE_DISABLE;
        break;
    case ENET_TXQ1_CBS_INIT_STRUCT:
        ((enet_cbs_config_struct *)p_struct)->IdleSlopeCredit = 0;
        ((enet_cbs_config_struct *)p_struct)->SendSlopeCredit = 0;
        ((enet_cbs_config_struct *)p_struct)->loCredit = 0;
        ((enet_cbs_config_struct *)p_struct)->HiCredit = 0;
        ((enet_cbs_config_struct *)p_struct)->CreditControl = DISABLE;
        break;
    case ENET_PHY_CFG_INIT_STRUCT:
        ((enet_phyconfig_struct *)p_struct)->PhyAddr = 0;
        ((enet_phyconfig_struct *)p_struct)->RegAddr = 0;
        ((enet_phyconfig_struct *)p_struct)->DevAddr = 0;
        ((enet_phyconfig_struct *)p_struct)->PhyValue = 0;
        break;
    case ENET_EST_CFG_INIT_STRUCT:
        ((enet_ESTConfig_struct *)p_struct)->BTRinsecond = 0;
        ((enet_ESTConfig_struct *)p_struct)->BTRinnanosecond = 0;
        ((enet_ESTConfig_struct *)p_struct)->CTRinsecond = 0;
        ((enet_ESTConfig_struct *)p_struct)->CTRinnanosecond = 0;
        ((enet_ESTConfig_struct *)p_struct)->TERtime = 0;
        ((enet_ESTConfig_struct *)p_struct)->LLRdepth = 0;
        break;
     case ENET_GCL_CFG_INIT_STRUCT:
        ((enet_GCLConfig_struct *)p_struct)->Ctrlconfig = 0;
        ((enet_GCLConfig_struct *)p_struct)->Ethtimeinterval = 0;
        break;
    case ENET_FPE_CFG_INIT_STRUCT:
        ((enet_FPEConfig_struct *)p_struct)->FPEenable = DISABLE;
        ((enet_FPEConfig_struct *)p_struct)->Relasetime = 0;
        ((enet_FPEConfig_struct *)p_struct)->Holdtime = 0;
        break;
    default:
        break;
    }
}
}

/*!
    \brief      initialize ENET MAC
    \param[in]  Config: pointer to a enet_mac_config_struct structure which contains
                parameters of MAC config
                members of the structure and the member values are shown as below:
                  Speedstatus: MAC_LAYER_SPEED_10M / MAC_LAYER_SPEED_100M
                  Duplexstatus: ENET_HALF_DUPLEX / ENET_FULL_DUPLEX
                  MacConfig: MAC related config information
                      -  ENET_ARP_OFFLOAD_ENABLE/ ENET_ARP_OFFLOAD_DISABLE
                      -  ENET_SARC_INTERNAL_SIGNAL/ ENET_SARC_ADDR0_INSERT/
                         ENET_SARC_ADDR0_REPLACE/ ENET_SARC_ADDR1_INSERT/ 
                         ENET_SARC_ADDR1_REPLACE;
                      -  ENET_CHECKSUMOFFLOAD_ENABLE / ENET_CHECKSUMOFFLOAD_DISABLE
                      -  ENET_INTERPACKETGAP_96BIT/ ENET_INTERPACKETGAP_88BIT/
                         ENET_INTERPACKETGAP_80BIT/ ENET_INTERPACKETGAP_72BIT/
                         ENET_INTERPACKETGAP_64BIT/ ENET_INTERPACKETGAP_56BIT/
                         ENET_INTERPACKETGAP_48BIT/ ENET_INTERPACKETGAP_40BIT
                      -  ENET_GIANT_PACKET_LIMIT_ENABLE/ ENET_GIANT_PACKET_LIMIT_DISABLE
                      -  ENET_2KMAX_PACKET_ENABLE/ ENET_2KMAX_PACKET_DISABLE
                      -  ENET_TYPEPACKET_CRC_STRIP_ENABLE/ ENET_TYPEPACKET_CRC_STRIP_DISABLE
                      -  ENET_AUTO_PADCRC_STRIP_ENABLE/ ENET_AUTO_PADCRC_STRIP_DISABLE
                      -  ENET_WATCHDOG_ENABLE/ ENET_WATCHDOG_DISABLE
                      -  ENET_JABBER_ENABLE/ ENET_JABBER_DISABLE
                      -  ENET_JUMBO_PACKET_ENABLE/ ENET_JUMBO_PACKET_DISABLE ;
                      -  ENET_FULLDUPLEX_CARRIERSENSE_ENABLE/ ENET_FULLDUPLEX_CARRIERSENSE_DISABLE
                      -  ENET_RECEIVEOWN_ENABLE/ ENET_RECEIVEOWN_DISABLE ;
                      -  ENET_CARRIERSENSE_ENABLE/ ENET_CARRIERSENSE_DISABLE
                      -  ENET_RETRYTRANSMISSION_ENABLE/ ENET_RETRYTRANSMISSION_DISABLE
                      -  ENET_BACKOFFLIMIT_10/ ENET_BACKOFFLIMIT_8/
                         ENET_BACKOFFLIMIT_4/ ENET_BACKOFFLIMIT_1 ;
                      -  ENET_DEFERRALCHECK_ENABLE/ ENET_DEFERRALCHECK_DISABLE
                      -  ENET_PREAMBLE_LENGTH_7BYTE/ ENET_PREAMBLE_LENGTH_5BYTE/
                         ENET_PREAMBLE_LENGTH_3BYTE;
                  FilterConfig: MAC filter related config information
                      -  ENET_PROMISCUOUS_ENABLE / ENET_PROMISCUOUS_DISABLE
                      -  ENET_RECEIVE_ALL_ENABLE / ENET_RECEIVE_ALL_DISABLE
                      -  ENET_BROADCASTFRAMES_ENABLE / ENET_BROADCASTFRAMES_DISABLE
                      -  ENET_SRC_FILTER_NORMAL_ENABLE/ ENET_SRC_FILTER_INVERSE_ENABLE/
                         ENET_SRC_FILTER_DISABLE ;
                      -  ENET_DEST_FILTER_INVERSE_ENABLE/ ENET_DEST_FILTER_INVERSE_DISABLE ;
                      -  ENET_MULTICAST_FILTER_HASH_OR_PERFECT/ ENET_MULTICAST_FILTER_HASH/
                         ENET_MULTICAST_FILTER_PERFECT/ ENET_MULTICAST_FILTER_NONE/
                         ENET_MULTICAST_FILTER_PASS;
                      -  ENET_DROP_NONTCPUDP_ENABLE/ENET_DROP_NONTCPUDP_DISABLE;
                      -  ENET_VLAN_FILTER_ENABLE/ENET_VLAN_FILTER_DISABLE;
                      -  ENET_L3L4_FILTER_ENABLE/ENET_L3L4_FILTER_DISABLE;
                      -  ENET_UNICAST_FILTER_EITHER/ ENET_UNICAST_FILTER_HASH/
                         ENET_UNICAST_FILTER_PERFECT ;
                      -  ENET_PCF_PREVENT_ALL/ ENET_PCF_PREVENT_PAUSEFRAME/
                         ENET_PCF_FORWARD_ALL/ ENET_PCF_FORWARD_FILTERED .
                  Txqflowctrl: TXQ0 flow control related config information
                      -  MAC_Q0_TX_FLOW_CTRL_PT(regval) ;
                      -  ENET_ZERO_QUANTA_PAUSE_ENABLE/ ENET_ZERO_QUANTA_PAUSE_DISABLE ;
                         ENET_PAUSETIME_MINUS4/ ENET_PAUSETIME_MINUS28/
                         ENET_PAUSETIME_MINUS36/ ENET_PAUSETIME_MINUS144/
                         ENET_PAUSETIME_MINUS256/ENET_PAUSETIME_MINUS256_2 ;
                      -  ENET_MAC0_AND_UNIQUE_ADDRESS_PAUSEDETECT/ ENET_UNIQUE_PAUSEDETECT ;
                      -  ENET_RX_FLOWCONTROL_ENABLE/ ENET_RX_FLOWCONTROL_DISABLE ;
                      -  ENET_TX_FLOWCONTROL_ENABLE/ ENET_TX_FLOWCONTROL_DISABLE ;
                      -  ENET_RXQ0_HARDWARE_FLOW_CONTROL_ENABLE/ ENET_RXQ0_HARDWARE_FLOW_CONTROL_DISABLE ;
                      -  ENET_RXQ1_HARDWARE_FLOW_CONTROL_ENABLE/ ENET_RXQ1_HARDWARE_FLOW_CONTROL_DISABLE ;
    \param[out] none
    \retval     none
*/
void enet_mac_init(enet_mac_config_struct *Config)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
   if(NOT_VALID_POINTER(Config)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
     {
    ENET_MAC_Q0_TX_FLOW_CTRL = Config->Txqflowctrl;

    /* Set MAC packet filter. */
    ENET_MAC_PACKET_FILTER = Config->FilterConfig;

