sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    ENET_MAC_CONFIGURATION = Config->MacConfig | MAC_CONFIGURATION_FES(Config->Speedstatus) | MAC_CONFIGURATION_DM(Config->Duplexstatus);
    
    /* MMC */
    /* disable MMC Rx interrupt */
    ENET_MMC_RX_INTERRUPT_MASK |= MMC_INTERRUPT_MASK_VALUE;

    /* disable MMC Tx interrupt */
    ENET_MMC_TX_INTERRUPT_MASK |= MMC_INTERRUPT_MASK_VALUE;
    
    /* disable MMC FPE Tx interrupt */
    ENET_MMC_FPE_TX_INTERRUPT_MASK |= (ENET_MMC_FPE_TX_INTERRUPT_MASK_HRCIM | ENET_MMC_FPE_TX_INTERRUPT_MASK_FCIM);
    
    /* disable MMC FPE Rx interrupt */
    ENET_MMC_FPE_RX_INTERRUPT_MASK |= (ENET_MMC_FPE_RX_INTERRUPT_MASK_FCIM | ENET_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM \
                                       | ENET_MMC_FPE_RX_INTERRUPT_MASK_PSECIM | ENET_MMC_FPE_RX_INTERRUPT_MASK_PAECIM);
    
    /* disable MMC IPC Rx interrupt */
    ENET_MMC_IPC_RX_INTERRUPT_MASK |= MMC_IPC_INTERRUPT_MASK_VALUE;

}
}

/*!
    \brief      initialize ENET DMA
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  Config: pointer to a enet_dma_config_struct structure which contains
                parameters of DMA config
                members of the structure and the member values are shown as below:
                  interruptmode: DMA interrupt mode
                  burstlength: the burst length,must be 1,2,4,8,16,32,64,128,256
                  bufsize: the buffer size
                  priorityratio: ARBITRATION_RXTX_1_1 / ARBITRATION_RXTX_2_1 / ARBITRATION_RXTX_3_1 \
                                 / ARBITRATION_RXTX_4_1 / ARBITRATION_RXTX_5_1 / ARBITRATION_RXTX_6_1 \
                                 / ARBITRATION_RXTX_7_1 / ARBITRATION_RXTX_8_1 / ARBITRATION_TXRX_1_1 \
                                 / ARBITRATION_TXRX_2_1 / ARBITRATION_TXRX_3_1 / ARBITRATION_TXRX_4_1 \
                                 / ARBITRATION_TXRX_5_1 / ARBITRATION_TXRX_6_1 / ARBITRATION_TXRX_7_1 \
                                 / ARBITRATION_TXRX_8_1
                  DmaTxAlgo: FIXED_PRIORITY_DMA_TX / WEIGHTED_STRICT_PRIORITY_DMA_TX / WEIGHTED_ROUND_ROBIN_DMA_TX;
                  DmaScheme: FIXED_PRIORITY_DMA_SCHEME / WEIGHTED_ROUND_ROBIN_DMA_SCHEME;
    \param[out] none
    \retval     none
*/
void enet_dma_init(enet_dmach_enum dmach,
                        enet_dma_config_struct *Config)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
   if(NOT_VALID_POINTER(Config)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
        /* Initialize the global DMA registers. */
        ENET_DMA_MODE = ((uint32_t)Config->interruptmode) | ((uint32_t)Config->priorityratio) | ((uint32_t)Config->DmaScheme) | ((uint32_t)Config->DmaTxAlgo);

        ENET_DMA_SYSBUS_MODE = DMA_SYSBUS_MODE_AAL(Config->addrbeats) | ENET_DMA_SYSBUS_MODE_FB;
        switch(dmach) {
        case DMACH0:
            if(32U < Config->burstlength) {
                ENET_DMA_CH0_CONTROL = DMA_CH_CONTROL_DSL(1) | ENET_DMA_CH_CONTROL_PBLx8;
                Config->burstlength = (uint32_t)(Config->burstlength / 8U);
            } else {
                ENET_DMA_CH0_CONTROL = DMA_CH_CONTROL_DSL(1);
            }
#ifdef DMACH0_USE_ENHANCED_MODE
            enet_desc_select_enhanced_mode(DMACH0);
#else
            enet_desc_select_normal_mode(DMACH0);
#endif /* DMACH0_USE_ENHANCED_MODE */
            ENET_DMA_CH0_TX_CONTROL |= (DMA_CH_TX_CONTROL_TxPBL((uint32_t)Config->burstlength) << 8);


            ENET_DMA_CH0_RX_CONTROL = DMA_CH_RX_CONTROL_RxPBL((uint32_t)Config->burstlength) | DMA_CH_RX_CONTROL_RBSZ(((
                                          uint32_t)Config->bufsize));
            break;
        case DMACH1:
            /* Initialize the global DMA registers. */
            if(32U < Config->burstlength) {
                ENET_DMA_CH1_CONTROL = DMA_CH_CONTROL_DSL(1) | ENET_DMA_CH_CONTROL_PBLx8;
            } else {
                ENET_DMA_CH1_CONTROL = DMA_CH_CONTROL_DSL(1);
            }
#ifdef DMACH1_USE_ENHANCED_MODE
            enet_desc_select_enhanced_mode(DMACH1);
#else
            enet_desc_select_normal_mode(DMACH1);
#endif /* DMACH0_USE_ENHANCED_MODE */
            ENET_DMA_CH1_TX_CONTROL |= DMA_CH_TX_CONTROL_TxPBL((uint32_t)Config->burstlength);

            ENET_DMA_CH1_RX_CONTROL = DMA_CH_RX_CONTROL_RxPBL((uint32_t)Config->burstlength) | DMA_CH_RX_CONTROL_RBSZ(((
                                          uint32_t)Config->bufsize));
            break;

        default:
            break;
        }
}
}

/*!
    \brief      initialize ENET MTL
    \param[in]  Instance: choose the MTL process which users want to check, refer to enet_mtl_enum
                only one parameter can be selected which is shown as below
      \arg        MTL0: MTL channel 0
      \arg        MTL1: MTL channel 1
    \param[in]  Config: pointer to a enet_mtl_config_struct structure which contains
                parameters of MTL config
                members of the structure and the member values are shown as below:
                  TxqAlgo: STRICT_PRIORITY_TX / WEIGHTED_ROUND_ROBIN
                  Txqthreshold: TX_THRESHOLD_32BYTES / TX_THRESHOLD_64BYTES / TX_THRESHOLD_96BYTES \
                                 /TX_THRESHOLD_128BYTES / TX_THRESHOLD_192BYTES / TX_THRESHOLD_256BYTES \
                                 / TX_THRESHOLD_284BYTES / TX_THRESHOLD_512BYTES
                  Txqforwardmode: TX_MODE_CUTTHROUGH / TX_MODE_STOREFORWARD
                  Txweight: the weight of transmit queue
                  Txprioritysel: the priority of transmit queue
                  Txqmode: QUE_OP_MODE_DISABLE / QUE_OP_MODE_AVB_ENABLE /QUE_OP_MODE_ENABLE
                  RxqAlgo: STRICT_PRIORITY_RX / WEIGHTED_STRICT_PRIORITY
                  Rxqthreshold: RX_THRESHOLD_32BYTES / RX_THRESHOLD_64BYTES / RX_THRESHOLD_96BYTES / RX_THRESHOLD_128BYTES
                  Rxqforwardmode: RX_MODE_CUTTHROUGH / RX_MODE_STOREFORWARD
                  Rxweight: the weight of receive queue
                  Rxprioritysel: the priority of receive queue
                  Rxqmode: QUE_OP_MODE_DISABLE / QUE_OP_MODE_AVB_ENABLE /QUE_OP_MODE_ENABLE
                  dmachsel: DMACH0 / DMACH1
    \param[out] none
    \retval     none
*/
void enet_mtl_init(enet_mtl_enum Instance, enet_mtl_config_struct *Config)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
   if(NOT_VALID_POINTER(Config)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0006U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(Instance) {
    case MTL0: 
        /* Set the global Tx Scheduling Algorithm affecting Tx Queues 0 */
        ENET_MTL_OPERATION_MODE = (uint32_t)(Config->TxqAlgo);
        if(Config->TxqAlgo == WEIGHTED_ROUND_ROBIN) {
            enet_txq_weight_set(TXQ0, Config->Txweight);
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        ENET_MTL_TXQ0_OPERATION_MODE = MTL_TXQ_OPERATION_MODE_TSF((uint32_t)(Config->Txqforwardmode)) | MTL_TXQ_OPERATION_MODE_TTC((uint32_t)(
                                           Config->Txqthreshold));
        enet_txq_mode_size_set(TXQ0, Config->Txqmode, MTL_TX_FIFO_SIZE);


