sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
        enet_rxq_weight_set(RXQ0, Config->Rxweight);
        ENET_MTL_OPERATION_MODE |= (uint32_t)(Config->RxqAlgo);
        ENET_MTL_RXQ0_OPERATION_MODE = MTL_RXQ_OPERATION_MODE_RSF((uint32_t)(Config->Rxqforwardmode)) | MTL_RXQ_OPERATION_MODE_RTC((uint32_t)(
                                           Config->Rxqthreshold));
        enet_rxq_dma_select(RXQ0, DMACH0);
        enet_rxq_size_set(RXQ0, MTL_RX_FIFO_SIZE);
        enet_rxq_mode_set(RXQ0, Config->Rxqmode, (uint8_t)Config->Rxprioritysel);
        break;
    case MTL1: 
        /* Set the global Tx Scheduling Algorithm affecting Tx Queues 1*/
        ENET_MTL_OPERATION_MODE = (uint32_t)(Config->TxqAlgo);
        if(Config->TxqAlgo == WEIGHTED_ROUND_ROBIN) {
            enet_txq_weight_set(TXQ1, Config->Txweight);
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        ENET_MTL_TXQ1_OPERATION_MODE = MTL_TXQ_OPERATION_MODE_TSF((uint32_t)(Config->Txqforwardmode)) | MTL_TXQ_OPERATION_MODE_TTC((uint32_t)(
                                           Config->Txqthreshold));
        /* Enable the Tx Queue in the given mode and set its size  */
        enet_txq_mode_size_set(TXQ1, Config->Txqmode, MTL_TX_FIFO_SIZE);

        enet_rxq_weight_set(RXQ1, Config->Rxweight);
        ENET_MTL_OPERATION_MODE |= (uint32_t)(Config->RxqAlgo);
        ENET_MTL_RXQ1_OPERATION_MODE = MTL_RXQ_OPERATION_MODE_RSF((uint32_t)(Config->Rxqforwardmode)) | MTL_RXQ_OPERATION_MODE_RTC((uint32_t)(
                                           Config->Rxqthreshold));
        /* Set 1:1 mapping between Rx Queues and Rx DMA Channels */
        enet_rxq_dma_select(RXQ1, DMACH1);
        /* Set the size of the Rx Queue */
        enet_rxq_size_set(RXQ1, MTL_RX_FIFO_SIZE);
        enet_rxq_mode_set(RXQ1, Config->Rxqmode, (uint8_t)Config->Rxprioritysel);
        break;
    default: 
        break;
    }
    }
}

/*!
    \brief      initialize ENET peripheral with generally concerned parameters and the less cared
                parameters
    \param[in]  mediamode: PHY mode and mac loopback configurations, only one parameter can be selected
                           which is shown as below, refer to enet_mediamode_enum
      \arg        ENET_AUTO_NEGOTIATION: PHY auto negotiation
      \arg        ENET_100M_FULLDUPLEX: 100Mbit/s, full-duplex
      \arg        ENET_100M_HALFDUPLEX: 100Mbit/s, half-duplex
      \arg        ENET_10M_FULLDUPLEX: 10Mbit/s, full-duplex
      \arg        ENET_10M_HALFDUPLEX: 10Mbit/s, half-duplex
      \arg        ENET_LOOPBACKMODE: MAC in loopback mode
    \param[in]  checksum: IP frame checksum offload function, only one parameter can be selected
                          which is shown as below, refer to enet_chksumconf_enum
      \arg        ENET_NO_AUTOCHECKSUM: disable IP frame checksum function
      \arg        ENET_AUTOCHECKSUM_DROP_FAILFRAMES: enable IP frame checksum function
      \arg        ENET_AUTOCHECKSUM_ACCEPT_FAILFRAMES: enable IP frame checksum function, and the received frame
                                                       with only payload error but no other errors will not be dropped
    \param[in]  recept: frame filter function, only one parameter can be selected
                          which is shown as below, refer to enet_frmrecept_enum
      \arg        ENET_PROMISCUOUS_MODE: promiscuous mode enabled
      \arg        ENET_RECEIVEALL: all received frame are forwarded to application
      \arg        ENET_BROADCAST_FRAMES_PASS: the address filters pass all received broadcast frames
      \arg        ENET_BROADCAST_FRAMES_DROP: the address filters filter all incoming broadcast frames
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus enet_init(enet_mediamode_enum mediamode, enet_chksumconf_enum checksum, enet_frmrecept_enum recept)
{
    uint32_t reg_value, reg_temp, temp;
    uint32_t media_temp;
    uint32_t timeout = 0U;
    uint32_t optimeout = ENET_OPERATION_TIMEROUT;
    ErrStatus phy_state, enet_state = ERROR;
    enet_phyconfig_struct phy_config = {PHY_ADDRESS, PHY_REG_BSR, 0, 0};

    /* PHY interface configuration, configure SMI clock and reset PHY chip */
    if(ERROR == enet_phy_config()) {
        ENET_DELAY(PHY_RESETDELAY);
        if(ERROR == enet_phy_config()) {
            return enet_state;
        }
    }

    /* 1st, configure mediamode */
    media_temp = (uint32_t)mediamode;
    /* if is PHY auto negotiation */
    if((uint32_t)ENET_AUTO_NEGOTIATION == media_temp) {
        /* wait for PHY_LINKED_STATUS bit be set */
        do {
            phy_state = enet_phy_write_read(&phy_config, ENET_PHY_READ, DISABLE);
            phy_config.PhyValue &= PHY_LINKED_STATUS;
            timeout++;
        } while(((uint16_t)RESET == phy_config.PhyValue) && (timeout < PHY_READ_TO));
        /* return ERROR due to timeout */
        if(PHY_READ_TO == timeout) {
            return enet_state;
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        
        if(SUCCESS != phy_state) {
            /* return ERROR due to write timeout */
            return enet_state;
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        /* reset timeout counter */
        timeout = 0U;

        /* enable auto-negotiation */
        phy_config.PhyValue = PHY_AUTONEGOTIATION;
        phy_config.RegAddr = PHY_REG_BCR;
        phy_state = enet_phy_write_read(&phy_config, ENET_PHY_WRITE, DISABLE);
        if(SUCCESS != phy_state) {
            /* return ERROR due to write timeout */
            return enet_state;
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        phy_config.RegAddr = PHY_REG_BSR;
        /* wait for the PHY_AUTONEGO_COMPLETE bit be set */
        do {
            phy_state = enet_phy_write_read(&phy_config, ENET_PHY_READ, DISABLE);
            phy_config.PhyValue &= PHY_AUTONEGO_COMPLETE;
            timeout++;
        } while(((uint16_t)RESET == phy_config.PhyValue) && (timeout < (uint32_t)PHY_READ_TO));
        /* return ERROR due to timeout */
        if(PHY_READ_TO == timeout) {
            return enet_state;
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        if(SUCCESS != phy_state) {
            /* return ERROR due to write timeout */
            return enet_state;
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        phy_config.RegAddr = PHY_SR;
        /* read the result of the auto-negotiation */
        phy_state = enet_phy_write_read(&phy_config, ENET_PHY_READ, DISABLE);
        if(SUCCESS != phy_state) {
            /* return ERROR due to write timeout */
            return enet_state;
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        /* configure the duplex mode of MAC following the auto-negotiation result */
        if((uint16_t)RESET != (phy_config.PhyValue & PHY_DUPLEX_STATUS)) {
            media_temp = ENET_MODE_FULLDUPLEX;
        } else {
            media_temp = ENET_MODE_HALFDUPLEX;
        }
#if(PHY_TYPE == YT8512)
        /* configure the communication speed of MAC following the auto-negotiation result */
        if((uint16_t)RESET != (phy_config.PhyValue & PHY_SPEED_STATUS)) {
            media_temp |= ENET_SPEEDMODE_100M;
        } else {
            media_temp |= ENET_SPEEDMODE_10M;
        }
#else
        /* configure the communication speed of MAC following the auto-negotiation result */
        if((uint16_t)RESET != (phy_config.PhyValue & PHY_SPEED_STATUS)) {
            media_temp |= ENET_SPEEDMODE_10M;
        } else {
            media_temp |= ENET_SPEEDMODE_100M;
        }
#endif /* PHY_TYPE == YT8512 */
    } else {
        phy_config.PhyValue = (uint16_t)((media_temp & ENET_MAC_CONFIGURATION_DM) >> 3U);
        phy_config.PhyValue |= (uint16_t)((media_temp & ENET_MAC_CONFIGURATION_FES) >> 1U);
        phy_state = enet_phy_write_read(&phy_config, ENET_PHY_WRITE, DISABLE);
        if(SUCCESS != phy_state) {
            /* return ERROR due to write timeout */
            return enet_state;
        } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
        /* PHY configuration need some time */
        ENET_DELAY(PHY_CONFIGDELAY);
    }
    /* after configuring the PHY, use mediamode to configure registers */
    reg_value = ENET_MAC_CONFIGURATION;
    /* configure ENET_MAC_CFG register */
    reg_value &= (~(ENET_MAC_CONFIGURATION_FES | ENET_MAC_CONFIGURATION_DM | ENET_MAC_CONFIGURATION_LM));
    reg_value |= media_temp;
    ENET_MAC_CONFIGURATION = reg_value;

    /* 2st, configure checksum */
    if((uint32_t)RESET != ((uint32_t)checksum & ENET_CHECKSUMOFFLOAD_ENABLE)) {
        ENET_MAC_CONFIGURATION |= ENET_CHECKSUMOFFLOAD_ENABLE;

        reg_value = ENET_MTL_RXQ0_OPERATION_MODE;
        /* configure ENET_MTL_RXQ0_OPERATION_MODE register */
        reg_value &= ~ENET_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF;
        reg_value |= ((uint32_t)checksum & ENET_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF);
        ENET_MTL_RXQ0_OPERATION_MODE = reg_value;

