sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
        reg_value = ENET_MTL_RXQ1_OPERATION_MODE;
        /* configure ENET_MTL_RXQ1_OPERATION_MODE register */
        reg_value &= ~ENET_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF;
        reg_value |= ((uint32_t)checksum & ENET_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF);
        ENET_MTL_RXQ1_OPERATION_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* 3rd, configure recept */
    ENET_MAC_PACKET_FILTER |= (uint32_t)recept;

    /* 4th, configure different function options */
    /* configure forward_frame related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)FORWARD_OPTION)) {
        reg_temp = enet_initpara.forward_frame;

        reg_value = ENET_MAC_CONFIGURATION;
        temp = reg_temp;
        /* configure ENET_MAC_CONFIGURATION register */
        reg_value &= (~(ENET_MAC_CONFIGURATION_CST | ENET_MAC_CONFIGURATION_ACS));
        temp &= (ENET_MAC_CONFIGURATION_CST | ENET_MAC_CONFIGURATION_ACS);
        reg_value |= temp;
        ENET_MAC_CONFIGURATION = reg_value;

        reg_value = ENET_MTL_RXQ0_OPERATION_MODE;
        temp = reg_temp;
        /* configure ENET_MTL_RXQ0_OPERATION_MODE register */
        reg_value &= (~(ENET_MTL_RXQ0_OPERATION_MODE_FEP | ENET_MTL_RXQ0_OPERATION_MODE_FUP));
        temp &= ((ENET_MTL_RXQ0_OPERATION_MODE_FEP | ENET_MTL_RXQ0_OPERATION_MODE_FUP) << 2U);
        reg_value |= (temp >> 2U);
        ENET_MTL_RXQ0_OPERATION_MODE = reg_value;

        reg_value = ENET_MTL_RXQ1_OPERATION_MODE;
        temp = reg_temp;
        /* configure ENET_MTL_RXQ1_OPERATION_MODE register */
        reg_value &= (~(ENET_MTL_RXQ1_OPERATION_MODE_FEP | ENET_MTL_RXQ1_OPERATION_MODE_FUP));
        temp &= (ENET_MTL_RXQ1_OPERATION_MODE_FEP | ENET_MTL_RXQ1_OPERATION_MODE_FUP);
        reg_value |= temp;
        ENET_MTL_RXQ1_OPERATION_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure dmabus_mode related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)DMABUS_OPTION)) {
        temp = enet_initpara.dmabus_mode;

        reg_value = ENET_DMA_SYSBUS_MODE;
        /* configure ENET_DMA_SYSBUS_MODE register */
        reg_value &= ~(ENET_DMA_SYSBUS_MODE_AAL | ENET_DMA_SYSBUS_MODE_FB \
                       | ENET_DMA_SYSBUS_MODE_MB);
        reg_value |= temp;
        ENET_DMA_SYSBUS_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure dmach0_maxburst related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)DMACH0_MAXBURST_OPTION)) {
        reg_temp = enet_initpara.dmach0_maxburst;

        reg_value = ENET_DMA_CH0_RX_CONTROL;
        temp = reg_temp;
        /* configure ENET_DMA_CH0_RX_CONTROL register */
        reg_value &= ~ENET_DMA_CH_RX_CONTROL_RxPBL;
        temp &= ENET_DMA_CH_RX_CONTROL_RxPBL;
        reg_value |= temp;
        ENET_DMA_CH0_RX_CONTROL = reg_value;
    
        reg_value = ENET_DMA_CH0_TX_CONTROL;
        temp = reg_temp;
        /* configure ENET_DMA_CH0_TX_CONTROL register */
        reg_value &= ~ENET_DMA_CH_TX_CONTROL_TxPBL;
        temp &= (ENET_DMA_CH_TX_CONTROL_TxPBL >> 8);
        reg_value |= (temp << 8);
        ENET_DMA_CH0_TX_CONTROL = reg_value;
    
        reg_value = ENET_DMA_CH0_CONTROL;
        temp = reg_temp;
        /* configure ENET_DMA_CH0_CONTROL register */
        reg_value &= ~ENET_DMA_CH_CONTROL_PBLx8;
        temp &= (BIT(15) | BIT(23));
        if((uint32_t)SET == (temp & BIT(15)) || (uint32_t)SET == (temp & BIT(23))){
           reg_value |= ENET_DMA_CH_CONTROL_PBLx8;
        }
        ENET_DMA_CH0_CONTROL = reg_value;

    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure dmach1_maxburst related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)DMACH1_MAXBURST_OPTION)) {
        reg_temp = enet_initpara.dmach1_maxburst;

        reg_value = ENET_DMA_CH1_RX_CONTROL;
        temp = reg_temp;
        /* configure ENET_DMA_CH1_RX_CONTROL register */
        reg_value &= ~ENET_DMA_CH_RX_CONTROL_RxPBL;
        temp &= ENET_DMA_CH_RX_CONTROL_RxPBL;
        reg_value |= temp;
        ENET_DMA_CH1_RX_CONTROL = reg_value;
    
        reg_value = ENET_DMA_CH1_TX_CONTROL;
        temp = reg_temp;
        /* configure ENET_DMA_CH1_TX_CONTROL register */
        reg_value &= ~ENET_DMA_CH_TX_CONTROL_TxPBL;
        temp &= (ENET_DMA_CH_TX_CONTROL_TxPBL >> 8);
        reg_value |= (temp << 8);
        ENET_DMA_CH1_TX_CONTROL = reg_value;
    
        reg_value = ENET_DMA_CH1_CONTROL;
        temp = reg_temp;
        /* configure ENET_DMA_CH1_CONTROL register */
        reg_value &= ~ENET_DMA_CH_CONTROL_PBLx8;
        temp &= (BIT(15) | BIT(23));
        if((uint32_t)SET == (temp & BIT(15)) || (uint32_t)SET == (temp & BIT(23))){
           reg_value |= ENET_DMA_CH_CONTROL_PBLx8;
        }
        ENET_DMA_CH1_CONTROL = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    
    /* configure dma_arbitration related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)DMA_ARBITRATION_OPTION)) {
        temp = enet_initpara.dma_arbitration;

        reg_value = ENET_DMA_MODE;
        /* configure ENET_DMA_MODE register */
        reg_value &= ~(ENET_DMA_MODE_PR | ENET_DMA_MODE_TXPR);
        reg_value |= temp;
        ENET_DMA_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure store_forward_mode related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)TX0STORE_OPTION)) {
        temp = enet_initpara.tx0store_forward_mode;

        reg_value = ENET_MTL_TXQ0_OPERATION_MODE;
        /* configure ENET_MTL_TXQ0_OPERATION_MODE register */
        reg_value &= ~(ENET_MTL_TXQ0_OPERATION_MODE_TTC | ENET_MTL_TXQ0_OPERATION_MODE_TSF);
        reg_value |= temp;
        ENET_MTL_TXQ0_OPERATION_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    /* configure store_forward_mode related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)RX0STORE_OPTION)) {
        temp = enet_initpara.rx0store_forward_mode;

        reg_value = ENET_MTL_RXQ0_OPERATION_MODE;
        /* configure ENET_MTL_RXQ0_OPERATION_MODE register */
        reg_value &= ~(ENET_MTL_RXQ0_OPERATION_MODE_RTC | ENET_MTL_RXQ0_OPERATION_MODE_RSF);
        reg_value |= temp;
        ENET_MTL_RXQ0_OPERATION_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)TX1STORE_OPTION)) {
        temp = enet_initpara.tx1store_forward_mode;

        reg_value = ENET_MTL_TXQ1_OPERATION_MODE;
        /* configure ENET_MTL_TXQ1_OPERATION_MODE register */
        reg_value &= ~(ENET_MTL_TXQ1_OPERATION_MODE_TTC | ENET_MTL_TXQ1_OPERATION_MODE_TSF);
        reg_value |= temp;
        ENET_MTL_TXQ1_OPERATION_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    /* configure store_forward_mode related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)RX1STORE_OPTION)) {
        temp = enet_initpara.rx1store_forward_mode;

