sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
        reg_value = ENET_MTL_RXQ1_OPERATION_MODE;
        /* configure ENET_MTL_RXQ1_OPERATION_MODE register */
        reg_value &= ~(ENET_MTL_RXQ1_OPERATION_MODE_RTC | ENET_MTL_RXQ1_OPERATION_MODE_RSF);
        reg_value |= temp;
        ENET_MTL_RXQ1_OPERATION_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure vlan_config related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)VLAN_CONFIG_OPTION)) {
        reg_temp = enet_initpara.vlan_config;

        reg_value = ENET_MAC_VLAN_TAG_CTRL;
        /* configure ENET_MAC_VLT register */
        reg_value &= ~(ENET_MAC_VLAN_TAG_CTRL_EIVLRXS | ENET_MAC_VLAN_TAG_CTRL_EIVLS | ENET_MAC_VLAN_TAG_CTRL_ERIVLT | ENET_MAC_VLAN_TAG_CTRL_EDVLP |
                       ENET_MAC_VLAN_TAG_CTRL_VTHM | ENET_MAC_VLAN_TAG_CTRL_EVLRXS
                       | ENET_MAC_VLAN_TAG_CTRL_EVLS | ENET_MAC_VLAN_TAG_CTRL_DOVLTC | ENET_MAC_VLAN_TAG_CTRL_ERSVLM | ENET_MAC_VLAN_TAG_CTRL_ESVL |
                       ENET_MAC_VLAN_TAG_CTRL_VTIM | ENET_MAC_VLAN_TAG_CTRL_ETV);
        reg_value |= reg_temp;
        ENET_MAC_VLAN_TAG_CTRL = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    /* configure vlan_config related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)VLAN_COMPARISON_OPTION)) {
        reg_temp = enet_initpara.vlan_compare;
        temp = reg_temp;
        reg_value = ENET_MAC_VLAN_TAG_DATA;
        /* configure ENET_MAC_VLAN_TAG_DATA register */
        reg_value &= ~(ENET_MAC_VLAN_TAG_DATA_VID | ENET_MAC_VLAN_TAG_DATA_VEN | ENET_MAC_VLAN_TAG_DATA_ETV | ENET_MAC_VLAN_TAG_DATA_DOVLTC |
                       ENET_MAC_VLAN_TAG_DATA_ERSVLM | ENET_MAC_VLAN_TAG_DATA_ERIVLT);
        reg_value |= temp;
        ENET_MAC_VLAN_TAG_DATA = reg_value;
        
        reg_value = ENET_MAC_VLAN_TAG_CTRL;
        reg_value &= ~(ENET_MAC_VLAN_TAG_CTRL_OFS | ENET_MAC_VLAN_TAG_CTRL_CT);
        temp &= (ENET_MAC_VLAN_TAG_CTRL_OFS << 19);
        reg_value |= (temp >> 19);
        ENET_MAC_VLAN_TAG_CTRL = reg_value | ENET_MAC_VLAN_TAG_CTRL_OB;
        while(((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_OB))&& ((uint32_t)RESET < optimeout)) {
           optimeout --;
        }
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    /* configure vlan_config related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)VLAN_INSERT_OPTION)) {
        reg_temp = enet_initpara.vlan_insert;

        reg_value = ENET_MAC_VLAN_INCL;
        /* configure ENET_MAC_VLAN_INCL register */
        reg_value &= ~(ENET_MAC_VLAN_INCL_VLTI | ENET_MAC_VLAN_INCL_CSVL | ENET_MAC_VLAN_INCL_VLP | ENET_MAC_VLAN_INCL_VLC);
        reg_value |= reg_temp;
        ENET_MAC_VLAN_INCL = reg_value;
    }
    /* configure vlan_config related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)INNERVLAN_INSERT_OPTION)) {
        reg_temp = enet_initpara.innervlan_insert;

        reg_value = ENET_MAC_INNER_VLAN_INCL;
        /* configure ENET_MAC_INNER_VLAN_INCL register */
        reg_value &= ~(ENET_MAC_INNER_VLAN_INCL_VLTI | ENET_MAC_INNER_VLAN_INCL_CSVL | ENET_MAC_INNER_VLAN_INCL_VLP |
                       ENET_MAC_INNER_VLAN_INCL_VLC); 
        reg_value |= reg_temp;
        ENET_MAC_INNER_VLAN_INCL = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    /* configure flow_control related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)FLOWCTL_OPTION)) {
        reg_temp = enet_initpara.flow_control;

        reg_value = ENET_MAC_Q0_TX_FLOW_CTRL;
        temp = reg_temp;
        /* configure MAC_Q0_TX_FLOW_CTRL register */
        reg_value &= ~(ENET_MAC_Q0_TX_FLOW_CTRL_PT | ENET_MAC_Q0_TX_FLOW_CTRL_DZPQ | ENET_MAC_Q0_TX_FLOW_CTRL_PLT \
                       | ENET_MAC_Q0_TX_FLOW_CTRL_TFE | ENET_MAC_Q0_TX_FLOW_CTRL_FCB_BPA);
        temp &= (ENET_MAC_Q0_TX_FLOW_CTRL_PT | ENET_MAC_Q0_TX_FLOW_CTRL_DZPQ | ENET_MAC_Q0_TX_FLOW_CTRL_PLT \
                 | ENET_MAC_Q0_TX_FLOW_CTRL_TFE | ENET_MAC_Q0_TX_FLOW_CTRL_FCB_BPA);
        reg_value |= temp;
        ENET_MAC_Q0_TX_FLOW_CTRL = reg_value;

        reg_value = ENET_MAC_RX_FLOW_CTRL;
        temp = reg_temp;
        /* configure MAC_RX_FLOW_CTRL register */
        reg_value &= ~(ENET_MAC_RX_FLOW_CTRL_UP | ENET_MAC_RX_FLOW_CTRL_RFE);
        temp &= ((ENET_MAC_RX_FLOW_CTRL_UP | ENET_MAC_RX_FLOW_CTRL_RFE) << 8);
        reg_value |= (temp >> 8);
        ENET_MAC_RX_FLOW_CTRL = reg_value;

        reg_value = ENET_MTL_RXQ0_OPERATION_MODE;
        temp = reg_temp;
        /* configure ENET_MTL_RXQ0_OPERATION_MODE register */
        reg_value &= ~ENET_MTL_RXQ0_OPERATION_MODE_EHFC;
        temp &= (ENET_MTL_RXQ0_OPERATION_MODE_EHFC << 3);
        reg_value |= (temp >> 3);
        ENET_MTL_RXQ0_OPERATION_MODE = reg_value;
        
        reg_value = ENET_MTL_RXQ1_OPERATION_MODE;
        temp = reg_temp;
        /* configure ENET_MTL_RXQ1_OPERATION_MODE register */
        reg_value &= ~ENET_MTL_RXQ1_OPERATION_MODE_EHFC;
        temp &= (ENET_MTL_RXQ1_OPERATION_MODE_EHFC << 4);
        reg_value |= (temp >> 4);
        ENET_MTL_RXQ1_OPERATION_MODE = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure hashtable_high related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)HASHH_OPTION)) {
        ENET_MAC_HASH_TABLE_REG0 = enet_initpara.hashtable_high;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure hashtable_low related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)HASHL_OPTION)) {
        ENET_MAC_HASH_TABLE_REG1 = enet_initpara.hashtable_low;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure framesfilter_mode related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)FILTER_OPTION)) {
        reg_temp = enet_initpara.framesfilter_mode;

