sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
        reg_value = ENET_MAC_PACKET_FILTER;
        /* configure ENET_MAC_PACKET_FILTER register */
        reg_value &= ~(ENET_MAC_PACKET_FILTER_DNTU | ENET_MAC_PACKET_FILTER_IPFE | ENET_MAC_PACKET_FILTER_VTFE \
                       | ENET_MAC_PACKET_FILTER_HPF | ENET_MAC_PACKET_FILTER_SAF | ENET_MAC_PACKET_FILTER_SAIF \
                       | ENET_MAC_PACKET_FILTER_PCF | ENET_MAC_PACKET_FILTER_DBF | ENET_MAC_PACKET_FILTER_PM \
                       | ENET_MAC_PACKET_FILTER_DAIF | ENET_MAC_PACKET_FILTER_HMC | ENET_MAC_PACKET_FILTER_HUC);
        reg_value |= reg_temp;
        ENET_MAC_PACKET_FILTER = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure halfduplex_param related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)HALFDUPLEX_OPTION)) {
        reg_temp = enet_initpara.halfduplex_param;

        reg_value = ENET_MAC_CONFIGURATION;
        /* configure ENET_MAC_CONFIGURATION register */
        reg_value &= ~(ENET_MAC_CONFIGURATION_DCRS | ENET_MAC_CONFIGURATION_DO | ENET_MAC_CONFIGURATION_DR \
                       | ENET_MAC_CONFIGURATION_BL | ENET_MAC_CONFIGURATION_DC);
        reg_value |= reg_temp;
        ENET_MAC_CONFIGURATION = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure fullduplex_param related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)FULLDUPLEX_OPTION)) {
        reg_temp = enet_initpara.fullduplex_param;

        reg_value = ENET_MAC_CONFIGURATION;
        /* configure ENET_MAC_CONFIGURATION register */
        reg_value &= ~(ENET_MAC_CONFIGURATION_ECRSFD | ENET_MAC_CONFIGURATION_PRELEN);
        reg_value |= reg_temp;
        ENET_MAC_CONFIGURATION = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure packet size related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)PACKETSIZE_OPTION)) {
        reg_temp = enet_initpara.packetsize_config;

        reg_value = ENET_MAC_CONFIGURATION;
        /* configure ENET_MAC_CONFIGURATION register */
        reg_value &= ~(ENET_MAC_CONFIGURATION_S2KP | ENET_MAC_CONFIGURATION_JE | ENET_MAC_CONFIGURATION_GPSLCE);
        reg_value |= reg_temp;
        ENET_MAC_CONFIGURATION = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure timer_config related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)TIMER_OPTION)) {
        reg_temp = enet_initpara.timer_config;

        reg_value = ENET_MAC_CONFIGURATION;
        /* configure ENET_MAC_CONFIGURATION register */
        reg_value &= ~(ENET_MAC_CONFIGURATION_WD | ENET_MAC_CONFIGURATION_JD);
        reg_value |= reg_temp;
        ENET_MAC_CONFIGURATION = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }


    /* configure mac control related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)MACCONTROL_OPTION)) {
        reg_temp = enet_initpara.maccontrol_param;

        reg_value = ENET_MAC_CONFIGURATION;
        /* configure ENET_MAC_CONFIGURATION register */
        reg_value &= ~(ENET_MAC_CONFIGURATION_ARPEN | ENET_MAC_CONFIGURATION_SARC);
        reg_value |= reg_temp;
        ENET_MAC_CONFIGURATION = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure interframegap related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)INTERFRAMEGAP_OPTION)) {
        reg_temp = enet_initpara.interframegap;

        reg_value = ENET_MAC_CONFIGURATION;
        /* configure ENET_MAC_CONFIGURATION register */
        reg_value &= ~ENET_MAC_CONFIGURATION_IPG;
        reg_value |= reg_temp;
        ENET_MAC_CONFIGURATION = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure ecccontrol related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)ECCCONTROL_OPTION)) {
        reg_temp = enet_initpara.ecccontrol;

        reg_value = ENET_MTL_ECC_CONTROL;
        /* configure ENET_MTL_ECC_CONTROL register */
        reg_value &= ~(ENET_MTL_ECC_CONTROL_MEEAO | ENET_MTL_ECC_CONTROL_MRXPEE | ENET_MTL_ECC_CONTROL_MESTEE | ENET_MTL_ECC_CONTROL_MRXEE |
                       ENET_MTL_ECC_CONTROL_MTXEE);
        reg_value |= reg_temp;
        ENET_MTL_ECC_CONTROL = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure dppcontrol related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)DPPCONTROL_OPTION)) {
        reg_temp = enet_initpara.dppcontrol;

        reg_value = ENET_MTL_DPP_CONTROL;
        /* configure ENET_MTL_DPP_CONTROL register */
        reg_value &= ~(ENET_MTL_DPP_CONTROL_EDPP | ENET_MTL_DPP_CONTROL_OPE | ENET_MTL_DPP_CONTROL_EPSI);
        reg_value |= reg_temp;
        ENET_MTL_DPP_CONTROL = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure fsmcontrol related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)FSMCONTROL_OPTION)) {
        reg_temp = enet_initpara.fsmcontrol;

        reg_value = ENET_MAC_FSM_CONTROL;
        /* configure ENET_MAC_FSM_CONTROL register */
        reg_value &= 0x0000U;
        reg_value |= reg_temp;
        ENET_MAC_FSM_CONTROL = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    /* configure estcontrol related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)ESTCONTROL_OPTION)) {
        reg_temp = enet_initpara.estcontrol;

        reg_value = ENET_MTL_EST_CONTROL;
        /* configure ENET_MTL_EST_CONTROL register */
        reg_value &= 0x0000U;
        reg_value |= reg_temp;
        ENET_MTL_EST_CONTROL = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

    /* configure estcontrol related registers */
    if((uint32_t)RESET != (enet_initpara.option_enable & (uint32_t)FPECONTROL_OPTION)) {
        reg_temp = enet_initpara.fpecontrol;

        reg_value = ENET_MAC_FPE_CTRL_STS;
        temp = reg_temp;
        /* configure ENET_MAC_FPE_CTRL_STS register */
        reg_value &= ~(ENET_MAC_FPE_CTRL_STS_ARV | ENET_MAC_FPE_CTRL_STS_EFPE);
        temp &= (ENET_MAC_FPE_CTRL_STS_ARV | ENET_MAC_FPE_CTRL_STS_EFPE);
        reg_value |= temp;
        ENET_MAC_FPE_CTRL_STS = reg_value;
        
        reg_value = ENET_MTL_FPE_CTRL_STS;
        temp = reg_temp;
        /* configure ENET_MTL_FPE_CTRL_STS register */
        reg_value &= ~(ENET_MTL_FPE_CTRL_STS_AFSZ | ENET_MTL_FPE_CTRL_STS_LBHT | ENET_MTL_FPE_CTRL_STS_PEC);
        temp &= ((ENET_MTL_FPE_CTRL_STS_AFSZ | ENET_MTL_FPE_CTRL_STS_LBHT | ENET_MTL_FPE_CTRL_STS_PEC) << 4U);
        reg_value |= (temp >> 4U);
        ENET_MTL_FPE_CTRL_STS = reg_value;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    enet_state = SUCCESS;

    return enet_state;

