sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
}
/*!
    \brief      Software Reset
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_software_reset(void)
{
    uint32_t timeout = 0U;
    ErrStatus enet_state;
    uint32_t dma_flag;

    /* software reset */
    ENET_DMA_MODE |= ENET_DMA_MODE_SWR;
    __DSB();
    __ISB();
    __DMB();
    /* wait for reset operation complete */
    do {
        dma_flag = (ENET_DMA_MODE & ENET_DMA_MODE_SWR);
        timeout++;
    } while(((uint32_t)RESET != dma_flag) && (ENET_SWR_DELAY_TO != timeout));

    /* reset operation complete */
    if((uint32_t)RESET == (ENET_DMA_MODE & ENET_DMA_MODE_SWR)) {
        enet_state = SUCCESS;
    } else {
        enet_state = ERROR;
    }
    return enet_state;
}

/*!
    \brief    check receive frame valid and return frame size
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     size of received frame: 0x0 - 0x3FFF
*/
uint32_t enet_rxframe_size_get(enet_dmach_enum dmach)
{
    uint32_t size = 0U;
    uint32_t des3_status, des1_status;

    switch(dmach) {
    case DMACH0: 
    /* get rdes3 information of current RxDMA descriptor */
    des3_status = dma_current_rxdesc->DES3;

    /* if the desciptor is owned by DMA */
    if((uint32_t)RESET != (des3_status & ENET_NORMAL_RDES3_WF_OWN)) {
        return 0U;
    }

    /* if has any error, or the frame uses two or more descriptors */
    if((((uint32_t)RESET) != (des3_status & ENET_NORMAL_RDES3_WF_ES)) ||
            (((uint32_t)RESET) == (des3_status & ENET_NORMAL_RDES3_WF_LD)) ||
            (((uint32_t)RESET) == (des3_status & ENET_NORMAL_RDES3_WF_FD))) {
        /* drop current receive frame */
        enet_rxframe_drop(DMACH0);
        return 1U;
    }
    des1_status = dma_current_rxdesc->DES1;
    /* if has other error, or the frame uses two or more descriptors */
    if((((uint32_t)RESET) != (des1_status & ENET_NORMAL_RDES1_WF_IPCE)) ||
            (((uint32_t)RESET) != (des1_status & ENET_NORMAL_RDES1_WF_IPHE))) {
        /* drop current receive frame */
        enet_rxframe_drop(DMACH0);
        return 1U;
    }
    /* if CPU owns current descriptor, no error occured, the frame uses only one descriptor */
    if((((uint32_t)RESET) == (des3_status & ENET_NORMAL_RDES3_WF_OWN)) &&
            (((uint32_t)RESET) == (des3_status & ENET_NORMAL_RDES3_WF_ES)) &&
            (((uint32_t)RESET) != (des3_status & ENET_NORMAL_RDES3_WF_FD)) &&
            (((uint32_t)RESET) != (des3_status & ENET_NORMAL_RDES3_WF_LD))) {
        /* get the size of the received data including CRC */
        size = GET_RDES3_PL(des3_status);
        /* substract the CRC size */
        size = size - 4U;

        /* if is a type frame, and CRC is not included in forwarding frame */
        if(((uint32_t)RESET != (ENET_MAC_CONFIGURATION & ENET_MAC_CONFIGURATION_CST)) && ((uint32_t)RESET != (des3_status & ENET_NORMAL_RDES3_WF_LT))) {
            size = size + 4U;
        }
    } else {
        enet_unknow_err++;
        enet_rxframe_drop(DMACH0);

        return 1U;
    }
    break;
    case DMACH1: 
    /* get rdes0 information of current RxDMA descriptor */
    des3_status = dma_current_rxdesc1->DES3;

    /* if the desciptor is owned by DMA */
    if((uint32_t)RESET != (des3_status & ENET_NORMAL_RDES3_WF_OWN)) {
        return 0U;
    }

    /* if has any error, or the frame uses two or more descriptors */
    if((((uint32_t)RESET) != (des3_status & ENET_NORMAL_RDES3_WF_ES)) ||
            (((uint32_t)RESET) == (des3_status & ENET_NORMAL_RDES3_WF_LD)) ||
            (((uint32_t)RESET) == (des3_status & ENET_NORMAL_RDES3_WF_FD))) {
        /* drop current receive frame */
        enet_rxframe_drop(DMACH1);
        return 1U;
    }
    des1_status = dma_current_rxdesc1->DES1;
    /* if has other error, or the frame uses two or more descriptors */
    if((((uint32_t)RESET) != (des1_status & ENET_NORMAL_RDES1_WF_IPCE)) ||
            (((uint32_t)RESET) != (des1_status & ENET_NORMAL_RDES1_WF_IPHE))) {
        /* drop current receive frame */
        enet_rxframe_drop(DMACH1);
        return 1U;
    }

    /* if CPU owns current descriptor, no error occured, the frame uses only one descriptor */
    if((((uint32_t)RESET) == (des3_status & ENET_NORMAL_RDES3_WF_OWN)) &&
            (((uint32_t)RESET) == (des3_status & ENET_NORMAL_RDES3_WF_ES)) &&
            (((uint32_t)RESET) != (des3_status & ENET_NORMAL_RDES3_WF_FD)) &&
            (((uint32_t)RESET) != (des3_status & ENET_NORMAL_RDES3_WF_LD))) {
        /* get the size of the received data including CRC */
        size = GET_RDES3_PL(des3_status);
        /* substract the CRC size */
        size = size - 4U;

        /* if is a type frame, and CRC is not included in forwarding frame */
        if(((uint32_t)RESET != (ENET_MAC_CONFIGURATION & ENET_MAC_CONFIGURATION_CST)) && ((uint32_t)RESET != (des3_status & ENET_NORMAL_RDES3_WF_LT))) {
            size = size + 4U;
        }
    } else {
        enet_unknow_err++;
        enet_rxframe_drop(DMACH1);

        return 1U;
    }
    break;
    default:
       break;
    }
    /* return packet size */
    return size;
}


/*!
    \brief    initialize the DMA Tx/Rx descriptors's parameters in ring mode
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  direction: the descriptors which users want to init, refer to enet_dmadirection_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: DMA Tx descriptors
      \arg        ENET_DMA_RX: DMA Rx descriptors
    \param[out] none
    \retval     none
*/
void enet_descriptors_ring_init(enet_dmach_enum dmach, enet_dmadirection_enum direction)
{
    uint32_t num, count, maxsize;
    uint32_t desc_status = 0U;
    enet_descriptors_struct *desc;
    enet_descriptors_struct *desc_tab;
    uint8_t *buf;

    switch(dmach) {
    case DMACH0: 
    /* if want to initialize DMA Tx descriptors */
    if(ENET_DMA_TX == direction) {
        /* save a copy of the DMA Tx descriptors */
        desc_tab = txdesc_tab;
        buf = &tx_buff[0][0];
        count = ENET_TXBUF_NUM;
        maxsize = ENET_TXBUF_SIZE;

        dma_current_txdesc = desc_tab;
        
        ENET_DMA_CH0_TXDESC_RING_LENGTH = (ENET_TXBUF_NUM - 1U);
        ENET_DMA_CH0_TXDESC_ADDRESS = (uint32_t)txdesc_tab;
        ENET_DMA_CH0_TXDESC_TAIL_POINTER = (uint32_t)txdesc_tab;
    } else {
        /* if want to initialize DMA Rx descriptors */
        /* save a copy of the DMA Rx descriptors */
        desc_tab = rxdesc_tab;
        buf = &rx_buff[0][0];
        count = ENET_RXBUF_NUM;
        maxsize = ENET_RXBUF_SIZE;

        /* enable receiving */
        desc_status = ENET_NORMAL_RDES3_RF_OWN;

        dma_current_rxdesc = desc_tab;
        
        ENET_DMA_CH0_RX_CONTROL2 = (ENET_RXBUF_NUM - 1U);
        ENET_DMA_CH0_RXDESC_ADDRESS = (uint32_t)rxdesc_tab;
        ENET_DMA_CH0_RXDESC_TAIL_POINTER = (uint32_t)&rxdesc_tab[(ENET_RXBUF_NUM - 1U)];
    }

