sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
            /* copy data from Rx buffer to application buffer */
            for(offset = 0U; offset < size; offset++) {
                (*(buffer + offset)) = (*(__IO uint8_t *)(uint32_t)((dma_current_rxdesc1->buffer_address) + offset));
            }

        } else {
            /* return ERROR */
            return recv_status;
        }
    } else {
    
    }
    /* enable reception, descriptor is owned by DMA */
    dma_current_rxdesc1->DES3 = ENET_NORMAL_RDES3_WF_OWN;
    dma_current_rxdesc1->DES0 = dma_current_rxdesc1->buffer_address;
    dma_current_rxdesc1->DES3 |= ENET_NORMAL_RDES3_RF_BUF1V;
    
    /* If the receive interrupt is enabled, the IOC bit needs to be set */
    if((uint32_t)RESET != (ENET_DMA_CH1_INTERRUPT_ENABLE & ENET_DMA_CH_INTERRUPT_ENABLE_RIE)) {
        dma_current_rxdesc1->DES3 |= ENET_NORMAL_RDES3_RF_IOC;
    }
    
    /* check Rx buffer unavailable flag status */
    if((uint32_t)RESET != (ENET_DMA_CH1_STATUS & ENET_DMA_CH_STATUS_RBU)) {
        /* clear RBU flag */
        ENET_DMA_CH1_STATUS &= ~ENET_DMA_CH_STATUS_RBU;
    }
    __DSB();
    __ISB();
    __DMB();

    /* update the current RxDMA descriptor pointer to the next decriptor in RxDMA decriptor table */
    /* ring mode */
    if((enet_descriptors_struct *)(uint32_t)&rxdesc_tab1[(ENET_RXBUF_NUM - 1U)] == dma_current_rxdesc1) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_current_rxdesc1 = (enet_descriptors_struct *)(ENET_DMA_CH1_RXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_current_rxdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc1 + ETH_DMARXDESC_SIZE);
    }
    ENET_DMA_CH1_RXDESC_TAIL_POINTER = (uint32_t)&rxdesc_tab1[ENET_RXBUF_NUM];

    break;
    default:
       break;
    }
    recv_status = SUCCESS;
}
    return recv_status;
}

/*!
    \brief    handle application buffer data to transmit it
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  buffer: pointer to the frame data to be transmitted,
                note -- if the input is NULL, user should handle the data in application by himself
    \param[in]  length: the length of frame data to be transmitted
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_frame_transmit(enet_dmach_enum dmach, uint8_t *buffer, uint32_t length)
{
    uint32_t offset;
    ErrStatus status;
    status = ERROR;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_BUFSIZE(length)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x000CU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{

    switch(dmach) {
    case DMACH0: 
    /* the descriptor is busy due to own by the DMA */
    if((uint32_t)RESET != (dma_current_txdesc->DES3 & ENET_NORMAL_TDES3_WF_OWN)) {
        return status;
    }

#ifndef FW_DEBUG_ERR_REPORT
    /* only frame length no more than ENET_MAX_FRAME_SIZE is allowed */
    if(length > ENET_MAX_FRAME_SIZE) {
        return status;
    } else {
    
    }
#endif /* FW_DEBUG_ERR_REPORT */

    /* if buffer pointer is null, indicates that users has handled data in application */
    if(NULL != buffer) {
        /* copy frame data from application buffer to Tx buffer */
        for(offset = 0U; offset < length; offset++) {
            (*(__IO uint8_t *)(uint32_t)((dma_current_txdesc->DES0) + offset)) = (*(buffer + offset));
        }
    }

    /* set the frame length */
    dma_current_txdesc->DES2 = length;
    /* set the segment of frame, frame is transmitted in one descriptor */
    dma_current_txdesc->DES3 |= ENET_NORMAL_TDES3_WF_FD | ENET_NORMAL_TDES3_WF_LD;
    /* enable the DMA transmission */
    dma_current_txdesc->DES3 |= ENET_NORMAL_TDES3_WF_OWN;
    __DSB();
    __ISB();
    __DMB();

    /* check Tx buffer unavailable flag status */
    if((uint32_t)RESET != (ENET_DMA_CH0_STATUS & ENET_DMA_CH_STATUS_TBU)) {
        /* clear TBU flag */
        ENET_DMA_CH0_STATUS &= ~ENET_DMA_CH_STATUS_TBU;
    }
    ENET_DMA_CH0_TXDESC_TAIL_POINTER = (uint32_t)dma_current_txdesc + sizeof(enet_descriptors_struct);

    /* update the current TxDMA descriptor pointer to the next decriptor in TxDMA decriptor table*/
    /* ring mode */
    if((enet_descriptors_struct *)(ENET_DMA_CH0_TXDESC_ADDRESS + (ENET_TXBUF_NUM-1U) * sizeof(enet_descriptors_struct)) <= dma_current_txdesc) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_current_txdesc = (enet_descriptors_struct *)(ENET_DMA_CH0_TXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_current_txdesc = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_txdesc + ETH_DMATXDESC_SIZE);
    }

    break;
    case DMACH1: 
    /* the descriptor is busy due to own by the DMA */
    if((uint32_t)RESET != (dma_current_txdesc1->DES3 & ENET_NORMAL_TDES3_WF_OWN)) {
        return status;
    }

#ifndef FW_DEBUG_ERR_REPORT
    /* only frame length no more than ENET_MAX_FRAME_SIZE is allowed */
    if(length > ENET_MAX_FRAME_SIZE) {
        return status;
    } else {
    
    }
#endif /* FW_DEBUG_ERR_REPORT */

    /* if buffer pointer is null, indicates that users has handled data in application */
    if(NULL != buffer) {
        /* copy frame data from application buffer to Tx buffer */
        for(offset = 0U; offset < length; offset++) {
            (*(__IO uint8_t *)(uint32_t)((dma_current_txdesc1->DES0) + offset)) = (*(buffer + offset));
        }
    }

    /* set the frame length */
    dma_current_txdesc1->DES2 = length;
    /* set the segment of frame, frame is transmitted in one descriptor */
    dma_current_txdesc1->DES3 |= ENET_NORMAL_TDES3_WF_FD | ENET_NORMAL_TDES3_WF_LD;
    /* enable the DMA transmission */
    dma_current_txdesc1->DES3 |= ENET_NORMAL_TDES3_WF_OWN;
    __DSB();
    __ISB();
    __DMB();

    /* check Tx buffer unavailable flag status */
    if((uint32_t)RESET != (ENET_DMA_CH1_STATUS & ENET_DMA_CH_STATUS_TBU)) {
        /* clear TBU flag */
        ENET_DMA_CH1_STATUS &= ~ENET_DMA_CH_STATUS_TBU;
    }
    ENET_DMA_CH1_TXDESC_TAIL_POINTER = (uint32_t)dma_current_txdesc1 + sizeof(enet_descriptors_struct);
    /* update the current TxDMA descriptor pointer to the next decriptor in TxDMA decriptor table*/
    /* ring mode */
    if((enet_descriptors_struct *)(ENET_DMA_CH1_TXDESC_ADDRESS + (ENET_TXBUF_NUM-1U) * sizeof(enet_descriptors_struct)) <= dma_current_txdesc1) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_current_txdesc1= (enet_descriptors_struct *)(ENET_DMA_CH1_TXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_current_txdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_txdesc1 + ETH_DMATXDESC_SIZE);
    }
    break;
    default:
       break;
    }
    status = SUCCESS;
}
    return status;
}


/*!
    \brief    configure the transmit IP frame checksum offload calculation and insertion
    \param[in]  desc: the descriptor pointer which users want to configure, refer to enet_descriptors_struct
    \param[in]  checksum: IP frame checksum configuration
                only one parameter can be selected which is shown as below
      \arg        ENET_CHECKSUM_DISABLE: checksum insertion disabled
      \arg        ENET_CHECKSUM_IPV4HEADER: only IP header checksum calculation and insertion are enabled
      \arg        ENET_CHECKSUM_TCPUDPICMP_SEGMENT: TCP/UDP/ICMP checksum insertion calculated but pseudo-header
      \arg        ENET_CHECKSUM_TCPUDPICMP_FULL: TCP/UDP/ICMP checksum insertion fully calculated
    \param[out] none
    \retval     none
*/
void enet_transmit_checksum_config(enet_descriptors_struct *desc, uint32_t checksum)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(desc)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x000DU), ERR_PARAM_POINTER);
    } else if(NOT_ENET_CHECKSUM(checksum)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    desc->DES3 &= ~ENET_NORMAL_TDES3_RF_CIC;
    desc->DES3 |= checksum;
}
}

/*!
    \brief    configure MAC to add or replace the Source Address field in the Ethernet packet
    \param[in]  desc: the descriptor pointer which users want to configure, refer to enet_descriptors_struct
    \param[in]  control: SA insertion Control
                only one parameter can be selected which is shown as below
      \arg        ENET_NO_SA_INCLUDE: do not include the source address
      \arg        ENET_MAC0_SA_INCLUDE_INSERT: include or insert the source MAC Address 0
      \arg        ENET_MAC0_SA_REPLACE: replace the source MAC Address 0
      \arg        ENET_MAC1_SA_INCLUDE_INSERT: include or insert the source MAC Address 1
      \arg        ENET_MAC1_SA_REPLACE: replace the source MAC Address 1
    \param[out] none
    \retval     none
*/
void enet_transmit_sourceaddr_insert_config(enet_descriptors_struct *desc, uint32_t control)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(desc)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x000EU), ERR_PARAM_POINTER);
    } else if(NOT_ENET_TXSRCADDR_CONTROL(control)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    desc->DES3 &= ~ENET_NORMAL_TDES3_RF_SAIC;
    desc->DES3 |= control;
}
}

/*!
    \brief    configure the CRC and pad insertion for Tx packet
    \param[in]  desc: the descriptor pointer which users want to configure, refer to enet_descriptors_struct
    \param[in]  control: CRC and pad control configuration
                only one parameter can be selected which is shown as below
      \arg        ENET_CRC_PAD_INSERT: CRC and pad insertion
      \arg        ENET_CRC_INSERT: CRC insertion
      \arg        ENET_CRC_INSERT_DISABLE: disable CRC Insertion
      \arg        ENET_CRC_REPLACE: CRC replacement
    \param[out] none
    \retval     none
*/
void enet_transmit_crc_pad_config(enet_descriptors_struct *desc, uint32_t control)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(desc)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x000FU), ERR_PARAM_POINTER);
    } else if(NOT_ENET_TXCRCPAD_CONTROL(control)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    desc->DES3 &= ~ENET_NORMAL_TDES3_RF_CPC;
    desc->DES3 |= control;
}
}

/*!
    \brief    configure MAC address
    \param[in]  mac_addr: select which MAC address will be set, refer to enet_macaddress_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MAC_ADDRESS0: set MAC address 0
      \arg        ENET_MAC_ADDRESS1: set MAC address 1
      \arg        ENET_MAC_ADDRESS2: set MAC address 2
    \param[in]  paddr: the buffer pointer which stores the MAC address
                  (little-ending store, such as MAC address is aa:bb:cc:dd:ee:22, the buffer is {22, ee, dd, cc, bb, aa})
    \param[out] none
    \retval     none
*/
void enet_mac_address_set(enet_macaddress_enum mac_addr, uint8_t paddr[])
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(paddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0010U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    REG32(ENET_ADDRH_BASE + (uint32_t)mac_addr) &= MAC_ADDR_HIGH_MASK;
    REG32(ENET_ADDRH_BASE + (uint32_t)mac_addr) |= ENET_SET_MACADDRH(paddr);
    REG32(ENET_ADDRL_BASE + (uint32_t)mac_addr) = ENET_SET_MACADDRL(paddr);
}
}

/*!
    \brief    get MAC address
    \param[in]  mac_addr: select which MAC address will be get, refer to enet_macaddress_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MAC_ADDRESS0: get MAC address 0
      \arg        ENET_MAC_ADDRESS1: get MAC address 1
      \arg        ENET_MAC_ADDRESS2: get MAC address 2
    \param[out] paddr: the buffer pointer which is stored the MAC address
                  (little-ending store, such as mac address is aa:bb:cc:dd:ee:22, the buffer is {22, ee, dd, cc, bb, aa})
    \retval     none
*/

void enet_mac_address_get(enet_macaddress_enum mac_addr, uint8_t paddr[])
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(paddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0011U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    paddr[0] = ENET_GET_MACADDR((uint32_t)mac_addr, 0U);
    paddr[1] = ENET_GET_MACADDR((uint32_t)mac_addr, 1U);
    paddr[2] = ENET_GET_MACADDR((uint32_t)mac_addr, 2U);
    paddr[3] = ENET_GET_MACADDR((uint32_t)mac_addr, 3U);
    paddr[4] = ENET_GET_MACADDR((uint32_t)mac_addr, 4U);
    paddr[5] = ENET_GET_MACADDR((uint32_t)mac_addr, 5U);
}
}

/*!
    \brief    configure ARP IP address
    \param[in]  ipaddr: the buffer pointer which stores the IPV4 address
                  (little-ending store, such as ip address is 10.50.3.140, the buffer is {140, 3, 50, 10})
    \param[out] none
    \retval     none
*/
void enet_arp_ip_address_set(uint8_t ipaddr[])
{
    uint32_t arp_ipaddr;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(ipaddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    arp_ipaddr = ENET_SET_IPV4ADDR(ipaddr);
    ENET_MAC_ARP_ADDRESS = MAC_ARP_ADDRESS_ARPPA(arp_ipaddr);
}
}

/*!
    \brief    get the ENET MAC/MTL/DMA status flag
    \param[in]  enet_flag: ENET status flag, refer to enet_flag_enum,
                only one parameter can be selected which is shown as below
      \arg        ENET_MAC_RX_TX_STATUS_FLAG_TJT: transmit jabber timeout status flag
      \arg        ENET_MAC_RX_TX_STATUS_FLAG_NCARR: no carrier status flag
      \arg        ENET_MAC_RX_TX_STATUS_FLAG_LCARR: loss of carrier status flag
      \arg        ENET_MAC_RX_TX_STATUS_FLAG_EXDEF: excessive deferral status flag
      \arg        ENET_MAC_RX_TX_STATUS_FLAG_LCOL: late collision status flag
      \arg        ENET_MAC_RX_TX_STATUS_FLAG_EXCOL: excessive collisions status flag
      \arg        ENET_MAC_RX_TX_STATUS_FLAG_RWT: receive watchdog timeout status flag
      \arg        ENET_MAC_PMT_CONTROL_STATUS_FLAG_MGKPRCVD: magic packet received flag
      \arg        ENET_MAC_PMT_CONTROL_STATUS_FLAG_RWKPRCVD: remote wake-pp packet received flag
      \arg        ENET_MAC_LPI_CONTROL_STATUS_FLAG_TLPIEN: transmit LPI entry flag
      \arg        ENET_MAC_LPI_CONTROL_STATUS_FLAG_TLPIEX: transmit LPI exit flag
      \arg        ENET_MAC_LPI_CONTROL_STATUS_FLAG_RLPIEN: receive LPI entry flag
      \arg        ENET_MAC_LPI_CONTROL_STATUS_FLAG_RLPIEX: receive LPI exit flag
      \arg        ENET_MAC_LPI_CONTROL_STATUS_FLAG_TLPIST: transmit LPI state flag
      \arg        ENET_MAC_LPI_CONTROL_STATUS_FLAG_RLPIST: receive LPI state flag
      \arg        ENET_MAC_LPI_CONTROL_STATUS_FLAG_PLS: PHY link status flag
      \arg        ENET_MAC_FPE_CTRL_STS_FLAG_RVER: received verify frame flag
      \arg        ENET_MAC_FPE_CTRL_STS_FLAG_RRSP: received respond frame flag
      \arg        ENET_MAC_FPE_CTRL_STS_FLAG_TVER: transmitted verify frame flag
      \arg        ENET_MAC_FPE_CTRL_STS_FLAG_TRSP: transmitted respond frame flag
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSSOVF: timestamp seconds overflow flag
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTARGT0: timestamp target time reached flag for target time PPS0
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTRGTERR0: timestamp target time error flag for target time PPS0
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTARGT1: timestamp target time reached flag for target time PPS1
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTRGTERR1: timestamp target time error flag for target time PPS1
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTARGT2: timestamp target time reached flag for target time PPS2
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTRGTERR2: timestamp target time error flag for target time PPS2
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTARGT3: timestamp target time reached flag for target time PPS3
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTRGTERR3: timestamp target time error flag for target time PPS3
      \arg        ENET_MAC_TIMESTAMP_STATUS_FLAG_TXTSSIS: Tx timestamp status interrupt status flag
      \arg        ENET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_FLAG_TXTSSIS: transmit timestamp status missed status flag
      \arg        ENET_MTL_DBG_STS_FLAG_PKTI: receive packet available interrupt status flag
      \arg        ENET_MTL_DBG_STS_FLAG_STSI: transmit status available interrupt status flag
      \arg        ENET_MTL_EST_STATUS_FLAG_SWLC: switch to S/W owned list complete flag
      \arg        ENET_MTL_EST_STATUS_FLAG_BTRE: BTR error flag
      \arg        ENET_MTL_EST_STATUS_FLAG_HLBF: Head-Of-Line blocking due to frame size flag
      \arg        ENET_MTL_EST_STATUS_FLAG_HLBS: Head-Of-Line blocking due to scheduling flag
      \arg        ENET_MTL_EST_STATUS_FLAG_CGCE: constant gate control error flag
      \arg        ENET_MTL_FPE_CTRL_STS_FLAG_HRS: hold/release status flag
      \arg        ENET_MTL_RXP_CONTROL_STATUS_FLAG_RXPI: RX parser in idle state flag
      \arg        ENET_MTL_TXQ0_UNDERFLOW_FLAG_UFCNTOVF: underflow packet counter overflow flag
      \arg        ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_FLAG_OVFCNTOVF: overflow counter overflow flag
      \arg        ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_FLAG_MISCNTOVF: missed packet counter overflow flag
      \arg        ENET_MTL_TXQ1_UNDERFLOW_FLAG_UFCNTOVF: underflow packet counter overflow flag
      \arg        ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_FLAG_OVFCNTOVF: overflow counter overflow flag
      \arg        ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_FLAG_MISCNTOVF: missed packet counter overflow flag
      \arg        ENET_DMA_CH0_FLAG_TI: channel 0 transmit status flag
      \arg        ENET_DMA_CH0_FLAG_TPS: channel 0 transmit process stopped status flag
      \arg        ENET_DMA_CH0_FLAG_TBU: channel 0 transmit buffer unavailable status flag
      \arg        ENET_DMA_CH0_FLAG_RI: channel 0 receive status flag
      \arg        ENET_DMA_CH0_FLAG_RBU: channel 0 receive buffer unavailable status flag
      \arg        ENET_DMA_CH0_FLAG_RPS: channel 0 receive process stopped status flag
      \arg        ENET_DMA_CH0_FLAG_RWT: channel 0 receive watchdog timeout status flag
      \arg        ENET_DMA_CH0_FLAG_ETI: channel 0 early transmit status flag
      \arg        ENET_DMA_CH0_FLAG_ERIE: channel 0 early receive status flag
      \arg        ENET_DMA_CH0_FLAG_FBE: channel 0 fatal bus error status flag
      \arg        ENET_DMA_CH0_FLAG_CDE: channel 0 context descriptor error status flag
      \arg        ENET_DMA_CH0_FLAG_AIE: channel 0 abnormal interrupt summary flag
      \arg        ENET_DMA_CH0_FLAG_NIS: channel 0 normal interrupt summary flag
      \arg        ENET_DMA_CH0_MISS_FRAME_CNT_FLAG_MFCO: overflow status of the MFC counter flag
      \arg        ENET_DMA_CH0_RXP_ACCEPT_CNT_FLAG_RXPACOF: Rx parser accept counter overflow flag
      \arg        ENET_DMA_CH1_FLAG_TI: channel 1 transmit status flag
      \arg        ENET_DMA_CH1_FLAG_TPS: channel 1 transmit process stopped status flag
      \arg        ENET_DMA_CH1_FLAG_TBU: channel 1 transmit buffer unavailable status flag
      \arg        ENET_DMA_CH1_FLAG_RI: channel 1 receive status flag
      \arg        ENET_DMA_CH1_FLAG_RBU: channel 1 receive buffer unavailable status flag
      \arg        ENET_DMA_CH1_FLAG_RPS: channel 1 receive process stopped status flag
      \arg        ENET_DMA_CH1_FLAG_RWT: channel 1 receive watchdog timeout status flag
      \arg        ENET_DMA_CH1_FLAG_ETI: channel 1 early transmit status flag
      \arg        ENET_DMA_CH1_FLAG_ERIE: channel 1 early receive status flag
      \arg        ENET_DMA_CH1_FLAG_FBE: channel 1 fatal bus error status flag
      \arg        ENET_DMA_CH1_FLAG_CDE: channel 1 context descriptor error status flag
      \arg        ENET_DMA_CH1_FLAG_AIE: channel 1 abnormal interrupt summary flag
      \arg        ENET_DMA_CH1_FLAG_NIS: channel 1 normal interrupt summary flag
      \arg        ENET_DMA_CH1_MISS_FRAME_CNT_FLAG_MFCO: overflow status of the MFC counter flag
      \arg        ENET_DMA_CH1_RXP_ACCEPT_CNT_FLAG_RXPACOF: Rx parser accept counter overflow flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus enet_flag_get(enet_flag_enum enet_flag)
{
    FlagStatus flag;
    if((uint32_t)RESET != (ENET_REG_VAL(enet_flag) & BIT(ENET_BIT_POS(enet_flag)))) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

