sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
/*!
    \brief    clear the ENET MTL/DMA status flag
    \param[in]  enet_flag: ENET DMA flag clear, refer to enet_flag_clear_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MTL_EST_STATUS_FLAG_CGCE_CLR: constant gate control error flag
      \arg        ENET_MTL_DBG_STS_FLAG_PKTI_CLR: receive packet available interrupt status flag
      \arg        ENET_MTL_DBG_STS_FLAG_STSI_CLR: transmit status available interrupt status flag
      \arg        ENET_DMA_CH0_FLAG_TI_CLR: channel 0 transmit status flag
      \arg        ENET_DMA_CH0_FLAG_TPS_CLR: channel 0 transmit process stopped status flag
      \arg        ENET_DMA_CH0_FLAG_TBU_CLR: channel 0 transmit buffer unavailable status flag
      \arg        ENET_DMA_CH0_FLAG_RI_CLR: channel 0 receive status flag
      \arg        ENET_DMA_CH0_FLAG_RBU_CLR: channel 0 receive buffer unavailable status flag
      \arg        ENET_DMA_CH0_FLAG_RPS_CLR: channel 0 receive process stopped status flag
      \arg        ENET_DMA_CH0_FLAG_RWT_CLR: channel 0 receive watchdog timeout status flag
      \arg        ENET_DMA_CH0_FLAG_ETI_CLR: channel 0 early transmit status flag
      \arg        ENET_DMA_CH0_FLAG_ERIE_CLR: channel 0 early receive status flag
      \arg        ENET_DMA_CH0_FLAG_FBE_CLR: channel 0 fatal bus error status flag
      \arg        ENET_DMA_CH0_FLAG_CDE_CLR: channel 0 context descriptor error status flag
      \arg        ENET_DMA_CH0_FLAG_AIE_CLR: channel 0 abnormal interrupt summary flag
      \arg        ENET_DMA_CH0_FLAG_NIS_CLR: channel 0 normal interrupt summary flag
      \arg        ENET_DMA_CH1_FLAG_TI_CLR: channel 1 transmit status flag
      \arg        ENET_DMA_CH1_FLAG_TPS_CLR: channel 1 transmit process stopped status flag
      \arg        ENET_DMA_CH1_FLAG_TBU_CLR: channel 1 transmit buffer unavailable status flag
      \arg        ENET_DMA_CH1_FLAG_RI_CLR: channel 1 receive status flag
      \arg        ENET_DMA_CH1_FLAG_RBU_CLR: channel 1 receive buffer unavailable status flag
      \arg        ENET_DMA_CH1_FLAG_RPS_CLR: channel 1 receive process stopped status flag
      \arg        ENET_DMA_CH1_FLAG_RWT_CLR: channel 1 receive watchdog timeout status flag
      \arg        ENET_DMA_CH1_FLAG_ETI_CLR: channel 1 early transmit status flag
      \arg        ENET_DMA_CH1_FLAG_ERIE_CLR: channel 1 early receive status flag
      \arg        ENET_DMA_CH1_FLAG_FBE_CLR: channel 1 fatal bus error status flag
      \arg        ENET_DMA_CH1_FLAG_CDE_CLR: channel 1 context descriptor error status flag
      \arg        ENET_DMA_CH1_FLAG_AIE_CLR: channel 1 abnormal interrupt summary flag
      \arg        ENET_DMA_CH1_FLAG_NIS_CLR: channel 1 normal interrupt summary flag
    \param[out] none
    \retval     none
*/
void enet_flag_clear(enet_flag_clear_enum enet_flag)
{
    /* write 1 to the corresponding bit, to clear it */
    ENET_REG_VAL(enet_flag) = BIT(ENET_BIT_POS(enet_flag));
}

/*!
    \brief    enable ENET MAC/MMC/MTL/DMA interrupt
    \param[in]  enet_int: ENET interrupt,, refer to enet_int_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MAC_INT_PHYIE: PHY interrupt enable
      \arg        ENET_MAC_INT_PMTIE: PMT interrupt enable
      \arg        ENET_MAC_INT_LPIIE: LPI interrupt enable
      \arg        ENET_MAC_INT_TSIE: timestamp interrupt enable
      \arg        ENET_MAC_INT_TXSTSIE: transmit status interrupt enable
      \arg        ENET_MAC_INT_RXSTSIE: receive status interrupt enable
      \arg        ENET_MAC_INT_FPEIE: frame preemption interrupt enable
      \arg        ENET_MAC_INT_MDIOIE: MDIO interrupt enable
      \arg        ENET_MMC_RX_INT_RXGBPKTIM: MMC receive good bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXGBOCTIM: MMC receive good bad octet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXGOCTIM: MMC receive good octet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXBCGPIM: MMC receive broadcast good packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXMCGPIM: MMC receive multicast good packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXCRCERPIM: MMC receive crc error packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXALGNERPIM: MMC receive alignment error packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXRUNTPIM: MMC receive runt packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXJABERPIM: MMC receive jabber error packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXUSIZEGPIM: MMC receive undersize good packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXOSIZEGPIM: MMC receive oversize good packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RX64OCTGBPIM: MMC receive 64 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RX65T127OCTGBPIM: MMC receive 65 to 127 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RX128T255OCTGBPIM: MMC receive 128 to 255 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RX256T511OCTGBPIM: MMC receive 256 to 511 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RX512T1023OCTGBPIM: MMC receive 512 to 1023 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RX1024TMAXOCTGBPIM: MMC receive 1024 to maximum octet good bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXUCGPIM: MMC receive unicast good packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXLENERPIM: MMC receive length error packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXORANGEPIM: MMC receive out of range error packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXPAUSPIM: MMC receive pause counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXFOVPIM: MMC receive FIFO overflow packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXVLANGBPIM: MMC receive VLAN good bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXWDOGPIM: MMC receive watchdog error bad packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXRCVERRPIM: MMC receive error packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXCTRLPIM: MMC receive control packet counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXLPIUSCIM: MMC receive LPI microsecond counter interrupt mask
      \arg        ENET_MMC_RX_INT_RXLPITRCIM: MMC receive LPI transition counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXGBOCTIM: MMC transmit good bad octet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXGBPKTIM: MMC transmit good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXBCGPIM: MMC transmit broadcast good packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXMCGPIM: MMC transmit multicast good packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TX64OCTGBPIM: MMC transmit 64 Octet good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TX65T127OCTGBPIM: MMC transmit 65 to 127 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TX128T255OCTGBPIM: MMC transmit 128 to 255 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TX256T511OCTGBPIM: MMC transmit 256 to 511 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TX512T1023OCTGBPIM: MMC transmit 512 to 1023 octet good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TX1024TMAXOCTGBPIM: MMC transmit 1024 to maximum octet good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXUCGBPIM: MMC transmit unicast good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXMCGBPIM: MMC transmit multicast good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXBCGBPIM: MMC transmit broadcast good bad packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXUFLOWERPIM: MMC transmit underflow error packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXSCOLGPIM: MMC transmit single collision good packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXMCOLGPIM: MMC transmit multiple collision good packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXDEFPIM: MMC transmit deferred packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXLATCOLPIM: MMC transmit late collision packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXEXCOLPIM: MMC transmit excessive collision packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXCARERPIM: MMC transmit carrier error packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXGOCTIM: MMC transmit good octet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXGPKTIM: MMC transmit good packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXEXDEFPIM: MMC transmit excessive deferral packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXPAUSPIM: MMC transmit VLAN good packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXOSIZEGPIM: MMC transmit oversize good packet counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXLPIUSCIM: MMC transmit LPI microsecond counter interrupt mask
      \arg        ENET_MMC_TX_INT_TXLPITRCIM: MMC transmit LPI transition counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4GPIM: MMC receive IPV4 good packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4HERPIM: MMC receive IPV4 header error packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4NOPAYPIM: MMC receive IPV4 no payload packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4FRAGPIM: MMC receive IPV4 fragmented packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4UDSBLPIM: MMC receive IPV4 UDP checksum disabled packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV6GPIM: MMC receive IPV6 good packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV6HERPIM: MMC receive IPV6 header error packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV6NOPAYPIM: MMC receive IPV6 no payload packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXUDPGPIM: MMC receive UDP good packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXUDPERPIM: MMC receive UDP error packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXTCPGPIM: MMC receive TCP good packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXTCPERPIM: MMC receive TCP error packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXICMPGPIM: MMC receive ICMP good packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXICMPERPIM: MMC receive ICMP error packet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4GOIM: MMC receive IPV4 good octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4HEROIM: MMC receive IPV4 header error octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4NOPAYOIM: MMC receive IPV4 no payload octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4FRAGOIM: MMC receive IPV4 fragmented octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV4UDSBLOIM: MMC receive IPV4 UDP checksum disabled octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV6GOIM: MMC receive IPV6 good octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV6HEROIM: MMC receive IPV6 header error octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXIPV6NOPAYOIM: MMC receive IPV6 no payload octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXUDPGOIM: MMC receive UDP good octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXUDPEROIM: MMC receive UDP error octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXTCPGOIM: MMC receive TCP good octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXTCPEROIM: MMC receive TCP error octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXICMPGOIM: MMC receive ICMP good octet counter interrupt mask
      \arg        ENET_MMC_IPC_RX_INT_RXICMPEROIM: MMC receive ICMP error octet counter interrupt mask
      \arg        ENET_MMC_FPE_TX_INT_FCIM: MMC Tx FPE fragment counter interrupt mask
      \arg        ENET_MMC_FPE_TX_INT_HRCIM: MMC Tx hold request counter interrupt mask
      \arg        ENET_MMC_FPE_RX_INT_PAECIM: MMC Rx packet assembly error counter interrupt mask
      \arg        ENET_MMC_FPE_RX_INT_PSECIM: MMC Rx packet SMD error counter interrupt mask
      \arg        ENET_MMC_FPE_RX_INT_PAOCIM: MMC Rx packet assembly OK counter interrupt mask
      \arg        ENET_MMC_FPE_RX_INT_FCIM: MMC Rx FPE fragment counter interrupt mask
      \arg        ENET_MTL_EST_INT_CGCEIE: the constant gate control error interrupt enable
      \arg        ENET_MTL_EST_INT_IEHSIE: interrupt enable for HLBS
      \arg        ENET_MTL_EST_INT_IEHFIE: interrupt enable for HLBF
      \arg        ENET_MTL_EST_INT_IEBEIE: interrupt enable for BTR error
      \arg        ENET_MTL_EST_INT_IECCIE: interrupt enable for switch enable
      \arg        ENET_MTL_RXP_INT_NVEOVIE: number of valid entries overflow interrupt enable
      \arg        ENET_MTL_RXP_INT_NPEOVIE: number of parsable entries overflow interrupt enable
      \arg        ENET_MTL_RXP_INT_FOOVIE: frame offset overflow interrupt enable
      \arg        ENET_MTL_RXP_INT_PDRFIE: packet drop due to RF interrupt enable
      \arg        ENET_MTL_ECC_INT_RPCEIE: Rx parser memory correctable error interrupt enable
      \arg        ENET_MTL_ECC_INT_ECEIE: EST memory correctable error interrupt enable
      \arg        ENET_MTL_ECC_INT_RXCEIE: Rx memory correctable error interrupt enable
      \arg        ENET_MTL_ECC_INT_TXCEIE: Tx memory correctable error interrupt enable
      \arg        ENET_MTL_Q0_INT_RXOIE: receive queue 0 overflow interrupt enable
      \arg        ENET_MTL_Q0_INT_ABPSIE: queue 0 average bits per slot interrupt enable
      \arg        ENET_MTL_Q0_INT_TXUIE: transmit queue 0 underflow interrupt enable
      \arg        ENET_MTL_Q1_INT_RXOIE: receive queue 1 overflow interrupt enable
      \arg        ENET_MTL_Q1_INT_ABPSIE: queue 1 average bits per slot interrupt enable
      \arg        ENET_MTL_Q1_INT_TXUIE: transmit queue 1 underflow interrupt enable
      \arg        ENET_DMA_CH0_INT_TIE: channel 0 transmit interrupt enable
      \arg        ENET_DMA_CH0_INT_TXSEIE: channel 0 transmit process stopped interrupt enable
      \arg        ENET_DMA_CH0_INT_TBUEIE: channel 0 transmit buffer unavailable interrupt enable
      \arg        ENET_DMA_CH0_INT_RIE: channel 0 receive interrupt enable
      \arg        ENET_DMA_CH0_INT_RBUEIE: channel 0 receive buffer unavailable interrupt enable
      \arg        ENET_DMA_CH0_INT_RSEIE: channel 0 receive process stopped interrupt enable
      \arg        ENET_DMA_CH0_INT_RWTEIE: channel 0 receive watchdog timeout interrupt enable
      \arg        ENET_DMA_CH0_INT_ETIE: channel 0 early transmit interrupt enable
      \arg        ENET_DMA_CH0_INT_ERIE: channel 0 early receive interrupt enable
      \arg        ENET_DMA_CH0_INT_FBEEIE: channel 0 fatal bus error interrupt enable
      \arg        ENET_DMA_CH0_INT_CDEEIE: channel 0 the descriptor error interrupt enable
      \arg        ENET_DMA_CH0_INT_AIE: channel 0 abnormal interrupt summary enable
      \arg        ENET_DMA_CH0_INT_NIE: channel 0 normal interrupt summary enable
      \arg        ENET_DMA_CH1_INT_TIE: channel 1 transmit interrupt enable
      \arg        ENET_DMA_CH1_INT_TXSEIE: channel 1 transmit process stopped interrupt enable
      \arg        ENET_DMA_CH1_INT_TBUEIE: channel 1 transmit buffer unavailable interrupt enable
      \arg        ENET_DMA_CH1_INT_RIE: channel 1 receive interrupt enable
      \arg        ENET_DMA_CH1_INT_RBUEIE: channel 1 receive buffer unavailable interrupt enable
      \arg        ENET_DMA_CH1_INT_RSEIE: channel 1 receive process stopped interrupt enable
      \arg        ENET_DMA_CH1_INT_RWTEIE: channel 1 receive watchdog timeout interrupt enable
      \arg        ENET_DMA_CH1_INT_ETIE: channel 1 early transmit interrupt enable
      \arg        ENET_DMA_CH1_INT_ERIE: channel 1 early receive interrupt enable
      \arg        ENET_DMA_CH1_INT_FBEEIE: channel 1 fatal bus error interrupt enable
      \arg        ENET_DMA_CH1_INT_CDEEIE: channel 1 the descriptor error interrupt enable
      \arg        ENET_DMA_CH1_INT_AIE: channel 1 abnormal interrupt summary enable
      \arg        ENET_DMA_CH1_INT_NIE: channel 1 normal interrupt summary enable
    \param[out] none
    \retval     none
*/
void enet_interrupt_enable(enet_int_enum enet_int)
{
    uint32_t reg_type;
    reg_type = ((uint32_t)enet_int >> 6U);
    if((reg_type == MMC_RX_INTERRUPT_MASK_REG_OFFSET) || (reg_type == MMC_TX_INTERRUPT_MASK_REG_OFFSET) || (reg_type == MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET) || \
      (reg_type == MMC_FPE_TX_INTERRUPT_MASK_REG_OFFSET) || (reg_type == MMC_FPE_RX_INTERRUPT_MASK_REG_OFFSET)){
      /* INTMSK register interrupt */
      ENET_REG_VAL(enet_int) &= ~BIT(ENET_BIT_POS(enet_int));
      } else {
        /* INTEN register interrupt */
        ENET_REG_VAL(enet_int) |= BIT(ENET_BIT_POS(enet_int));
      }
}

