sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
/*!
    \brief    get ENET MAC/MMC/MTL/DMA interrupt flag
    \param[in]  int_flag: ENET interrupt flag, refer to enet_int_flag_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_CH0_INT_FLAG_TI: channel 0 transmit status flag
      \arg        ENET_MAC_INT_FLAG_PHYIS: PHY interrupt status flag
      \arg        ENET_MAC_INT_FLAG_PMTIS: PMT interrupt status flag
      \arg        ENET_MAC_INT_FLAG_LPIIS: LPI Interrupt status flag
      \arg        ENET_MAC_INT_FLAG_MMCIS: MMC Interrupt status flag
      \arg        ENET_MAC_INT_FLAG_MMCRXIS: MMC receive interrupt status flag
      \arg        ENET_MAC_INT_FLAG_MMCTXIS: MMC transmit interrupt status flag
      \arg        ENET_MAC_INT_FLAG_MMCRXIPIS: MMC receive checksum offload interrupt status flag
      \arg        ENET_MAC_INT_FLAG_TSIS: timestamp interrupt status flag
      \arg        ENET_MAC_INT_FLAG_TXSTSIS: transmit status flag
      \arg        ENET_MAC_INT_FLAG_RXSTSIS: receive status interrupt flag
      \arg        ENET_MAC_INT_FLAG_FPEIS: frame preemption interrupt status flag
      \arg        ENET_MAC_INT_FLAG_MDIOIS: MDIO interrupt status flag
      \arg        ENET_MAC_INT_FLAG_MFTIS: MMC FPE transmit interrupt status flag
      \arg        ENET_MAC_INT_FLAG_MFEIS: MMC FPE receive Interrupt status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_ATPES: application transmit interface parity checker status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_RDPES: read descriptor parity checker error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_MPES: MTL data path parity checker error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_MTSPES: MTL Tx status data path parity checker error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_ARPES: application receive interface data path parity error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_CWPES: CSR write data path parity checker error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_TTES: Tx FSM timeout Error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_RTES: application transmit interface parity checker status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_ATES: APP FSM timeout error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_PTES: PTP FSM timeout error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_MSTTES: master read / write timeout error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_FSMPES: FSM state parity error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_MTBUPES: MAC TBU data path parity checker error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_MTFCPES: MAC TFC data path parity checker error status flag
      \arg        ENET_MAC_DPP_FSM_INT_FLAG_MRWCPES: MTL RWC data path parity checker error status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXGBPKTIS: MMC receive good bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXGBOCTIS: MMC receive good bad octet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXGOCTIS: MMC receive good octet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXBCGPIS: MMC receive broadcast good packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXMCGPIS: MMC receive multicast good packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXCRCERPIS: MMC receive crc error packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXALGNERPIS: MMC receive alignment error packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXRUNTPIS: MMC receive runt packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXJABERPIS: MMC receive jabber error packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXUSIZEGPIS: MMC receive undersize good packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXOSIZEGPIS: MMC receive oversize good packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RX64OCTGBPIS: MMC receive 64 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RX65T127OCTGBPIS: MMC receive 65 to 127 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RX128T255OCTGBPIS: MMC receive 128 to 255 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RX256T511OCTGBPIS: MMC receive 256 to 511 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RX512T1023OCTGBPIS: MMC receive 512 to 1023 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RX1024TMAXOCTGBPIS: MMC receive 1024 to maximum octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXUCGPIS: MMC receive unicast good packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXLENERPIS: MMC receive length error packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXORANGEPIS: MMC receive out of range error packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXPAUSPIS: MMC receive pause counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXFOVPIS: MMC receive FIFO overflow packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXVLANGBPIS: MMC receive VLAN good bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXWDOGPIS: MMC receive watchdog error bad packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXRCVERRPIS: MMC receive error packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXCTRLPIS: MMC receive control packet counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXLPIUSCIS: MMC receive LPI microsecond counter interrupt status flag
      \arg        ENET_MMC_RX_INT_FLAG_RXLPITRCIS: MMC receive LPI transition counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXGBOCTIS: MMC transmit good bad octet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXGBPKTIS: MMC transmit good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXBCGPIS: MMC transmit broadcast good packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXMCGPIS: MMC transmit multicast good packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TX64OCTGBPIS: MMC transmit 64 Octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TX65T127OCTGBPIS: MMC transmit 65 to 127 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TX128T255OCTGBPIS: MMC transmit 128 to 255 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TX256T511OCTGBPIS: MMC transmit 256 to 511 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TX512T1023OCTGBPIS: MMC transmit 512 to 1023 octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TX1024TMAXOCTGBPIS: MMC transmit 1024 to maximum octet good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXUCGBPIS: MMC transmit unicast good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXMCGBPIS: MMC transmit multicast good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXBCGBPIS: MMC transmit broadcast good bad packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXUFLOWERPIS: MMC transmit underflow error packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXSCOLGPIS: MMC transmit single collision good packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXMCOLGPIS: MMC transmit multiple collision good packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXDEFPIS: MMC transmit deferred packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXLATCOLPIS: MMC transmit late collision packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXEXCOLPIS: MMC transmit excessive collision packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXCARERPIS: MMC transmit carrier error packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXGOCTIS: MMC transmit good octet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXGPKTIS: MMC transmit good packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXEXDEFPIS: MMC transmit excessive deferral packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXPAUSPIS: MMC transmit pause packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXVLANGPIS: MMC transmit VLAN good packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXOSIZEGPIS: MMC transmit oversize good packet counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXLPIUSCIS: MMC transmit LPI microsecond counter interrupt status flag
      \arg        ENET_MMC_TX_INT_FLAG_TXLPITRCIS: MMC transmit LPI transition counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4GPIS: MMC receive IPV4 good packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4HERPIS: MMC receive IPV4 header error packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4NOPAYPIS: MMC receive IPV4 no payload packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4FRAGPIS: MMC receive IPV4 fragmented packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4UDSBLPIS: MMC receive IPV4 UDP checksum disabled packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV6GPIS: MMC receive IPV6 good packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV6HERPIS: MMC receive IPV6 header error packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV6NOPAYPIS: MMC receive IPV6 no payload packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXUDPGPIS: MMC receive UDP good packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXUDPERPIS: MMC receive UDP error packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXTCPGPIS: MMC receive TCP good packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXTCPERPIS: MMC receive TCP error packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXICMPGPIS: MMC receive ICMP good packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXICMPERPIS: MMC receive ICMP error packet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4GOIS: MMC receive IPV4 good octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4HEROIS: MMC receive IPV4 header error octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4NOPAYOIS: MMC receive IPV4 no payload octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4FRAGOIS: MMC receive IPV4 fragmented octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV4UDSBLOIS: MMC receive IPV4 UDP checksum disabled octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV6GOIS: MMC receive IPV6 good octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV6HEROIS: MMC receive IPV6 header error octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXIPV6NOPAYOIS: MMC receive IPV6 no payload octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXUDPGOIS: MMC receive UDP good octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXUDPEROIS: MMC receive UDP error octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXTCPGOIS: MMC receive TCP good octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXTCPEROIS: MMC receive TCP error octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXICMPGOIS: MMC receive ICMP good octet counter interrupt status flag
      \arg        ENET_MMC_IPC_RX_INT_FLAG_RXICMPEROIS: MMC receive ICMP error octet counter interrupt status flag
      \arg        ENET_MMC_FPE_TX_INT_FLAG_FCIS: MMC Tx FPE fragment counter interrupt status flag
      \arg        ENET_MMC_FPE_TX_INT_FLAG_HRCIS: MMC Tx hold request counter interrupt status flag
      \arg        ENET_MMC_FPE_RX_INT_FLAG_PAECIS: MMC Rx packet assembly error counter interrupt status flag
      \arg        ENET_MMC_FPE_RX_INT_FLAG_PSECIS: MMC Rx packet SMD error counter interrupt status flag
      \arg        ENET_MMC_FPE_RX_INT_FLAG_PAOCIS: MMC Rx packet assembly OK counter interrupt status flag
      \arg        ENET_MMC_FPE_RX_INT_FLAG_FCIS: MMC Rx FPE fragment counter interrupt status flag
      \arg        ENET_MTL_INT_FLAG_Q0IS: queue 0 interrupt status flag
      \arg        ENET_MTL_INT_FLAG_Q1IS: queue 1 interrupt status flag
      \arg        ENET_MTL_INT_FLAG_DBGIS: debug interrupt status flag
      \arg        ENET_MTL_INT_FLAG_ESTIS: EST (TAS- 802.1Qbv) interrupt status flag
      \arg        ENET_MTL_INT_FLAG_MTLPIS: MTL Rx parser interrupt status flag
      \arg        ENET_MTL_RXP_INT_FLAG_NVEOVIS: number of valid entries overflow interrupt status flag
      \arg        ENET_MTL_RXP_INT_FLAG_NPEOVIS: number of parsable entries overflow interrupt status flag
      \arg        ENET_MTL_RXP_INT_FLAG_FOOVIS: frame offset overflow interrupt status flag
      \arg        ENET_MTL_RXP_INT_FLAG_PDRFIS: packet drop due to RF interrupt status flag
      \arg        ENET_MTL_SAFETY_INT_FLAG_MECIS: MTL ECC correctable error interrupt status flag
      \arg        ENET_MTL_SAFETY_INT_FLAG_MEUIS: MTL ECC uncorrectable error interrupt status flag
      \arg        ENET_MTL_ECC_INT_FLAG_TXCES: MTL Tx memory correctable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_TXAMS: MTL Tx memory address mismatch status flag
      \arg        ENET_MTL_ECC_INT_FLAG_TXUES: MTL Tx memory uncorrectable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RXCES: MTL Rx memory correctable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RXAMS: MTL Rx memory address mismatch status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RXUES: MTL Rx memory uncorrectable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_ECES: MTL EST correctable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_EAMS: MTL EST address mismatch status flag
      \arg        ENET_MTL_ECC_INT_FLAG_EUES: MTL EST uncorrectable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RPCES: MTL Rx Parser memory correctable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RPAMS: MTL Rx Parser memory address mismatch status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RPUES: MTL Rx Parser memory uncorrectable error status flag
      \arg        ENET_MTL_Q0_INT_FLAG_RXOVFIS: receive queue 0 overflow status flag
      \arg        ENET_MTL_Q0_INT_FLAG_ABPSIS: queue 0 average bits per slot status flag
      \arg        ENET_MTL_Q0_INT_FLAG_TQU: transmit queue 0 underflow status flag
      \arg        ENET_MTL_Q1_INT_FLAG_RXOVFIS: receive queue 1 overflow status flag
      \arg        ENET_MTL_Q1_INT_FLAG_ABPSIS: queue 1 average bits per slot status flag
      \arg        ENET_MTL_Q1_INT_FLAG_TQU: transmit queue 1 underflow status flag
      \arg        ENET_DMA_INT_FLAG_DC0IS: DMA channel 0 interrupt status flag
      \arg        ENET_DMA_INT_FLAG_DC1IS: DMA channel 1 interrupt status flag
      \arg        ENET_DMA_INT_FLAG_MTLIS: MTL interrupt status flag
      \arg        ENET_DMA_INT_FLAG_MACIS: MAC interrupt status flag
      \arg        ENET_DMA_SAFETY_INT_FLAG_DECIS: DMA ECC correctable error interrupt status flag
      \arg        ENET_DMA_SAFETY_INT_FLAG_DEUIS: DMA ECC uncorrectable error interrupt status flag
      \arg        ENET_DMA_SAFETY_INT_FLAG_MSCIS: MTL safety correctable error interrupt status flag
      \arg        ENET_DMA_SAFETY_INT_FLAG_MSUIS: MTL safety uncorrectable error interrupt status flag
      \arg        ENET_DMA_SAFETY_INT_FLAG_MCSIS: MAC safety uncorrectable error interrupt status flag
      \arg        ENET_DMA_CH0_INT_FLAG_TI: channel 0 transmit status flag
      \arg        ENET_DMA_CH0_INT_FLAG_TPS: channel 0 transmit process stopped status flag
      \arg        ENET_DMA_CH0_INT_FLAG_TBU: channel 0 transmit buffer unavailable status flag
      \arg        ENET_DMA_CH0_INT_FLAG_RI: channel 0 receive status flag
      \arg        ENET_DMA_CH0_INT_FLAG_RBU: channel 0 receive buffer unavailable status flag
      \arg        ENET_DMA_CH0_INT_FLAG_RPS: channel 0 receive process stopped status flag
      \arg        ENET_DMA_CH0_INT_FLAG_RWT: channel 0 receive watchdog timeout status flag
      \arg        ENET_DMA_CH0_INT_FLAG_ETI: channel 0 early transmit status flag
      \arg        ENET_DMA_CH0_INT_FLAG_ERIE: channel 0 early receive status flag
      \arg        ENET_DMA_CH0_INT_FLAG_FBE: channel 0 fatal bus error status flag
      \arg        ENET_DMA_CH0_INT_FLAG_CDE: channel 0 context descriptor error status flag
      \arg        ENET_DMA_CH0_INT_FLAG_AIE: channel 0 abnormal interrupt summary flag
      \arg        ENET_DMA_CH0_INT_FLAG_NIS: channel 0 normal interrupt summary flag
      \arg        ENET_DMA_CH1_INT_FLAG_TI: channel 1 transmit status flag
      \arg        ENET_DMA_CH1_INT_FLAG_TPS: channel 1 transmit process stopped status flag
      \arg        ENET_DMA_CH1_INT_FLAG_TBU: channel 1 transmit buffer unavailable status flag
      \arg        ENET_DMA_CH1_INT_FLAG_RI: channel 1 receive status flag
      \arg        ENET_DMA_CH1_INT_FLAG_RBU: channel 1 receive buffer unavailable status flag
      \arg        ENET_DMA_CH1_INT_FLAG_RPS: channel 1 receive process stopped status flag
      \arg        ENET_DMA_CH1_INT_FLAG_RWT: channel 1 receive watchdog timeout status flag
      \arg        ENET_DMA_CH1_INT_FLAG_ETI: channel 1 early transmit status flag
      \arg        ENET_DMA_CH1_INT_FLAG_ERIE: channel 1 early receive status flag
      \arg        ENET_DMA_CH1_INT_FLAG_FBE: channel 1 fatal bus error status flag
      \arg        ENET_DMA_CH1_INT_FLAG_CDE: channel 1 context descriptor error status flag
      \arg        ENET_DMA_CH1_INT_FLAG_AIE: channel 1 abnormal interrupt summary flag
      \arg        ENET_DMA_CH1_INT_FLAG_NIS: channel 1 normal interrupt summary flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus enet_interrupt_flag_get(enet_int_flag_enum int_flag)
{
    FlagStatus flag;

    if((uint32_t)RESET != (ENET_REG_VAL(int_flag) & BIT(ENET_BIT_POS(int_flag)))) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

