sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
/*!
    \brief    clear ENET MTL/DMA interrupt flag
    \param[in]  int_flag_clear: clear ENET interrupt flag, refer to enet_int_flag_clear_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MTL_RXP_INT_FLAG_NVEOVIS_CLR: number of valid entries overflow interrupt status flag
      \arg        ENET_MTL_RXP_INT_FLAG_NPEOVIS_CLR: number of parsable entries overflow interrupt status
      \arg        ENET_MTL_RXP_INT_FLAG_FOOVIS_CLR: frame offset overflow interrupt status flag
      \arg        ENET_MTL_RXP_INT_FLAG_PDRFIS_CLR: packet drop due to RF interrupt status flag
      \arg        ENET_MTL_ECC_INT_FLAG_TXCES_CLR: MTL Tx memory correctable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_TXAMS_CLR: MTL Tx memory address mismatch status flag
      \arg        ENET_MTL_ECC_INT_FLAG_TXUES_CLR: MTL Tx memory uncorrectable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RXCES_CLR: MTL Rx memory correctable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RXAMS_CLR: MTL Rx memory address mismatch status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RXUES_CLR: MTL Rx memory uncorrectable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_ECES_CLR: MTL EST correctable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_EAMS_CLR: MTL EST address mismatch status flag
      \arg        ENET_MTL_ECC_INT_FLAG_EUES_CLR: MTL EST uncorrectable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RPCES_CLR: MTL Rx Parser memory correctable error status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RPAMS_CLR: MTL Rx Parser memory address mismatch status flag
      \arg        ENET_MTL_ECC_INT_FLAG_RPUES_CLR: MTL Rx Parser memory uncorrectable error status flag
      \arg        ENET_MTL_Q0_INT_FLAG_RXOVFIS_CLR: receive queue 0 overflow status flag
      \arg        ENET_MTL_Q0_INT_FLAG_ABPSIS_CLR: queue 0 average bits per slot status flag
      \arg        ENET_MTL_Q0_INT_FLAG_TQU_CLR: transmit queue 0 underflow status flag
      \arg        ENET_MTL_Q1_INT_FLAG_RXOVFIS_CLR: receive queue 1 overflow status flag
      \arg        ENET_MTL_Q1_INT_FLAG_ABPSIS_CLR: queue 1 average bits per slot status flag
      \arg        ENET_MTL_Q1_INT_FLAG_TQU_CLR: transmit queue 1 underflow status flag
      \arg        ENET_DMA_CH0_INT_FLAG_TI_CLR: channel 0 transmit status flag
      \arg        ENET_DMA_CH0_INT_FLAG_TPS_CLR: channel 0 transmit process stopped status flag
      \arg        ENET_DMA_CH0_INT_FLAG_TBU_CLR: channel 0 transmit buffer unavailable status flag
      \arg        ENET_DMA_CH0_INT_FLAG_RI_CLR: channel 0 receive status flag
      \arg        ENET_DMA_CH0_INT_FLAG_RBU_CLR: channel 0 receive buffer unavailable status flag
      \arg        ENET_DMA_CH0_INT_FLAG_RPS_CLR: channel 0 receive process stopped status flag
      \arg        ENET_DMA_CH0_INT_FLAG_RWT_CLR: channel 0 receive watchdog timeout status flag
      \arg        ENET_DMA_CH0_INT_FLAG_ETI_CLR: channel 0 early transmit status flag
      \arg        ENET_DMA_CH0_INT_FLAG_ERIE_CLR: channel 0 early receive status flag
      \arg        ENET_DMA_CH0_INT_FLAG_FBE_CLR: channel 0 fatal bus error status flag
      \arg        ENET_DMA_CH0_INT_FLAG_CDE_CLR: channel 0 context descriptor error status flag
      \arg        ENET_DMA_CH0_INT_FLAG_AIE_CLR: channel 0 abnormal interrupt summary flag
      \arg        ENET_DMA_CH0_INT_FLAG_NIS_CLR: channel 0 normal interrupt summary flag
      \arg        ENET_DMA_CH1_INT_FLAG_TI_CLR: channel 1 transmit status flag
      \arg        ENET_DMA_CH1_INT_FLAG_TPS_CLR: channel 1 transmit process stopped status flag
      \arg        ENET_DMA_CH1_INT_FLAG_TBU_CLR: channel 1 transmit buffer unavailable status flag
      \arg        ENET_DMA_CH1_INT_FLAG_RI_CLR: channel 1 receive status flag
      \arg        ENET_DMA_CH1_INT_FLAG_RBU_CLR: channel 1 receive buffer unavailable status flag
      \arg        ENET_DMA_CH1_INT_FLAG_RPS_CLR: channel 1 receive process stopped status flag
      \arg        ENET_DMA_CH1_INT_FLAG_RWT_CLR: channel 1 receive watchdog timeout status flag
      \arg        ENET_DMA_CH1_INT_FLAG_ETI_CLR: channel 1 early transmit status flag
      \arg        ENET_DMA_CH1_INT_FLAG_ERIE_CLR: channel 1 early receive status flag
      \arg        ENET_DMA_CH1_INT_FLAG_FBE_CLR: channel 1 fatal bus error status flag
      \arg        ENET_DMA_CH1_INT_FLAG_CDE_CLR: channel 1 context descriptor error status flag
      \arg        ENET_DMA_CH1_INT_FLAG_AIE_CLR: channel 1 abnormal interrupt summary flag
      \arg        ENET_DMA_CH1_INT_FLAG_NIS_CLR: channel 1 normal interrupt summary flag
    \param[out] none
    \retval     none
*/
void enet_interrupt_flag_clear(enet_int_flag_clear_enum int_flag_clear)
{
    uint32_t reg_type;
    reg_type = ((uint32_t)int_flag_clear >> 6U);
    if(reg_type == MTL_ECC_INTERRUPT_STATUS_REG_OFFSET){
        /* MTL_ECC_INTERRUPT_STATUS register */
        ENET_REG_VAL(int_flag_clear) &= ~BIT(ENET_BIT_POS(int_flag_clear));
    } else {
        /* write 1 to the corresponding bit in other register, to clear it */
        ENET_REG_VAL(int_flag_clear) = BIT(ENET_BIT_POS(int_flag_clear));
    }
}

/*!
    \brief      enable the Tx MAC
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_tx_mac_enable(void)
{
    ENET_MAC_CONFIGURATION |= ENET_MAC_CONFIGURATION_TE;
}

/*!
    \brief      disable the Tx MAC
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_tx_mac_disable(void)
{
    ENET_MAC_CONFIGURATION &= ~ENET_MAC_CONFIGURATION_TE;
}

/*!
    \brief      enable the Rx MAC
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_rx_mac_enable(void)
{
    ENET_MAC_CONFIGURATION |= ENET_MAC_CONFIGURATION_RE;
}

/*!
    \brief      disable the Rx MAC
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_rx_mac_disable(void)
{
    ENET_MAC_CONFIGURATION &= ~ENET_MAC_CONFIGURATION_RE;
}

/*!
    \brief    set the MAC extend configuration
    \param[in]  func: the function of MAC extend configuration
                only one parameter can be selected which are shown as below
      \arg        ENET_MISMATCH_ARP_PACKET_DROP_ENABLE: packet for which target protocol address does not match IPv4 address is dropped in the MTL layer
      \arg        ENET_MISMATCH_ARP_PACKET_DROP_DISABLE: when target protocol address does not match, packet is forwarded to MTL maintaining backward compatibility
      \arg        ENET_PACKET_DUPLICATION_ENABLE: the received packet with multicast/broadcast destination address is routed to multiple receive DMA channels
      \arg        ENET_PACKET_DUPLICATION_DISABLE: the received packet with multicast/broadcast destination address is not routed to multiple receive DMA channels
      \arg        ENET_USP_PACKET_DETECT_ENABLE: the MAC detects the slow protocol packets with unicast address of the station
      \arg        ENET_USP_PACKET_DETECT_DISABLE: the MAC detects only slow protocol packets with the slow protocol multicast address specified in the IEEE 802.3-2015, Section 5
      \arg        ENET_SLOW_PROTOCOL_DETECT_ENABLE: MAC processes the slow protocol packets (Ether Type 0x8809) and provides the slow protocol sub-type and code fields in Rx status
      \arg        ENET_SLOW_PROTOCOL_DETECT_DISABLE: the MAC forwards all error-free slow protocol packets to the application. The MAC considers such packets as normal Type packets
      \arg        ENET_CRC_CHECK_ENABLE: the MAC receiver always checks the CRC field in the received packets
      \arg        ENET_CRC_CHECK_DISABLE: the MAC receiver does not check the CRC field in the received packets
    \param[out] none
    \retval     none
*/
void enet_mac_extend_config(enet_extend_macconfig_enum func)
{
    /* inverted or not the specified siginal */
    switch(func) {
    case ENET_MISMATCH_ARP_PACKET_DROP_ENABLE:
        ENET_MAC_EXT_CONFIGURATION |= ENET_MAC_EXT_CONFIGURATION_APDIM;
        break;
    case ENET_PACKET_DUPLICATION_ENABLE:
        ENET_MAC_EXT_CONFIGURATION |= ENET_MAC_EXT_CONFIGURATION_PDC;
        break;
    case ENET_USP_PACKET_DETECT_ENABLE:
        ENET_MAC_EXT_CONFIGURATION |= ENET_MAC_EXT_CONFIGURATION_USP;
        break;
    case ENET_SLOW_PROTOCOL_DETECT_ENABLE:
        ENET_MAC_EXT_CONFIGURATION |= ENET_MAC_EXT_CONFIGURATION_SPEN;
        break;
    case ENET_CRC_CHECK_ENABLE:
        ENET_MAC_EXT_CONFIGURATION &= ~ENET_MAC_EXT_CONFIGURATION_DCRCC;
        break;
    case ENET_MISMATCH_ARP_PACKET_DROP_DISABLE:
        ENET_MAC_EXT_CONFIGURATION &= ~ENET_MAC_EXT_CONFIGURATION_APDIM;
        break;
    case ENET_PACKET_DUPLICATION_DISABLE:
        ENET_MAC_EXT_CONFIGURATION &= ~ENET_MAC_EXT_CONFIGURATION_PDC;
        break;
    case ENET_USP_PACKET_DETECT_DISABLE:
        ENET_MAC_EXT_CONFIGURATION &= ~ENET_MAC_EXT_CONFIGURATION_USP;
        break;
    case ENET_SLOW_PROTOCOL_DETECT_DISABLE:
        ENET_MAC_EXT_CONFIGURATION &= ~ENET_MAC_EXT_CONFIGURATION_SPEN;
        break;
    case ENET_CRC_CHECK_DISABLE:
        ENET_MAC_EXT_CONFIGURATION |= ENET_MAC_EXT_CONFIGURATION_DCRCC;
        break;
    default:
        break;
    }
}

/*!
    \brief      set the MAC extend Inter-Packet Gap
    \param[in]  packet_gap: the Inter-Packet Gap, must greater than 96 bit times in steps of 8 bit times: {EIPG, IPG}:
                104 - 2144
    \param[out] none
    \retval     none
*/
void enet_mac_extend_gap_set(uint32_t packet_gap)
{
    uint8_t bit_times;
    uint32_t ipg_val, eipg_val;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
if(NOT_EXT_PACKET_GAP_VALUE(packet_gap)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x001EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* calculate the values corresponding to the IPG and EIPG fields */
    bit_times = (uint8_t)((packet_gap - EIPG_BIT_TIMES_START_VAL) / EIPG_BIT_TIMES_STEP);
    ipg_val = (uint32_t)(bit_times & BITS(0,2));
    eipg_val = (uint32_t)((bit_times & BITS(3,7)) >> EIPG_BIT_TIMES_POSITION);

    /* Set the appropriate register */
    ENET_MAC_CONFIGURATION &= ~ENET_MAC_CONFIGURATION_IPG;
    ENET_MAC_CONFIGURATION |= MAC_CONFIGURATION_IPG(ipg_val);
    ENET_MAC_EXT_CONFIGURATION &= ~ENET_MAC_EXT_CONFIGURATION_EIPG;
    ENET_MAC_EXT_CONFIGURATION |= MAC_EXT_CONFIGURATION_EIPG(eipg_val);
}
}

/*!
    \brief      set the MAC giant packet size limit
    \param[in]  size: the giant packet size,must be greater than or equal to 1,518 bytes. Any other programmed value is considered as 1,518 bytes.
                0 - 0x3FFF;
    \param[out] none
    \retval     none
*/
void enet_mac_giant_packetsize_set(uint32_t size)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
if(NOT_GIANT_PACKET_SIZE_VALUE(size)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x001FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* set GPSLCE bit of ENET_MAC_CONFIGURATION register */
    ENET_MAC_CONFIGURATION |= ENET_MAC_CONFIGURATION_GPSLCE;
    
    /* set GPSL fields of MAC_EXT_CONFIGURATION register */
    ENET_MAC_EXT_CONFIGURATION &= ~ENET_MAC_EXT_CONFIGURATION_GPSL;
    ENET_MAC_EXT_CONFIGURATION |= MAC_EXT_CONFIGURATION_GPSL(size);
}
}

/*!
    \brief      set the MAC jabber programmable timeout
    \param[in]  val: the timeout value
                only one parameters can be selected which are shown as below
      \arg        ENET_JABBER_TIMEOUT_2KB: 2KB
      \arg        ENET_JABBER_TIMEOUT_3KB: 3KB
      \arg        ENET_JABBER_TIMEOUT_4KB: 4KB
      \arg        ENET_JABBER_TIMEOUT_5KB: 5KB
      \arg        ENET_JABBER_TIMEOUT_6KB: 6KB
      \arg        ENET_JABBER_TIMEOUT_7KB: 7KB
      \arg        ENET_JABBER_TIMEOUT_8KB: 8KB
      \arg        ENET_JABBER_TIMEOUT_9KB: 9KB
      \arg        ENET_JABBER_TIMEOUT_10KB: 10KB
      \arg        ENET_JABBER_TIMEOUT_11KB: 11KB
      \arg        ENET_JABBER_TIMEOUT_12KB: 12KB
      \arg        ENET_JABBER_TIMEOUT_13KB: 13KB
      \arg        ENET_JABBER_TIMEOUT_14KB: 14KB
      \arg        ENET_JABBER_TIMEOUT_15KB: 15KB
      \arg        ENET_JABBER_TIMEOUT_16KB: 16KB
    \param[out] none
    \retval     none
*/
void enet_mac_jabber_timeout_set(uint32_t val)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
if(NOT_ENET_JABBER_TIMEOUT(val)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0020U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* clear JD bit of ENET_MAC_CONFIGURATION register */
    ENET_MAC_CONFIGURATION &= ~ENET_MAC_CONFIGURATION_JD;
    
    /* set JTO fields and PJE bit of MAC_WATCHDOG_TIMEOUT register */
    ENET_MAC_WATCHDOG_TIMEOUT &= ~ENET_MAC_WATCHDOG_TIMEOUT_JTO;
    ENET_MAC_WATCHDOG_TIMEOUT |= val | ENET_MAC_WATCHDOG_TIMEOUT_PJE;
}
}

/*!
    \brief      set the MAC watchdog programmable timeout
    \param[in]  val: the timeout value
                only one parameters can be selected which are shown as below
      \arg        ENET_WATCHDOG_TIMEOUT_2KB: 2KB
      \arg        ENET_WATCHDOG_TIMEOUT_3KB: 3KB
      \arg        ENET_WATCHDOG_TIMEOUT_4KB: 4KB
      \arg        ENET_WATCHDOG_TIMEOUT_5KB: 5KB
      \arg        ENET_WATCHDOG_TIMEOUT_6KB: 6KB
      \arg        ENET_WATCHDOG_TIMEOUT_7KB: 7KB
      \arg        ENET_WATCHDOG_TIMEOUT_8KB: 8KB
      \arg        ENET_WATCHDOG_TIMEOUT_9KB: 9KB
      \arg        ENET_WATCHDOG_TIMEOUT_10KB: 10KB
      \arg        ENET_WATCHDOG_TIMEOUT_11KB: 11KB
      \arg        ENET_WATCHDOG_TIMEOUT_12KB: 12KB
      \arg        ENET_WATCHDOG_TIMEOUT_13KB: 13KB
      \arg        ENET_WATCHDOG_TIMEOUT_14KB: 14KB
      \arg        ENET_WATCHDOG_TIMEOUT_15KB: 15KB
      \arg        ENET_WATCHDOG_TIMEOUT_16KB: 16KB
    \param[out] none
    \retval     none
*/
void enet_mac_watchdog_timeout_set(uint32_t val)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
if(NOT_ENET_WATCHDOG_TIMEOUT(val)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0021U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* clear WD bit of ENET_MAC_CONFIGURATION register */
    ENET_MAC_CONFIGURATION &= ~ENET_MAC_CONFIGURATION_WD;

