sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    /* set WTO fields and PWE bit of MAC_WATCHDOG_TIMEOUT register */
    ENET_MAC_WATCHDOG_TIMEOUT &= ~ENET_MAC_WATCHDOG_TIMEOUT_WTO;
    ENET_MAC_WATCHDOG_TIMEOUT |= val | ENET_MAC_WATCHDOG_TIMEOUT_PWE;
}
}

/*!
    \brief      check the mac version
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_mac_version_check(void)
{
    uint32_t version;
    ErrStatus status;

    version = ENET_MAC_VERSION;
    if(MAC_VERSION == version){
        status = SUCCESS;
    } else {
        status = ERROR;
    }
    return status;
}

/*!
    \brief    put registers value into the application buffer
    \param[in]  type: register type which will be get, refer to enet_registers_type_enum,
                only one parameter can be selected which is shown as below
      \arg        ALL_MAC_REG: get the registers within the offset scope between ENET_MAC_CONFIGURATION and ENET_MAC_PPS3_WIDTH
      \arg        ALL_MTL_REG: get the registers within the offset scope between ENET_MTL_OPERATION_MODE and ENET_MTL_DPP_ECC_EIC
      \arg        ALL_MTL_Q0_REG: get the registers within the offset scope between ENET_MTL_TXQ0_OPERATION_MODE and ENET_MTL_RXQ0_CONTROL
      \arg        ALL_MTL_Q1_REG: get the registers within the offset scope between ENET_MTL_TXQ1_OPERATION_MODE and ENET_MTL_RXQ1_CONTROL
      \arg        ALL_DMA_REG: get the registers within the offset scope between ENET_DMA_MODE and ENET_DMA_MODE
      \arg        ALL_DMA_CH0_REG: get the registers within the offset scope between ENET_DMA_CH0_CONTROL and ENET_DMA_CH0_RXP_ACCEPT_CNT
      \arg        ALL_DMA_CH1_REG: get the registers within the offset scope between ENET_DMA_CH1_CONTROL and ENET_DMA_CH1_RXP_ACCEPT_CNT
    \param[in]  num: the number of registers that the user want to get
    \param[out] preg: the application buffer pointer for storing the register value
    \retval     none
*/
void enet_registers_get(enet_registers_type_enum type, uint32_t *preg,
                        uint32_t num)
{
    uint32_t offset, max;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(preg)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0023U), ERR_PARAM_POINTER);
    } else if((ALL_MAC_REG == type) && NOT_ENET_MAC_REG_NUM(num)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else if((ALL_MTL_REG == type) && NOT_ENET_MTL_REG_NUM(num)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else if((ALL_MTL_Q0_REG == type) && NOT_ENET_MTL_Q0_REG_NUM(num)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else if((ALL_MTL_Q1_REG == type) && NOT_ENET_MTL_Q1_REG_NUM(num)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else if((ALL_DMA_REG == type) && NOT_ENET_DMA_REG_NUM(num)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else if((ALL_DMA_CH0_REG == type) && NOT_ENET_DMA_CH0_REG_NUM(num)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else if((ALL_DMA_CH1_REG == type) && NOT_ENET_DMA_CH1_REG_NUM(num)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    offset = (uint32_t)type;
    max = (uint32_t)type + num;

    for(; offset < max; offset++) {
        /* get value of the corresponding register */
        *preg = REG32((ENET) + enet_reg_tab[offset]);
        preg++;
    }
}
}

/*!
    \brief      set the mode and priority for Rx queue
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  queuemode: the mode of receive queue
      \arg        QUE_OP_MODE_DISABLE: queue not enabled
      \arg        QUE_OP_MODE_AVB_ENABLE: queue enabled for AV
      \arg        QUE_OP_MODE_ENABLE: queue enabled for Generic
    \param[in]  priosel: the priorities assigned to Rx queue
    \param[out] none
    \retval     none
*/
void enet_rxq_mode_set(enet_rxq_enum enet_rxq, enet_queopmode_enum queuemode, uint8_t priosel)
{
    switch(enet_rxq) {
    case RXQ0:
        /* set the mode for Rx queue 0 */
        ENET_MAC_RXQ_CTRL0 |= MAC_RXQ_CTRL0_RXQ0EN((uint32_t)queuemode);
        /* set the priority for Rx queue 0 */
        ENET_MAC_RXQ_CTRL2 |= MAC_RXQ_CTRL2_PSRQ0((uint8_t)priosel);
        break;
    case RXQ1:
        /* set the mode for Rx queue 1 */
        ENET_MAC_RXQ_CTRL0 |= MAC_RXQ_CTRL0_RXQ1EN((uint32_t)queuemode);
        /* set the priority for Rx queue 1 */
        ENET_MAC_RXQ_CTRL2 |= MAC_RXQ_CTRL2_PSRQ1((uint8_t)priosel);
        break;
    default:
        break;
    }
}

/*!
    \brief    enable the MAC address filter
    \param[in]  mac_addr: select which MAC address will be enable, refer to enet_macaddress_enum
      \arg        ENET_MAC_ADDRESS1: enable MAC address 1 filter
      \arg        ENET_MAC_ADDRESS2: enable MAC address 2 filter
    \param[out] none
    \retval     none
*/
void enet_address_filter_enable(enet_macaddress_enum mac_addr)
{
    REG32(ENET_ADDRH_BASE + (uint32_t)mac_addr) |= ENET_MAC_ADDRESS1_HIGH_AE;
}

/*!
    \brief    disable the MAC address filter
    \param[in]  mac_addr: select which MAC address will be disable, refer to enet_macaddress_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MAC_ADDRESS1: disable MAC address 1 filter
      \arg        ENET_MAC_ADDRESS2: disable MAC address 2 filter
    \param[out] none
    \retval     none
*/
void enet_address_filter_disable(enet_macaddress_enum mac_addr)
{
    REG32(ENET_ADDRH_BASE + (uint32_t)mac_addr) &= ~ENET_MAC_ADDRESS1_HIGH_AE;
}

/*!
    \brief    configure the MAC address filter
              note: this function must be called before the enet_mac_address_set and enet_address_filter_enable functions
    \param[in]  mac_addr: select which MAC address will be configured, refer to enet_macaddress_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MAC_ADDRESS1: configure MAC address 1 filter
      \arg        ENET_MAC_ADDRESS2: configure MAC address 2 filter
    \param[in]  addr_mask: select which MAC address bytes will be mask
                one or more parameters can be selected which are shown as below
      \arg        ENET_ADDRESS_MASK_NONE:  do not mask any bytes
      \arg        ENET_ADDRESS_MASK_BYTE0: mask ENET_MAC_ADDRESS1_LOW[7:0] bits
      \arg        ENET_ADDRESS_MASK_BYTE1: mask ENET_MAC_ADDRESS1_LOW[15:8] bits
      \arg        ENET_ADDRESS_MASK_BYTE2: mask ENET_MAC_ADDRESS1_LOW[23:16] bits
      \arg        ENET_ADDRESS_MASK_BYTE3: mask ENET_MAC_ADDRESS1_LOW[31:24] bits
      \arg        ENET_ADDRESS_MASK_BYTE4: mask ENET_MAC_ADDRESS1_HIGH[7:0] bits
      \arg        ENET_ADDRESS_MASK_BYTE5: mask ENET_MAC_ADDRESS1_HIGH[15:8] bits
    \param[in]  filter_type: select which MAC address filter type will be selected
                only one parameter can be selected which is shown as below
      \arg        ENET_ADDRESS_FILTER_SA: The MAC address is used to compared with the SA field of the received frame
      \arg        ENET_ADDRESS_FILTER_DA: The MAC address is used to compared with the DA field of the received frame
    \param[out] none
    \retval     none
*/
void enet_address_filter_config(enet_macaddress_enum mac_addr, uint32_t addr_mask, uint32_t filter_type)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
   if(NOT_ENET_ADDR_MASK(addr_mask)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else if(NOT_ENET_MAC_FILTER_TYPE(filter_type)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* get the address filter register value which is to be configured */
    reg = REG32(ENET_ADDRH_BASE + (uint32_t)mac_addr);

