sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    /* clear and configure the address filter register */
    reg &= ~(ENET_MAC_ADDRESS1_HIGH_MBC | ENET_MAC_ADDRESS1_HIGH_SA);
    reg |= (addr_mask | filter_type);
    REG32(ENET_ADDRH_BASE + (uint32_t)mac_addr) = reg;
}
}

/*!
    \brief    PHY interface configuration (configure SMA clock and reset PHY chip)
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_phy_config(void)
{
    uint32_t apb1clk;
    uint32_t reg;
    ErrStatus enet_state = ERROR;
    enet_phyconfig_struct phy_config = {PHY_ADDRESS, PHY_REG_BCR, 0, 0};

    /* clear the previous MDC clock */
    reg = ENET_MAC_MDIO_ADDRESS;
    reg &= ~ENET_MAC_MDIO_ADDRESS_CR;

    /* get the APB1 frequency */
    apb1clk = rcu_clock_freq_get(CK_APB1);

    /* configure MDC clock according to APB1 frequency range */
    if(ENET_RANGE(apb1clk, 20000000U, 35000000U)) {
        reg |= ENET_MDC_APB1_DIV16;
    } else if(ENET_RANGE(apb1clk, 35000000U, 60000000U)) {
        reg |= ENET_MDC_APB1_DIV26;
    } else if(ENET_RANGE(apb1clk, 60000000U, 100000000U)) {
        reg |= ENET_MDC_APB1_DIV42;
    } else if(ENET_RANGE(apb1clk, 100000000U, 150000000U)) {
        reg |= ENET_MDC_APB1_DIV62;
    } else if((ENET_RANGE(apb1clk, 150000000U, 160000000U)) || (160000000U == apb1clk)) {
        reg |= ENET_MDC_APB1_DIV102;
    } else {
        return enet_state;
    }

    ENET_MAC_MDIO_ADDRESS = reg;

    /* reset PHY */
    phy_config.PhyValue = PHY_RESET;
    if(ERROR == enet_phy_write_read(&phy_config, ENET_PHY_WRITE, DISABLE)) {
        return enet_state;
    }
    /* PHY reset need some time */
    ENET_DELAY(ENET_DELAY_TO);

    /* check whether PHY reset is complete */
    if(ERROR == enet_phy_write_read(&phy_config, ENET_PHY_READ, DISABLE)) {
        return enet_state;
    }

    /* PHY reset complete */
    if((uint16_t)RESET == (phy_config.PhyValue & PHY_RESET)) {
        enet_state = SUCCESS;
    }

    return enet_state;
}

/*!
    \brief      get the phy interface mode
    \param[in]  none
    \param[out] none
    \retval     enet_modetype_enum: RMII_MODE or MII_MODE
*/
enet_modetype_enum enet_phy_interface_get(void)
{
    enet_modetype_enum phy_mode;

    /* get the PHY configuration to update it */
    if((uint32_t)RESET == (ENET_MAC_HW_FEATURE0 & ENET_MAC_HW_FEATURE0_ACTPHYSEL)) {
        phy_mode = MII_MODE;
    } else {
        phy_mode = RMII_MODE;
    }

    return phy_mode;
}

/*!
    \brief    write to / read from a PHY register
    \param[in]  ConfigInfo: Contains information about the PHY to read or write to
    \param[in]  direction: phy operation diretion, refer to enet_phydirection_enum
      \arg        ENET_PHY_WRITE: write data to phy register
      \arg        ENET_PHY_READ:  read data from phy register
    \param[in]  Clause45Enable: Clause 45 PHY enable
      \arg        ENABLE: Clause 45 capable PHY is connected to MDIO
      \arg        DISABLE: Clause 22 capable PHY is connected to MDIO
    \param[out] ConfigInfo: 
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_phy_write_read(enet_phyconfig_struct *ConfigInfo,
                              enet_phydirection_enum direction,
                              ControlStatus Clause45Enable)
{
    ErrStatus enet_state = ERROR;
    uint32_t timeout = 0U;
    uint32_t phy_flag;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(ConfigInfo)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x002AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_MDIO_ADDRESS &= ~(ENET_MAC_MDIO_ADDRESS_GB | ENET_MAC_MDIO_ADDRESS_PA | ENET_MAC_MDIO_ADDRESS_RDA | ENET_MAC_MDIO_ADDRESS_GOC_0 |
                               ENET_MAC_MDIO_ADDRESS_GOC_1 | ENET_MAC_MDIO_ADDRESS_C45E);


    /* if do the write operation, write value to the register */
    if(ENABLE == Clause45Enable) {
        ENET_MAC_MDIO_ADDRESS |= ENET_MAC_MDIO_ADDRESS_C45E | MAC_MDIO_ADDRESS_PA(ConfigInfo->PhyAddr) | MAC_MDIO_ADDRESS_RDA((uint32_t)ConfigInfo->DevAddr);
    } else {
        ENET_MAC_MDIO_ADDRESS |= MAC_MDIO_ADDRESS_PA(ConfigInfo->PhyAddr) | MAC_MDIO_ADDRESS_RDA(ConfigInfo->RegAddr);
    }
    /* if do the write operation, write value to the register */
    if(ENET_PHY_WRITE == direction) {
        if(ENABLE == Clause45Enable) {
            ENET_MAC_MDIO_DATA = MAC_MDIO_DATA_RA(ConfigInfo->RegAddr) | MAC_MDIO_DATA_GD(ConfigInfo->PhyValue);
        } else {
            ENET_MAC_MDIO_DATA = MAC_MDIO_DATA_GD(ConfigInfo->PhyValue);
        }
        ENET_MAC_MDIO_ADDRESS |= ENET_MAC_MDIO_ADDRESS_GOC_0;
    } else {
    /* if do the read operation, get value from the register */
        if(ENABLE == Clause45Enable) {
            ENET_MAC_MDIO_DATA |= MAC_MDIO_DATA_RA(ConfigInfo->RegAddr);
        } 
        ENET_MAC_MDIO_ADDRESS |= ENET_MAC_MDIO_ADDRESS_GOC_0 | ENET_MAC_MDIO_ADDRESS_GOC_1;
    }
    
    ENET_MAC_MDIO_ADDRESS |= ENET_MAC_MDIO_ADDRESS_GB;

    /* Wait for completion */
    do {
        phy_flag = (ENET_MAC_MDIO_ADDRESS & ENET_MAC_MDIO_ADDRESS_GB);
        timeout++;
    } while(((uint32_t)RESET != phy_flag) && (ENET_DELAY_TO != timeout));

    /* write/read operation complete */
    if((uint32_t)RESET == (ENET_MAC_MDIO_ADDRESS & ENET_MAC_MDIO_ADDRESS_GB)) {
        enet_state = SUCCESS;
    }

    /* if do the read operation, get value from the register */
    if(ENET_PHY_READ == direction) {

        ConfigInfo->PhyValue = (uint16_t)ENET_MAC_MDIO_DATA;
    }
}
    return enet_state;
}

/*!
    \brief    enable the loopback function of PHY chip
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus enet_phyloopback_enable(void)
{
    ErrStatus phy_state;
    enet_phyconfig_struct phy_config = {PHY_ADDRESS, PHY_REG_BCR, 0, 0};

    /* get the PHY configuration to update it */
    phy_state = enet_phy_write_read(&phy_config, ENET_PHY_READ, DISABLE);
    if(ERROR != phy_state){
    /* enable the PHY loopback mode */
    phy_config.PhyValue |= PHY_LOOPBACK;
    /* update the PHY control register with the new configuration */
    phy_state = enet_phy_write_read(&phy_config, ENET_PHY_WRITE, DISABLE);
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    ENET_DELAY(PHY_DELAY_TO);

