sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    return phy_state;
}

/*!
    \brief    disable the loopback function of PHY chip
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus enet_phyloopback_disable(void)
{
    ErrStatus phy_state;
    enet_phyconfig_struct phy_config = {PHY_ADDRESS, PHY_REG_BCR, 0, 0};

    /* get the PHY configuration to update it */
    phy_state = enet_phy_write_read(&phy_config, ENET_PHY_READ, DISABLE);
    if(ERROR != phy_state){
    /* disable the PHY loopback mode */
    phy_config.PhyValue &= (uint16_t)~PHY_LOOPBACK;

    /* update the PHY control register with the new configuration */
    phy_state = enet_phy_write_read(&phy_config, ENET_PHY_WRITE, DISABLE);
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    return phy_state;
}

/*!
    \brief    enable ENET forward feature
    \param[in]  feature: the feature of ENET forward mode
                only one parameter can be selected which are shown as below
      \arg        ENET_AUTO_PADCRC_DROP: the function of the MAC strips the Pad/FCS field on received frames
      \arg        ENET_TYPEFRAME_CRC_DROP: the function that FCS field(last 4 bytes) of frame will be dropped before forwarding
      \arg        ENET_RXQ0_FORWARD_ERRFRAMES: the forward error packets function is enabled in queue 0
      \arg        ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES: the forward undersized good packets function is enabled in queue 0
      \arg        ENET_RXQ1_FORWARD_ERRFRAMES: the forward error packets function is enabled in queue 1
      \arg        ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES:  the forward undersized good packets function is enabled in queue 1
    \param[out] none
    \retval     none
*/
void enet_forward_feature_enable(uint32_t feature)
{
    uint32_t mask;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FORWARD_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x002DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{

    mask = (feature & (~(ENET_RXQ0_FORWARD_ERRFRAMES | ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES | ENET_RXQ1_FORWARD_ERRFRAMES |
                         ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES)));
    ENET_MAC_CONFIGURATION |= mask;

    mask = (feature & (~(ENET_AUTO_PADCRC_DROP | ENET_TYPEFRAME_CRC_DROP | ENET_RXQ1_FORWARD_ERRFRAMES | ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES)));
    ENET_MTL_RXQ0_OPERATION_MODE |= (mask >> 2);

    mask = (feature & (~(ENET_AUTO_PADCRC_DROP | ENET_TYPEFRAME_CRC_DROP | ENET_RXQ0_FORWARD_ERRFRAMES | ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES)));
    ENET_MTL_RXQ1_OPERATION_MODE |= mask;
}
}

/*!
    \brief    disable ENET forward feature
    \param[in]  feature: the feature of ENET forward mode
                only one parameter can be selected which are shown as below
      \arg        ENET_AUTO_PADCRC_DROP: the function of the MAC strips the Pad/FCS field on received frames
      \arg        ENET_TYPEFRAME_CRC_DROP: the function that FCS field(last 4 bytes) of frame will be dropped before forwarding
      \arg        ENET_RXQ0_FORWARD_ERRFRAMES: the forward error packets function is enabled in queue 0
      \arg        ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES: the forward undersized good packets function is enabled in queue 0
      \arg        ENET_RXQ1_FORWARD_ERRFRAMES: the forward error packets function is enabled in queue 1
      \arg        ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES:  the forward undersized good packets function is enabled in queue 1
    \param[out] none
    \retval     none
*/
void enet_forward_feature_disable(uint32_t feature)
{
    uint32_t mask;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FORWARD_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    mask = (feature & (~(ENET_RXQ0_FORWARD_ERRFRAMES | ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES | ENET_RXQ1_FORWARD_ERRFRAMES |
                         ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES)));
    ENET_MAC_CONFIGURATION &= ~mask;

    mask = (feature & (~(ENET_AUTO_PADCRC_DROP | ENET_TYPEFRAME_CRC_DROP | ENET_RXQ1_FORWARD_ERRFRAMES | ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES)));
    ENET_MTL_RXQ0_OPERATION_MODE &= ~(mask >> 2);

    mask = (feature & (~(ENET_AUTO_PADCRC_DROP | ENET_TYPEFRAME_CRC_DROP | ENET_RXQ0_FORWARD_ERRFRAMES | ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES)));
    ENET_MTL_RXQ1_OPERATION_MODE &= ~mask;
}
}

/*!
    \brief      enable ENET fliter feature
    \param[in]  feature: the feature of ENET fliter mode
                one or more parameters can be selected which are shown as below
      \arg        ENET_L3L4_FILTER: filter  Layer 3 and Layer 4 filters function
      \arg        ENET_VLAN_FILTER: filter VLAN tag function
      \arg        ENET_SRC_FILTER: filter source address function
      \arg        ENET_SRC_FILTER_INVERSE: inverse source address filtering result function
      \arg        ENET_BROADCASTFRAMES_FILTER: filter all incoming broadcast frames function
      \arg        ENET_DEST_FILTER_INVERSE: inverse DA filtering result function
      \arg        ENET_MULTICAST_FILTER_PASS: pass all multicast frames function
      \arg        ENET_MULTICAST_FILTER_HASH_MODE: HASH multicast filter function
      \arg        ENET_UNICAST_FILTER_HASH_MODE: HASH unicast filter function
      \arg        ENET_FILTER_MODE_EITHER: HASH or perfect filter function
    \param[out] none
    \retval     none
*/
void enet_fliter_feature_enable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FILTER_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x002FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_PACKET_FILTER |= feature;
}
}

/*!
    \brief    disable ENET fliter feature
    \param[in]  feature: the feature of ENET fliter mode
                one or more parameters can be selected which are shown as below
      \arg        ENET_L3L4_FILTER: filter  Layer 3 and Layer 4 filters function
      \arg        ENET_VLAN_FILTER: filter VLAN tag function
      \arg        ENET_SRC_FILTER: filter source address function
      \arg        ENET_SRC_FILTER_INVERSE: inverse source address filtering result function
      \arg        ENET_BROADCASTFRAMES_FILTER: filter all incoming broadcast frames function
      \arg        ENET_DEST_FILTER_INVERSE: inverse DA filtering result function
      \arg        ENET_MULTICAST_FILTER_PASS: pass all multicast frames function
      \arg        ENET_MULTICAST_FILTER_HASH_MODE: HASH multicast filter function
      \arg        ENET_UNICAST_FILTER_HASH_MODE: HASH unicast filter function
      \arg        ENET_FILTER_MODE_EITHER: HASH or perfect filter function
    \param[out] none
    \retval     none
*/
void enet_fliter_feature_disable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FILTER_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0030U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_PACKET_FILTER &= ~feature;
}
}

/*!
    \brief      set the filter fail packets queue
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  type: the type of filter fail packet
                only one parameter can be selected which are shown as below
      \arg        MAC_UNICAST_ADDRESS_FLITER_FAIL: unicast address filter fail packets queuing enable
      \arg        MAC_MULTICAST_ADDRESS_FLITER_FAIL: multicast address filter fail packets queuing enable
      \arg        MAC_VLAN_TAG_FLITER_FAIL: VLAN tag filter fail packets queuing enable
    \param[out] none
    \retval     none
*/
void enet_fliterfail_queue_set(enet_rxq_enum enet_rxq, uint32_t type)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FILTER_FAIL_PACKET_TYPE(type)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0031U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(type) {
    case MAC_UNICAST_ADDRESS_FLITER_FAIL:
        ENET_MAC_RXQ_CTRL4 |= type;
        ENET_MAC_RXQ_CTRL4 |= MAC_UNICAST_ADDRESS_FLITER_FAIL_QUEUE(enet_rxq);
        break;
    case MAC_MULTICAST_ADDRESS_FLITER_FAIL:
        ENET_MAC_RXQ_CTRL4 |= type;
        ENET_MAC_RXQ_CTRL4 |= MAC_MULTICAST_ADDRESS_FLITER_FAIL_QUEUE(enet_rxq);
        break;
    case MAC_VLAN_TAG_FLITER_FAIL:
        ENET_MAC_RXQ_CTRL4 |= type;
        ENET_MAC_RXQ_CTRL4 |= MAC_VLAN_TAG_FLITER_FAIL_QUEUE(enet_rxq);
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the normal packets queue
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  type: the type of packet
                only one parameter can be selected which are shown as below
      \arg        MAC_AV_TAG_PACKET_QUEUE: AV untagged control packets queue
      \arg        MAC_PTP_PACKET_QUEUE: PTP packets queue
      \arg        MAC_UNTAGGED_PACKET_QUEUE: untagged packet queue
      \arg        MAC_MULTI_BROAD_PACKET_QUEUE: multicast and broadcast queue
      \arg        MAC_FPE_RESIDUE_PACKET_QUEUE: frame preemption residue queue
    \param[out] none
    \retval     none
*/
void enet_normal_frame_queue_set(enet_rxq_enum enet_rxq, enet_frame_type_enum type)
{
    if(MAC_FPE_RESIDUE_PACKET_QUEUE == type){
        if(RXQ1==enet_rxq) {
            ENET_MAC_RXQ_CTRL1 |= (uint32_t)((uint32_t)enet_rxq << (uint32_t)type);
        } else {
            /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
        }
    } else {
        ENET_MAC_RXQ_CTRL1 |= (uint32_t)((uint32_t)enet_rxq << (uint32_t)type);
    }
}

/*!
    \brief      set the normal packets queue related configuration
    \param[in]  config: the related configuration of packet queue
                only one parameter can be selected which are shown as below
      \arg        MAC_RXQ_MCBC_PRIORITY_ENABLE: multicast and broadcast queue enable
      \arg        MAC_RXQ_MCBC_PRIORITY_DISABLE: multicast and broadcast queue disable
      \arg        MAC_RXQ_PTPOE_AS_GENERIC_VLAN: VLAN Tagged PTPoE packets are routed as generic VLAN Tagged packet
      \arg        MAC_RXQ_PTPOE_TO_PTPQ: VLAN Tagged PTPoE packets are routed to Rx Queue specified by PTPQ field
      \arg        MAC_RXQ_PTPOE_TO_PSRQ: VLAN Tagged PTPoE packets are routed to only AV enabled Rx Queues based on PSRQ
      \arg        MAC_AV_TAG_PACKET_QUEUE_ENABLE: tagged AV control packets queuing enable
      \arg        MAC_AV_TAG_PACKET_QUEUE_DISABLE: tagged AV control packets queuing disable
      \arg        MAC_RXQ_MCBC_PRIORITY_OVER_ENABLE: over-riding MC-BC queue priority select enable
      \arg        MAC_RXQ_MCBC_PRIORITY_OVER_DISABLE: over-riding MC-BC queue priority select disable
      \arg        MAC_RXQ_TYPE_BASED_ENABLE: type field based Rx queuing enable
      \arg        MAC_RXQ_TYPE_BASED_DISABLE: type field based Rx queuing disable
    \param[out] none
    \retval     none
*/
void enet_normal_frame_queue_config(uint32_t config)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_PACKET_QUEUE_CFG(config)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0033U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(config) {
    case MAC_RXQ_MCBC_PRIORITY_ENABLE:
    case MAC_RXQ_PTPOE_TO_PTPQ:
    case MAC_RXQ_PTPOE_TO_PSRQ:
    case MAC_AV_TAG_PACKET_QUEUE_ENABLE:
    case MAC_RXQ_MCBC_PRIORITY_OVER_ENABLE:
    case MAC_RXQ_TYPE_BASED_ENABLE:
        ENET_MAC_RXQ_CTRL1 |= config;
        break;
    case MAC_RXQ_MCBC_PRIORITY_DISABLE:
    case MAC_RXQ_PTPOE_AS_GENERIC_VLAN:
    case MAC_AV_TAG_PACKET_QUEUE_DISABLE:
    case MAC_RXQ_MCBC_PRIORITY_OVER_DISABLE:
    case MAC_RXQ_TYPE_BASED_DISABLE:
        ENET_MAC_RXQ_CTRL1 &= config;
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the the FSM and interface timeout values
    \param[in]  type: the related type of the FSM and interface timeout
                one parameter can be selected which are shown as below
      \arg         ENET_LARGE_MODE_TIMEOUT: Large Mode Timeout Value
      \arg         ENET_NORMAL_MODE_TIMEOUT: Normal Mode Timeout Value
      \arg         ENET_CSR_CLOCK_VAL: CSR Clocks for 1us Tic
    \param[in]  val: the FSM and interface timeout values
                one parameter can be selected which are shown as below
      \arg         ENET_FSM_TIMEOUT_DISABLE: timer disabled
      \arg         ENET_FSM_TIMEOUT_1US: 1us
      \arg         ENET_FSM_TIMEOUT_4MS: 1.024ms (~4ms)
      \arg         ENET_FSM_TIMEOUT_16MS: 16.384ms (~16ms)
      \arg         ENET_FSM_TIMEOUT_64MS: 65.536ms (~64ms)
      \arg         ENET_FSM_TIMEOUT_256MS: 262.144ms (~256ms)
      \arg         ENET_FSM_TIMEOUT_1SEC: 1.048sec (~1sec)
      \arg         ENET_FSM_TIMEOUT_4SEC: 4.194sec (~4sec)
      \arg         ENET_FSM_TIMEOUT_16SEC: 16.777sec (~16sec)
      \arg         ENET_FSM_TIMEOUT_32SEC: 33.554sec (~32sec)
      \arg         ENET_FSM_TIMEOUT_64SEC: 67.108sec (~64sec)

    \param[out] none
    \retval     none
*/
void enet_fsm_timeout_set(enet_fsmtimeout_enum type, uint32_t val)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FSM_TIMEOUT_VALUE(val)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0034U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(type) {
    case ENET_LARGE_MODE_TIMEOUT:
        ENET_MAC_FSM_ACT_TIMER &= ~ENET_MAC_FSM_ACT_TIMER_LTMRMD;
        ENET_MAC_FSM_ACT_TIMER |= MAC_FSM_ACT_TIMER_LTMRMD(val);
        break;
    case ENET_NORMAL_MODE_TIMEOUT:
        ENET_MAC_FSM_ACT_TIMER &= ~ENET_MAC_FSM_ACT_TIMER_NTMRMD;
        ENET_MAC_FSM_ACT_TIMER |= MAC_FSM_ACT_TIMER_NTMRMD(val);
        break;
    case ENET_CSR_CLOCK_VAL:
        ENET_MAC_FSM_ACT_TIMER &= ~ENET_MAC_FSM_ACT_TIMER_TMR;
        ENET_MAC_FSM_ACT_TIMER |= MAC_FSM_ACT_TIMER_TMR(val);
        break;
    default:
        break;
    }
}
}

/*!
    \brief      start the Rx DMA
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_rx_dma_start(enet_dmach_enum dmach)
{
    if(DMACH0 == dmach) {
        ENET_DMA_CH0_RX_CONTROL |= ENET_DMA_CH_RX_CONTROL_SR;
    } else {
        ENET_DMA_CH1_RX_CONTROL |= ENET_DMA_CH_RX_CONTROL_SR;
    }
}

/*!
    \brief      start the Tx DMA
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_tx_dma_start(enet_dmach_enum dmach)
{

    if(DMACH0 == dmach) {
        ENET_DMA_CH0_TX_CONTROL |= ENET_DMA_CH_TX_CONTROL_ST;
    } else {
        ENET_DMA_CH1_TX_CONTROL |= ENET_DMA_CH_TX_CONTROL_ST;
    }
}

/*!
    \brief    generate the pause frame, ENET will send pause frame after enable transmit flow control
                this function only use in full-dulex mode
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus enet_pauseframe_generate(void)
{
    ErrStatus enet_state = ERROR;
    uint32_t temp;

