sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    /* in full-duplex mode, must make sure this bit is 0 before writing register */
    temp = ENET_MAC_Q0_TX_FLOW_CTRL & ENET_MAC_Q0_TX_FLOW_CTRL_FCB_BPA;
    if((uint32_t)RESET == temp) {
        ENET_MAC_Q0_TX_FLOW_CTRL |= ENET_MAC_Q0_TX_FLOW_CTRL_FCB_BPA;
        enet_state = SUCCESS;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }
    return enet_state;
}

/*!
    \brief    configure the pause frame detect type
    \param[in]  detect: pause frame detect type
                only one parameter can be selected which is shown as below
      \arg        ENET_MAC0_AND_UNIQUE_ADDRESS_PAUSEDETECT: besides the unique multicast address, MAC can also
                                                            use the MAC0 address to detecting pause frame
      \arg        ENET_UNIQUE_PAUSEDETECT: only the unique multicast address for pause frame which is specified
                                           in IEEE802.3 can be detected
    \param[out] none
    \retval     none
*/
void enet_pauseframe_detect_config(uint32_t detect)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_PAUSEFRAME_DETECT(detect)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0038U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_RX_FLOW_CTRL &= ~ENET_MAC_RX_FLOW_CTRL_UP;
    ENET_MAC_RX_FLOW_CTRL |= (detect >> 8);
}
}

/*!
    \brief    configure the pause frame parameters
    \param[in]  pausetime: pause time in transmit pause control frame
    \param[in]  pause_threshold: the threshold of the pause timer for retransmitting frames automatically
                this value must make sure to be less than configured pause time
                only one parameter can be selected which is shown as below
      \arg        ENET_PAUSETIME_MINUS4: pause time minus 4 slot times
      \arg        ENET_PAUSETIME_MINUS28: pause time minus 28 slot times
      \arg        ENET_PAUSETIME_MINUS36: pause time minus 36 slot times
      \arg        ENET_PAUSETIME_MINUS144: pause time minus 144 slot times
      \arg        ENET_PAUSETIME_MINUS256: pause time minus 256 slot times
      \arg        ENET_PAUSETIME_MINUS256_2: pause time minus 256 slot times
    \param[out] none
    \retval     none
*/
void enet_pauseframe_config(uint16_t pausetime, uint32_t pause_threshold)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_PAUSE_THRESHOLD(pause_threshold)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0039U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_Q0_TX_FLOW_CTRL &= ~(ENET_MAC_Q0_TX_FLOW_CTRL_PT | ENET_MAC_Q0_TX_FLOW_CTRL_PLT);
    ENET_MAC_Q0_TX_FLOW_CTRL |= (MAC_Q0_TX_FLOW_CTRL_PT(pausetime) | pause_threshold);
}
}

/*!
    \brief    configure the threshold of the flow control(deactive and active threshold)
    \param[in]  rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  deactive: the threshold of the deactive flow control
                this value should always be less than active flow control value
                only one parameter can be selected which is shown as below
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_1K: threshold level is full minus 1 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_1_5K: threshold level is full minus 1.5 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_2K: threshold level is full minus 2 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_2_5K: threshold level is full minus 2.5 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_3K: threshold level is full minus 3 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_3_5K: threshold level is full minus 3.5 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_4K: threshold level is full minus 4 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_4_5K: threshold level is full minus 4.5 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_5K: threshold level is full minus 5 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_5_5K: threshold level is full minus 5.5 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_6K: threshold level is full minus 6 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_6_5K: threshold level is full minus 6.5 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_7K: threshold level is full minus 7 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_7_5K: threshold level is full minus 7.5 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_8K: threshold level is full minus 8 KB
      \arg        ENET_DEACTIVE_THRESHOLD_FULL_MINUS_8_5K: threshold level is full minus 8.5 KB
    \param[in]  active: the threshold of the active flow control
                only one parameter can be selected which is shown as below
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_1K: threshold level is full minus 1 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_1_5K: threshold level is full minus 1.5 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_2K: threshold level is full minus 2 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_2_5K: threshold level is full minus 2.5 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_3K: threshold level is full minus 3 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_3_5K: threshold level is full minus 3.5 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_4K: threshold level is full minus 4 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_4_5K: threshold level is full minus 4.5 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_5K: threshold level is full minus 5 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_5_5K: threshold level is full minus 5.5 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_6K: threshold level is full minus 6 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_6_5K: threshold level is full minus 6.5 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_7K: threshold level is full minus 7 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_7_5K: threshold level is full minus 7.5 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_8K: threshold level is full minus 8 KB
      \arg        ENET_ACTIVE_THRESHOLD_FULL_MINUS_8_5K: threshold level is full minus 8.5 KB
    \param[out] none
    \retval     none
*/
void enet_flowcontrol_threshold_config(enet_rxq_enum rxq, uint32_t deactive, uint32_t active)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_DEACTIVE_THRESHOLD(deactive)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else if(NOT_ENET_ACTIVE_THRESHOLD(active)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(rxq) {
    case RXQ0:
        ENET_MTL_RXQ0_OPERATION_MODE &= ~(ENET_MTL_RXQ0_OPERATION_MODE_RFD | ENET_MTL_RXQ0_OPERATION_MODE_RFA);
        ENET_MTL_RXQ0_OPERATION_MODE |= (deactive | active);
        break;
    case RXQ1:
        ENET_MTL_RXQ1_OPERATION_MODE &= ~(ENET_MTL_RXQ1_OPERATION_MODE_RFD | ENET_MTL_RXQ1_OPERATION_MODE_RFA);
        ENET_MTL_RXQ1_OPERATION_MODE |= (deactive | active);
        break;
    default:
        break;
    }
}
}

/*!
    \brief    enable ENET flow control feature
    \param[in]  feature: the feature of ENET flow control mode
                only one parameter can be selected which are shown as below
      \arg        ENET_ZERO_QUANTA_PAUSE: the automatic zero-quanta generation function
      \arg        ENET_TX_FLOWCONTROL: the flow control operation in the MAC
      \arg        ENET_RX_FLOWCONTROL: decoding function for the received pause frame and process it
      \arg        ENET_BACK_PRESSURE: back pressure operation in the MAC(only use in half-dulex mode)
    \param[out] none
    \retval     none
*/
void enet_flowcontrol_feature_enable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FLOWCONTROL_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if((uint32_t)RESET != (feature & ENET_RX_FLOWCONTROL)) {
        ENET_MAC_RX_FLOW_CTRL |= (feature >> 8);
    } else {
        if((uint32_t)RESET != (feature & ENET_ZERO_QUANTA_PAUSE)) {
            ENET_MAC_Q0_TX_FLOW_CTRL &= ~ENET_ZERO_QUANTA_PAUSE;
        }
        feature &= ~ENET_ZERO_QUANTA_PAUSE;
        ENET_MAC_Q0_TX_FLOW_CTRL |= feature;
    }
}
}

/*!
    \brief    disable ENET flow control feature
    \param[in]  feature: the feature of ENET flow control mode
                only one parameter can be selected which are shown as below
      \arg        ENET_ZERO_QUANTA_PAUSE: the automatic zero-quanta generation function
      \arg        ENET_TX_FLOWCONTROL: the flow control operation in the MAC
      \arg        ENET_RX_FLOWCONTROL: decoding function for the received pause frame and process it
      \arg        ENET_BACK_PRESSURE: back pressure operation in the MAC(only use in half-dulex mode)
    \param[out] none
    \retval     none
*/
void enet_flowcontrol_feature_disable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FLOWCONTROL_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x003CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if((uint32_t)RESET != (feature & ENET_RX_FLOWCONTROL)) {
        ENET_MAC_RX_FLOW_CTRL &= ~(feature >> 8);
    } else {
        if((uint32_t)RESET != (feature & ENET_ZERO_QUANTA_PAUSE)) {
            ENET_MAC_Q0_TX_FLOW_CTRL |= ENET_ZERO_QUANTA_PAUSE;
        }
        feature &= ~ENET_ZERO_QUANTA_PAUSE;
        ENET_MAC_Q0_TX_FLOW_CTRL &= ~feature;
    }
}
}

/*!
    \brief    config ENET frame preemption feature
    \param[in]  feature: the feature of ENET frame preemption
                only one parameter can be selected which are shown as below
      \arg        ENET_SEND_RESPOND_FRAME: send respond frame
      \arg        ENET_SEND_VERIFY_FRAME: send verify frame
      \arg        ENET_AUTOGENERATE_RESPOND_MPACKET: autogenerate respond mPacket on receiving verify mPacket is enabled
      \arg        ENET_TX_FRAME_PREEMPTION: Tx frame preemption is enabled
    \param[out] none
    \retval     none
*/
void enet_framepreemption_feature_enable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FRAMEPREEMPTION_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_FPE_CTRL_STS |= feature;
}
}

/*!
    \brief    disable ENET frame preemption feature
    \param[in]  feature: the feature of ENET frame preemption
                only one parameter can be selected which are shown as below
      \arg        ENET_AUTOGENERATE_RESPOND_MPACKET: autogenerate respond mPacket on receiving verify mPacket is disable
      \arg        ENET_TX_FRAME_PREEMPTION: Tx frame preemption is disable
    \param[out] none
    \retval     none
*/
void enet_framepreemption_feature_disable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_FRAMEPREEMPTION_FEATURE1(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_FPE_CTRL_STS &= ~feature;
}
}

/*!
    \brief      get the dma transmit/receive process state
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  direction: choose the direction of dma process which users want to check, refer to enet_dmadirection_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: dma transmit process
      \arg        ENET_DMA_RX: dma receive process
    \param[out] none
    \retval     state of dma process, the value range shows below:
                  ENET_RX_STATE_STOPPED, ENET_RX_STATE_FETCHING, ENET_RX_STATE_WAITING,
                  ENET_RX_STATE_SUSPENDED, ENET_RX_STATE_CLOSING, ENET_RX_STATE_WRITING, ENET_RX_STATE_QUEUING,
                  ENET_TX_STATE_STOPPED, ENET_TX_STATE_FETCHING, ENET_TX_STATE_WAITING,
                  ENET_TX_STATE_READING, ENET_TX_STATE_SUSPENDED, ENET_TX_STATE_WRITING, ENET_TX_STATE_CLOSING
*/
uint32_t enet_dmaprocess_state_get(enet_dmach_enum dmach, enet_dmadirection_enum direction)
{
    uint32_t reval;
    reval = 0U;

    switch(dmach) {
    case DMACH0:
        reval = (uint32_t)(ENET_DMA_DEBUG_STATUS0 & (uint32_t)direction);
        break;
    case DMACH1:
        reval = (uint32_t)((ENET_DMA_DEBUG_STATUS0 & ((uint32_t)direction) << 8U) >> 8U);
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief      start/stop the DMA transmission/reception
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  direction: choose the direction of DMA process which users want to resume, refer to enet_dmadirection_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: DMA transmit process
      \arg        ENET_DMA_RX: DMA receive process
    \param[in]  status: the status of dma Tx/Rx channel
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: start the DMA transmission/reception
      \arg        DISABLE: stop the DMA transmission/reception
    \param[out] none
    \retval     none
*/
void enet_dmaprocess_config(enet_dmach_enum dmach, enet_dmadirection_enum direction, ControlStatus status)
{
    switch(dmach) {
    case DMACH0:
         if(ENET_DMA_TX == direction) {
            ENET_DMA_CH0_TX_CONTROL &= ~ENET_DMA_CH_TX_CONTROL_ST;
            ENET_DMA_CH0_TX_CONTROL |= (uint32_t)status;
        } else {
            ENET_DMA_CH0_RX_CONTROL &= ~ENET_DMA_CH_RX_CONTROL_SR;
            ENET_DMA_CH0_RX_CONTROL |= (uint32_t)status;
        }
        break;
    case DMACH1:
        if(ENET_DMA_TX == direction) {
            ENET_DMA_CH1_TX_CONTROL &= ~ENET_DMA_CH_TX_CONTROL_ST;
            ENET_DMA_CH1_TX_CONTROL |= (uint32_t)status;
        } else {
            ENET_DMA_CH1_RX_CONTROL &= ~ENET_DMA_CH_RX_CONTROL_SR;
            ENET_DMA_CH1_RX_CONTROL |= (uint32_t)status;
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      check and recover the Rx process
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_rxprocess_check_recovery(enet_dmach_enum dmach)
{
    uint32_t status;

    if(DMACH0 == dmach) {
        /* get DAV information of current RxDMA descriptor */
        status = dma_current_rxdesc->DES3;
        status &= ENET_NORMAL_RDES3_WF_OWN;
        /* if current descriptor is owned by DMA, but the descriptor address mismatches with
        receive descriptor address pointer updated by RxDMA controller */
        if((ENET_DMA_CH0_CURRENT_APP_RXDESC != ((uint32_t)dma_current_rxdesc)) &&
                (ENET_NORMAL_RDES3_WF_OWN == status)) {
            dma_current_rxdesc = (enet_descriptors_struct *)ENET_DMA_CH0_CURRENT_APP_RXDESC;
        }
    } else {
        /* get DAV information of current RxDMA descriptor */
        status = dma_current_rxdesc1->DES3;
        status &= ENET_NORMAL_RDES3_WF_OWN;
        /* if current descriptor is owned by DMA, but the descriptor address mismatches with
        receive descriptor address pointer updated by RxDMA controller */
        if((ENET_DMA_CH1_CURRENT_APP_RXDESC != ((uint32_t)dma_current_rxdesc1)) &&
                (ENET_NORMAL_RDES3_WF_OWN == status)) {
            dma_current_rxdesc1 = (enet_descriptors_struct *)ENET_DMA_CH1_CURRENT_APP_RXDESC;
        }
    }
}

/*!
    \brief    get the transmit/receive address of current descriptor, or current buffer, or descriptor table
    \param[in]  addr_get: choose the address which users want to get, refer to enet_desc_reg_enum
                only one parameter can be selected which is shown as below
    \arg        ENET_CH0_RX_DESC_TABLE: DMA channel 0 RX descriptor table
    \arg        ENET_CH1_RX_DESC_TABLE: DMA channel 1 RX descriptor table
    \arg        ENET_CH0_RX_DESC_TAIL: DMA channel 0 RX descriptor tail pointer
    \arg        ENET_CH1_RX_DESC_TAIL: DMA channel 1 RX descriptor tail pointer
    \arg        ENET_CH0_RX_CURRENT_DESC: DMA channel 0  current RX descriptor
    \arg        ENET_CH1_RX_CURRENT_DESC: DMA channel 1 current RX descriptor
    \arg        ENET_CH0_RX_CURRENT_BUFFER: DMA channel 0 current RX buffer
    \arg        ENET_CH1_RX_CURRENT_BUFFER: DMA channel 1 current RX buffer
    \arg        ENET_CH0_TX_DESC_TABLE: DMA channel 0 TX descriptor table
    \arg        ENET_CH1_TX_DESC_TABLE: DMA channel 1 TX descriptor table
    \arg        ENET_CH0_TX_DESC_TAIL: DMA channel 0 TX descriptor tail pointer
    \arg        ENET_CH1_TX_DESC_TAIL: DMA channel 1 TX descriptor tail pointer
    \arg        ENET_CH0_TX_CURRENT_DESC: DMA channel 0 current TX descriptor
    \arg        ENET_CH1_TX_CURRENT_DESC: DMA channel 1 current TX descriptor
    \arg        ENET_CH0_TX_CURRENT_BUFFER: DMA channel 0 current TX buffer
    \arg        ENET_CH1_TX_CURRENT_BUFFER: DMA channel 1 current TX buffer
    \param[out] none
    \retval     address value
*/
uint32_t enet_dma_desc_address_get(enet_desc_reg_enum addr_get)
{
    uint32_t reval;

    reval = REG32((ENET) + (uint32_t)addr_get);

    return reval;
}

/*!
    \brief    get the Tx or Rx descriptor information
    \param[in]  desc: the descriptor pointer which users want to get information
    \param[in]  info_get: the descriptor information type which is selected, refer to enet_descstate_enum
                only one parameter can be selected which is shown as below
      \arg        RXDESC_FRAME_LENGTH: the byte length of the received frame that was transferred to the buffer
      \arg        TXDESC_COLLISION_COUNT: the number of collisions occurred before the frame was transmitted
      \arg        RXDESC_BUFFER_1_ADDR: the buffer1 address of the Rx frame
      \arg        RXDESC_BUFFER_2_ADDR: the buffer2 address of the Rx frame
      \arg        TXDESC_BUFFER_1_ADDR: the buffer1 address of the Tx frame
      \arg        TXDESC_BUFFER_2_ADDR: the buffer2 address of the Tx frame
    \param[out] none
    \retval     descriptor information, if value is 0xFFFFFFFFU, means the false input parameter
*/
uint32_t enet_desc_information_get(enet_descriptors_struct *desc, enet_descstate_enum info_get)
{
    uint32_t reval = 0xFFFFFFFFU;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(desc)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0043U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(info_get) {
    case RXDESC_FRAME_LENGTH:
        reval = GET_RDES3_PL(desc->DES3);
        if(reval > 4U) {
            reval = reval - 4U;
        } else {
            reval = 0U;
        }

        break;
    case RXDESC_BUFFER_1_ADDR:
        reval = desc->buffer_address;
        break;
    case RXDESC_BUFFER_2_ADDR:
        reval = desc->DES1;
        break;
    case TXDESC_BUFFER_1_ADDR:
        reval = desc->buffer_address;
        break;
    case TXDESC_BUFFER_2_ADDR:
        reval = desc->DES1;
        break;
    case TXDESC_COLLISION_COUNT:
        reval = GET_TDES3_COCNT(desc->DES3);
        break;
    default:
        break;
    }
}
    return reval;

