sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
}

/*!
    \brief    get the number of missed/received frames during receiving
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] rxdma_received: pointer to the number of frames received by the Rx paeser
    \param[out] rxdma_drop: pointer to the number of frames missed by the RxDMA controller
    \retval     none
*/
void enet_missed_frame_counter_get(enet_dmach_enum dmach, uint32_t *rxdma_received, uint32_t *rxdma_drop)
{
    uint32_t temp_counter;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(rxdma_received)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0044U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(rxdma_drop)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0044U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0:
        temp_counter = ENET_DMA_CH0_MISS_FRAME_CNT;
        *rxdma_drop = GET_DMA_CH_MISS_FRAME_CNT_MSFC(temp_counter);
        temp_counter = ENET_DMA_CH0_RXP_ACCEPT_CNT;
        *rxdma_received = GET_DMA_CH_RXP_ACCEPT_CNT_RXPAC(temp_counter);
        break;
    case DMACH1:
        temp_counter = ENET_DMA_CH1_MISS_FRAME_CNT;
        *rxdma_drop = GET_DMA_CH_MISS_FRAME_CNT_MSFC(temp_counter);
        temp_counter = ENET_DMA_CH1_RXP_ACCEPT_CNT;
        *rxdma_received = GET_DMA_CH_RXP_ACCEPT_CNT_RXPAC(temp_counter);
        break;
    default:
        break;
    }
}
}

/*!
    \brief      get the overflow status of missed/received frame counter
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  counter: choose the counter of dma
                only one parameter can be selected which is shown as below, refer to enet_dmacounter_enum
      \arg        DMA_MISS_FRAME_COUNT: missed frame counter
      \arg        DMA_ACCEPT_FRAME_COUNT: received frame counter
    \retval     FlagStatus: SET or RESET
*/
FlagStatus enet_counter_overflow_status_get(enet_dmach_enum dmach, enet_dmacounter_enum counter)
{
    uint32_t temp_counter;
    FlagStatus flag;
    flag = RESET;

    switch(dmach) {
    case DMACH0:
        if(DMA_MISS_FRAME_COUNT == counter) {
            temp_counter = ENET_DMA_CH0_MISS_FRAME_CNT;
            if((uint32_t)RESET != (temp_counter & ENET_DMA_CH_MISS_FRAME_CNT_MFCO)){
                flag = SET;
            } else {
            /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
            }
        } else {
            temp_counter = ENET_DMA_CH0_RXP_ACCEPT_CNT;
            if((uint32_t)RESET != (temp_counter & ENET_DMA_CH_RXP_ACCEPT_CNT_RXPACOF)){
                flag = SET;
            } else {
            /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
            }
        }
        break;
    case DMACH1:
        if(DMA_MISS_FRAME_COUNT == counter) {
            temp_counter = ENET_DMA_CH1_MISS_FRAME_CNT;
            if((uint32_t)RESET != (temp_counter & ENET_DMA_CH_MISS_FRAME_CNT_MFCO)){
                flag = SET;
            } else {
            /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
            }
        } else {
            temp_counter = ENET_DMA_CH1_RXP_ACCEPT_CNT;
            if((uint32_t)RESET != (temp_counter & ENET_DMA_CH_RXP_ACCEPT_CNT_RXPACOF)){
                flag = SET;
            } else {
            /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
            }
        }
        break;
    default:
        break;
    }
    return flag;
}

/*!
    \brief      get the DMA slot number value
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] slot_num: the slot number value
    \retval     none
*/
uint16_t enet_dma_slot_value_get(enet_dmach_enum dmach)
{
    uint16_t slot_num = 0;

    switch(dmach) {
    case DMACH0:
            slot_num = (uint16_t)GET_REF_SLOT_NUMBER(ENET_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS);
        break;
    case DMACH1:
            slot_num = (uint16_t)GET_REF_SLOT_NUMBER(ENET_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS);
        break;
    default:
        break;
    }
    return slot_num;
}

/*!
    \brief      set the DMA slot check related value parameters
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  slot_interval: the slot interval value
    \param[out] none
    \retval     none
*/
void enet_dma_slot_interval_set(enet_dmach_enum dmach, uint16_t slot_interval)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_SLOT_INTERVAL_VALUE(slot_interval)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0047U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0:
            ENET_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS &= ~ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV;
            ENET_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS |= DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV(slot_interval);
        break;
    case DMACH1:
            ENET_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS &= ~ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV;
            ENET_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS |= DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV(slot_interval);
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the DMA slot check related fuction parameters
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  function: the related function
                one or more parameters can be selected which is shown as below
      \arg        ENET_DMA_ADVANCE_SLOT_CHECK: advance slot check function
      \arg        ENET_DMA_SLOT_COMPARISON: slot comparison function
    \param[in]  status: select whether the DMA slot check related fuction is enabled or disabled
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: enable
      \arg        DISABLE: disable
    \param[out] none
    \retval     none
*/
void enet_dma_slot_config(enet_dmach_enum dmach, uint32_t function, ControlStatus status)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_SLOT_FUNCTION(function)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0048U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0:
        if(ENABLE == status) {
            ENET_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS |= function;
        } else {
            ENET_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS &= ~function;
        }
        break;
    case DMACH1:
        if(ENABLE == status) {
            ENET_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS |= function;
        } else {
            ENET_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS &= ~function;
        }
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the watchdog timeout for receive interrupt from the DMA
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  count_uint: the value of watchdog timer count units
                only one parameter can be selected which is shown as below
      \arg        ENET_RX_INT_WATCHDOG_TIMER_COUNT_256: 256 system clock cycles corresponding to one unit in RWT field
      \arg        ENET_RX_INT_WATCHDOG_TIMER_COUNT_512: 512 system clock cycles corresponding to one unit in RWT field
      \arg        ENET_RX_INT_WATCHDOG_TIMER_COUNT_1024: 1024 system clock cycles corresponding to one unit in RWT field
      \arg        ENET_RX_INT_WATCHDOG_TIMER_COUNT_2048: 2048 system clock cycles corresponding to one unit in RWT field
    \param[in]  count_val: the value of watchdog timer count
                           0-0xFF
    \param[out] none
    \retval     none
*/
void enet_dma_rxinterrupt_watchdog_timer_set(enet_dmach_enum dmach, uint32_t count_uint, uint8_t count_val)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_WATCHDOG_TIMER_COUNT_UNIT(count_uint)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0049U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0:
            ENET_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER = count_uint | count_val;
        break;
    case DMACH1:
            ENET_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER = count_uint | count_val;
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the DMA alternate receive buffer size
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  size: the DMA alternate receive buffer size
                           0-0x3F8
    \param[out] none
    \retval     none
*/
void enet_rxbuf_alternate_size_set(enet_dmach_enum dmach, uint16_t size)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_ALTER_RXBUF_SIZE(size)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x004AU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0:
            ENET_DMA_CH0_RX_CONTROL2 &= ~ENET_DMA_CH_RX_CONTROL2_ARBS;
            ENET_DMA_CH0_RX_CONTROL2 |= DMA_CH_RX_CONTROL2_ARBS(size);
        break;
    case DMACH1:
            ENET_DMA_CH1_RX_CONTROL2 &= ~ENET_DMA_CH_RX_CONTROL2_ARBS;
            ENET_DMA_CH1_RX_CONTROL2 |= DMA_CH_RX_CONTROL2_ARBS(size);
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the algorithm for Tx scheduling
    \param[in]  SchedAlgo: Tx scheduling algorithm
                only one parameter can be selected which is shown as below
      \arg        STRICT_PRIORITY_TX: strict priority algorithm
      \arg        WEIGHTED_ROUND_ROBIN: WRR algorithmt
    \param[out] none
    \retval     none
*/
void enet_schedalg_set(enet_txqalgotype_enum SchedAlgo)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_TX_ALGO_TYPE(SchedAlgo)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x004BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_OPERATION_MODE &= ~ENET_MTL_OPERATION_MODE_SCHALG;
    ENET_MTL_OPERATION_MODE |= (uint32_t)SchedAlgo;
}
}

/*!
    \brief      set the weight for Tx queue
    \param[in]  enet_txq: transmit queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1
    \param[in]  weight: the weight for this queue
    \param[out] none
    \retval     none
*/
void enet_txq_weight_set(enet_txq_enum enet_txq, uint32_t weight)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_MTL_TXQ_WEIGHT(weight)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x004CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(enet_txq) {
    case TXQ0:
        ENET_MTL_TXQ0_QUANTUM_WEIGHT = weight;
        break;
    case TXQ1:
        ENET_MTL_TXQ1_QUANTUM_WEIGHT = weight;
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the weight for Rx queue
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  weight: the weight for this queue
    \param[out] none
    \retval     none
*/
void enet_rxq_weight_set(enet_rxq_enum enet_rxq, uint32_t weight)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_MTL_RXQ_WEIGHT(weight)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x004DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(enet_rxq) {
    case RXQ0:
        ENET_MTL_RXQ0_CONTROL &= ~ENET_MTL_RXQ0_CONTROL_RXQ_WEGT ;
        ENET_MTL_RXQ0_CONTROL |= weight & ENET_MTL_RXQ0_CONTROL_RXQ_WEGT;
        break;
    case RXQ1:
        ENET_MTL_RXQ1_CONTROL &= ~ENET_MTL_RXQ0_CONTROL_RXQ_WEGT ;
        ENET_MTL_RXQ1_CONTROL |= weight & ENET_MTL_RXQ0_CONTROL_RXQ_WEGT;
        break;
    default:
        break;
    }
}
}

/*!
    \brief      config the arbitration for Rx queue
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  status: enable or disable
      \arg        ENABLE: enable
      \arg        DISABLE: disable

    \param[out] none
    \retval     none
*/
void enet_rxq_packet_arbitration_config(enet_rxq_enum enet_rxq, ControlStatus status)
{

