sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    switch(enet_rxq) {
    case RXQ0:
        ENET_MTL_RXQ0_CONTROL &= ~ENET_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT;
        ENET_MTL_RXQ0_CONTROL |= MTL_RXQ_PACKET_ARBITRATION(status);
        break;
    case RXQ1:
        ENET_MTL_RXQ1_CONTROL &= ~ENET_MTL_RXQ1_CONTROL_RXQ_FRM_ARBIT;
        ENET_MTL_RXQ1_CONTROL |= MTL_RXQ_PACKET_ARBITRATION(status);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable dynamic mapping for Rx queue
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[out] none
    \retval     none
*/
void enet_dynamic_mapping_set(enet_rxq_enum enet_rxq)
{
    switch(enet_rxq) {
    case RXQ0:
        ENET_MTL_RXQ_DMA_MAP0 |= ENET_MTL_RXQ_DMA_MAP0_Q0DDMACH;
        break;
    case RXQ1:
        ENET_MTL_RXQ_DMA_MAP0 |= ENET_MTL_RXQ_DMA_MAP0_Q1DDMACH;
        break;
    default:
        break;
    }
}

/*!
    \brief      set the type, associated queue number and paket type
    \param[in]  reg_num: MAC_TMRQ_Regs selection
                only one parameter can be selected which is shown as below
      \arg        ENET_INDIR_ACCESS_MAC_TMRQ_REG0: MAC_TMRQ_Reg0
      \arg        ENET_INDIR_ACCESS_MAC_TMRQ_REG1: MAC_TMRQ_Reg1
      \arg        ENET_INDIR_ACCESS_MAC_TMRQ_REG2: MAC_TMRQ_Reg2
      \arg        ENET_INDIR_ACCESS_MAC_TMRQ_REG3: MAC_TMRQ_Reg3
      \arg        ENET_INDIR_ACCESS_MAC_TMRQ_REG4: MAC_TMRQ_Reg4
      \arg        ENET_INDIR_ACCESS_MAC_TMRQ_REG5: MAC_TMRQ_Reg5
      \arg        ENET_INDIR_ACCESS_MAC_TMRQ_REG6: MAC_TMRQ_Reg6
      \arg        ENET_INDIR_ACCESS_MAC_TMRQ_REG7: MAC_TMRQ_Reg7
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  typ_val: the type value of packet
    \param[in]  packet_type: packet type selection
                only one parameter can be selected which is shown as below
      \arg        PREEMPTION_PACKET: preemption packet
      \arg        EXPRESS_PACKET: express packet
    \param[out] none
    \retval     none
*/
ErrStatus enet_rxq_type_match_set(uint16_t reg_num, enet_rxq_enum enet_rxq, uint16_t typ_val, enet_packet_type_enum packet_type)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
    ErrStatus status = ERROR;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_MAC_TMRQ_REG_NUM(reg_num)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0050U), ERR_PARAM_INVALID);
    } else if(NOT_PACKET_TYPE(typ_val)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0050U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_INDIR_ACCESS_DATA &= ~ENET_MAC_INDIR_ACCESS_DATA_DATA;
    ENET_MAC_INDIR_ACCESS_DATA = MAC_TMRQ_REGS_TYP(typ_val) | MAC_TMRQ_REGS_TMRQ(enet_rxq) | MAC_TMRQ_REGS_PFEX(packet_type);
    
    ENET_MAC_INDIR_ACCESS_CTRL &= ~(ENET_MAC_INDIR_ACCESS_CTRL_COM | ENET_MAC_INDIR_ACCESS_CTRL_MSEL | ENET_MAC_INDIR_ACCESS_CTRL_AOFF | ENET_MAC_INDIR_ACCESS_CTRL_AUTO);
    ENET_MAC_INDIR_ACCESS_CTRL = MAC_INDIR_ACCESS_CTRL_MSEL(0) | reg_num | ENET_MAC_INDIR_ACCESS_CTRL_OB;
    
    while(((uint32_t)RESET != (ENET_MAC_INDIR_ACCESS_CTRL & ENET_MAC_INDIR_ACCESS_CTRL_OB))&& (0U < timeout)) {
        timeout --;
    }
    if((uint32_t)RESET == (ENET_MAC_INDIR_ACCESS_CTRL & ENET_MAC_INDIR_ACCESS_CTRL_OB)){
        status = SUCCESS;
    } else {
        status = ERROR;
    }
}
    return status;
}

/*!
    \brief      set the credit value for Tx queue 1
    \param[in]  creditval: pointer to a enet_cbs_config_struct structure which contains
                parameters of MTL credit related config
                members of the structure and the member values are shown as below:
                  IdleSlopeCredit: the idleSlopeCredit value required for the credit-based shaper algorithm for Queue 1
                  SendSlopeCredit: the SendSlopeCredit value required for the credit-based shaper algorithm for Queue 1
                  HiCredit: the HiCredit value required for the credit-based shaper algorithm for Queue 1
                  loCredit: the loCredit value required for the credit-based shaper algorithm for Queue 1
    \param[out] none
    \retval     none
*/
void enet_txq1_credit_set(enet_cbs_config_struct creditval)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_IDLE_SLOPE_CREDIT(creditval.IdleSlopeCredit)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0051U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ENET_SEND_SLOPE_CREDIT(creditval.SendSlopeCredit)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0051U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ENET_HIGH_SLOPE_CREDIT(creditval.HiCredit)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0051U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ENET_LOW_SLOPE_CREDIT(creditval.loCredit)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0051U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_TXQ1_QUANTUM_WEIGHT = (uint32_t)creditval.IdleSlopeCredit;
    ENET_MTL_TXQ1_SENDSLOPECREDIT = (uint32_t)creditval.SendSlopeCredit;
    ENET_MTL_TXQ1_HICREDIT        = (uint32_t)creditval.HiCredit;
    ENET_MTL_TXQ1_LOCREDIT        = (uint32_t)creditval.loCredit;
}
}

/*!
    \brief      set the mode and size for Tx queue
    \param[in]  enet_txq: transmit queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1
    \param[in]  queuemode: the mode of transmit queue
                only one parameter can be selected which is shown as below
      \arg        QUE_OP_MODE_DISABLE: the transmit queues are disabled
      \arg        QUE_OP_MODE_AVB_ENABLE: the transmit queues are enabled in AV mode
      \arg        QUE_OP_MODE_ENABLE: the transmit queues are enabled
    \param[in]  queuesize: the size of the allocated transmit queues
      \arg        ENET_TXQ_SIZE_256BYTES: the size of the queue is 256 bytes
      \arg        ENET_TXQ_SIZE_512BYTES: the size of the queue is 512 bytes
      \arg        ENET_TXQ_SIZE_768BYTES: the size of the queue is 768 bytes
      \arg        ENET_TXQ_SIZE_1024BYTES: the size of the queue is 1024 bytes
      \arg        ENET_TXQ_SIZE_1280BYTES: the size of the queue is 1280 bytes
      \arg        ENET_TXQ_SIZE_1536BYTES: the size of the queue is 1536 bytes
      \arg        ENET_TXQ_SIZE_1792BYTES: the size of the queue is 1792 bytes
      \arg        ENET_TXQ_SIZE_2048BYTES: the size of the queue is 2048 bytes
      \arg        ENET_TXQ_SIZE_2304BYTES: the size of the queue is 2304 bytes
      \arg        ENET_TXQ_SIZE_2560BYTES: the size of the queue is 2560 bytes
      \arg        ENET_TXQ_SIZE_2816BYTES: the size of the queue is 2816 bytes
      \arg        ENET_TXQ_SIZE_3072BYTES: the size of the queue is 3072 bytes
      \arg        ENET_TXQ_SIZE_3328BYTES: the size of the queue is 3328 bytes
      \arg        ENET_TXQ_SIZE_3584BYTES: the size of the queue is 3584 bytes
      \arg        ENET_TXQ_SIZE_3840BYTES: the size of the queue is 3840 bytes
      \arg        ENET_TXQ_SIZE_4096BYTES: the size of the queue is 4096 bytes
      \arg        ENET_TXQ_SIZE_4352BYTES: the size of the queue is 4352 bytes
      \arg        ENET_TXQ_SIZE_4608BYTES: the size of the queue is 4608 bytes
      \arg        ENET_TXQ_SIZE_4864BYTES: the size of the queue is 4864 bytes
      \arg        ENET_TXQ_SIZE_5120BYTES: the size of the queue is 5120 bytes
      \arg        ENET_TXQ_SIZE_5376BYTES: the size of the queue is 5376 bytes
      \arg        ENET_TXQ_SIZE_5632BYTES: the size of the queue is 5632 bytes
      \arg        ENET_TXQ_SIZE_5888BYTES: the size of the queue is 5888 bytes
      \arg        ENET_TXQ_SIZE_6144BYTES: the size of the queue is 6144 bytes
      \arg        ENET_TXQ_SIZE_6400BYTES: the size of the queue is 6400 bytes
      \arg        ENET_TXQ_SIZE_6656BYTES: the size of the queue is 6656 bytes
      \arg        ENET_TXQ_SIZE_6912BYTES: the size of the queue is 6912 bytes
      \arg        ENET_TXQ_SIZE_7168BYTES: the size of the queue is 7168 bytes
      \arg        ENET_TXQ_SIZE_7424BYTES: the size of the queue is 7424 bytes
      \arg        ENET_TXQ_SIZE_7680BYTES: the size of the queue is 7680 bytes
      \arg        ENET_TXQ_SIZE_7936BYTES: the size of the queue is 7936 bytes
      \arg        ENET_TXQ_SIZE_8192BYTES: the size of the queue is 8192 bytes
    \param[out] none
    \retval     none
*/
void enet_txq_mode_size_set(enet_txq_enum enet_txq, enet_queopmode_enum queuemode,
                            uint32_t queuesize)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_TXQ_SIZE(queuesize)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0052U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(enet_txq) {
    case TXQ0:
        ENET_MTL_TXQ0_OPERATION_MODE &= ~(ENET_MTL_TXQ0_OPERATION_MODE_TXQEN | ENET_MTL_TXQ0_OPERATION_MODE_TQS);
        ENET_MTL_TXQ0_OPERATION_MODE |= MTL_TXQ_OPERATION_MODE_TXQEN((uint32_t)queuemode) | queuesize;
        break;
    case TXQ1:
        ENET_MTL_TXQ1_OPERATION_MODE &= ~(ENET_MTL_TXQ1_OPERATION_MODE_TXQEN | ENET_MTL_TXQ1_OPERATION_MODE_TQS);
        ENET_MTL_TXQ1_OPERATION_MODE |= MTL_TXQ_OPERATION_MODE_TXQEN((uint32_t)queuemode) | queuesize;
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the size for Rx queue
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  queuesize: the size of the allocated receive queues
      \arg        ENET_RXQ_SIZE_256BYTES: the size of the queue is 256 bytes
      \arg        ENET_RXQ_SIZE_512BYTES: the size of the queue is 512 bytes
      \arg        ENET_RXQ_SIZE_768BYTES: the size of the queue is 768 bytes
      \arg        ENET_RXQ_SIZE_1024BYTES: the size of the queue is 1024 bytes
      \arg        ENET_RXQ_SIZE_1280BYTES: the size of the queue is 1280 bytes
      \arg        ENET_RXQ_SIZE_1536BYTES: the size of the queue is 1536 bytes
      \arg        ENET_RXQ_SIZE_1792BYTES: the size of the queue is 1792 bytes
      \arg        ENET_RXQ_SIZE_2048BYTES: the size of the queue is 2048 bytes
      \arg        ENET_RXQ_SIZE_2304BYTES: the size of the queue is 2304 bytes
      \arg        ENET_RXQ_SIZE_2560BYTES: the size of the queue is 2560 bytes
      \arg        ENET_RXQ_SIZE_2816BYTES: the size of the queue is 2816 bytes
      \arg        ENET_RXQ_SIZE_3072BYTES: the size of the queue is 3072 bytes
      \arg        ENET_RXQ_SIZE_3328BYTES: the size of the queue is 3328 bytes
      \arg        ENET_RXQ_SIZE_3584BYTES: the size of the queue is 3584 bytes
      \arg        ENET_RXQ_SIZE_3840BYTES: the size of the queue is 3840 bytes
      \arg        ENET_RXQ_SIZE_4096BYTES: the size of the queue is 4096 bytes
      \arg        ENET_RXQ_SIZE_4352BYTES: the size of the queue is 4352 bytes
      \arg        ENET_RXQ_SIZE_4608BYTES: the size of the queue is 4608 bytes
      \arg        ENET_RXQ_SIZE_4864BYTES: the size of the queue is 4864 bytes
      \arg        ENET_RXQ_SIZE_5120BYTES: the size of the queue is 5120 bytes
      \arg        ENET_RXQ_SIZE_5376BYTES: the size of the queue is 5376 bytes
      \arg        ENET_RXQ_SIZE_5632BYTES: the size of the queue is 5632 bytes
      \arg        ENET_RXQ_SIZE_5888BYTES: the size of the queue is 5888 bytes
      \arg        ENET_RXQ_SIZE_6144BYTES: the size of the queue is 6144 bytes
      \arg        ENET_RXQ_SIZE_6400BYTES: the size of the queue is 6400 bytes
      \arg        ENET_RXQ_SIZE_6656BYTES: the size of the queue is 6656 bytes
      \arg        ENET_RXQ_SIZE_6912BYTES: the size of the queue is 6912 bytes
      \arg        ENET_RXQ_SIZE_7168BYTES: the size of the queue is 7168 bytes
      \arg        ENET_RXQ_SIZE_7424BYTES: the size of the queue is 7424 bytes
      \arg        ENET_RXQ_SIZE_7680BYTES: the size of the queue is 7680 bytes
      \arg        ENET_RXQ_SIZE_7936BYTES: the size of the queue is 7936 bytes
      \arg        ENET_RXQ_SIZE_8192BYTES: the size of the queue is 8192 bytes
    \param[out] none
    \retval     none
*/
void enet_rxq_size_set(enet_rxq_enum enet_rxq, uint32_t queuesize)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_RXQ_SIZE(queuesize)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0053U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{

