sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    switch(enet_rxq) {
    case RXQ0:
        ENET_MTL_RXQ0_OPERATION_MODE &= ~ENET_MTL_RXQ0_OPERATION_MODE_RQS;
        ENET_MTL_RXQ0_OPERATION_MODE |= queuesize ;
        break;
    case RXQ1:
        ENET_MTL_RXQ1_OPERATION_MODE &= ~ENET_MTL_RXQ1_OPERATION_MODE_RQS;
        ENET_MTL_RXQ1_OPERATION_MODE |= queuesize ;
        break;
    default:
        break;
    }
}
}

/*!
    \brief      select the Rx dma channel for Rx queue
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_rxq_dma_select(enet_rxq_enum enet_rxq, enet_dmach_enum dmach)
{

    switch(enet_rxq) {
    case RXQ0:
        ENET_MTL_RXQ_DMA_MAP0 &= ~ENET_MTL_RXQ_DMA_MAP0_Q0MDMACH;
        ENET_MTL_RXQ_DMA_MAP0 |= (uint32_t)dmach ;
        break;
    case RXQ1:
        ENET_MTL_RXQ_DMA_MAP0 &= ~ENET_MTL_RXQ_DMA_MAP0_Q1MDMACH;
        ENET_MTL_RXQ_DMA_MAP0 |= (uint32_t)((uint32_t)dmach << 8U);
        break;
    default:
        break;
    }
}

/*!
    \brief      set the base time of GCL
    \param[in]  second: the second of BTR time
    \param[in]  nanosecond: the nanosecond of BTR time
    \param[out] none
    \retval     none
*/
void enet_est_gcl_basetime_set(uint32_t second, uint32_t nanosecond)
{
    uint32_t stimeout, nstimeout;
    stimeout = ENET_OPERATION_TIMEROUT, nstimeout = ENET_OPERATION_TIMEROUT;

    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_R1W0;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_DATA = (uint32_t)(nanosecond & ENET_MTL_EST_GCL_DATA_GCD);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_BTR_LOW;
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO))&& (0U < stimeout)) {
        stimeout --;
    }

    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_DATA = (uint32_t)(second & ENET_MTL_EST_GCL_DATA_GCD);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_BTR_HIGH;
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < nstimeout)) {
        nstimeout --;
    }
}

/*!
    \brief      get the base time of GCL
    \param[in]  none
    \param[out] time_struct: pointer to a enet_ESTConfig_struct structure which contains
                parameters of GCL
                members of the structure and the member values are shown as below:
                  BTRinnanosecond: 0x0 - 0xFFFF FFFF
                  BTRinsecond: 0x0 - 0xFFFF FFFF
    \retval     none
*/
void enet_est_gcl_basetime_get(enet_ESTConfig_struct *time_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(time_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0056U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    uint32_t stimeout = ENET_OPERATION_TIMEROUT, nstimeout = ENET_OPERATION_TIMEROUT;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_CONTROL |= (ENET_GCL_BTR_LOW | ENET_MTL_EST_GCL_CONTROL_R1W0);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < nstimeout)) {
        nstimeout --;
    }
    time_struct->BTRinnanosecond = (uint32_t)(ENET_MTL_EST_GCL_DATA & ENET_MTL_EST_GCL_DATA_GCD);


    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_CONTROL |= (ENET_GCL_BTR_HIGH | ENET_MTL_EST_GCL_CONTROL_R1W0);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < stimeout)) {
        stimeout --;
    }
    time_struct->BTRinsecond = (uint32_t)(ENET_MTL_EST_GCL_DATA & ENET_MTL_EST_GCL_DATA_GCD);
}
}

/*!
    \brief      set the cycle time of GCL
    \param[in]  second: the second of CTR time
    \param[in]  nanosecond: the nanosecond of CTR time
    \param[out] none
    \retval     none
*/
void enet_est_gcl_cycletime_set(uint8_t second, uint32_t nanosecond)
{
    uint32_t stimeout = ENET_OPERATION_TIMEROUT, nstimeout = ENET_OPERATION_TIMEROUT;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_R1W0;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_DATA = (uint32_t)(nanosecond & ENET_MTL_EST_GCL_DATA_GCD);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_CTR_LOW;
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < nstimeout)) {
        nstimeout --;
    }

    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_DATA = (uint8_t)(second & ENET_MTL_EST_GCL_DATA_GCD);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_CTR_HIGH;
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < stimeout)) {
        stimeout --;
    }
}

/*!
    \brief      get the cycle time of GCL
    \param[in]  none
    \param[out] time_struct: pointer to a enet_ESTConfig_struct structure which contains
                parameters of GCL
                members of the structure and the member values are shown as below:
                  CTRinnanosecond: 0x0 - 0xFFFF FFFF
                  CTRinsecond: 0x0 - 0xFFFF FFFF
    \retval     none
*/
void enet_est_gcl_cycletime_get(enet_ESTConfig_struct *time_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(time_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0058U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    uint32_t stimeout = ENET_OPERATION_TIMEROUT, nstimeout = ENET_OPERATION_TIMEROUT;

    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_CONTROL |= (ENET_GCL_CTR_LOW | ENET_MTL_EST_GCL_CONTROL_R1W0);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < nstimeout)) {
        nstimeout --;
    }
    time_struct->CTRinnanosecond = (uint32_t)(ENET_MTL_EST_GCL_DATA & ENET_MTL_EST_GCL_DATA_GCD);


    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_CONTROL |= (ENET_GCL_CTR_HIGH | ENET_MTL_EST_GCL_CONTROL_R1W0);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < stimeout)) {
        stimeout --;
    }
    time_struct->CTRinsecond = (uint32_t)(ENET_MTL_EST_GCL_DATA & ENET_MTL_EST_GCL_DATA_GCD);
}
}

/*!
    \brief      set the extension time of GCL
    \param[in]  second: the second of TER time
    \param[in]  nanosecond: the nanosecond of TER time
    \param[out] none
    \retval     none
*/
void enet_est_gcl_extensiontime_set(uint32_t nanosecond)
{
     uint32_t timeout = ENET_OPERATION_TIMEROUT;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TER_REG_VAL(nanosecond)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0059U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_R1W0;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_DATA = (uint32_t)(nanosecond & BITS(0, 30));
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_TER;
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < timeout)) {
        timeout --;
    }
}
}

/*!
    \brief      get the extension time of GCL
    \param[in]  none
    \param[out] time_struct: pointer to a enet_ESTConfig_struct structure which contains
                parameters of GCL
                members of the structure and the member values are shown as below:
                  TERtime: 0x0 - 0x3FFF FFFF
    \retval     none
*/
void enet_est_gcl_extensiontime_get(enet_ESTConfig_struct *time_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(time_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x005AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_CONTROL |= (ENET_GCL_TER | ENET_MTL_EST_GCL_CONTROL_R1W0);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < timeout)) {
        timeout --;
    }
    time_struct->TERtime = (uint32_t)(ENET_MTL_EST_GCL_DATA & BITS(0, 30));

