sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
}
}

/*!
    \brief      set the length of GCL
    \param[in]  length: the gcl length
    \param[out] none
    \retval     none
*/
void enet_est_gcl_length_set(uint32_t length)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_GCL_LENGTH(length)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x005BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_R1W0;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_DATA = (uint32_t)(length & BITS(0, 7));
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_LLR;
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < timeout)) {
        timeout --;
    }
}
}

/*!
    \brief      get the length of GCL
    \param[in]  none
    \param[out] time_struct: pointer to a enet_ESTConfig_struct structure which contains
                parameters of GCL
                members of the structure and the member values are shown as below:
                  LLRdepth: 0x0 - 0xFF
    \retval     none
*/
void enet_est_gcl_length_get(enet_ESTConfig_struct *time_struct)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(time_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x005CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_CONTROL |= (ENET_GCL_LLR | ENET_MTL_EST_GCL_CONTROL_R1W0);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < timeout)) {
        timeout --;
    }
    time_struct->LLRdepth = (uint16_t)(ENET_MTL_EST_GCL_DATA & BITS(0, 7));
}
}

/*!
    \brief      set the related parameter of GCL
    \param[in]  addr: the gcl address
    \param[in]  gcl_struct: pointer to a enet_GCLConfig_struct structure which contains
                parameters of GCL
                members of the structure and the member values are shown as below:
                  Ctrlconfig: 0x0 - 0x3
                  Ethtimeinterval: 0x0 - 0xFF FFFF
    \param[out] none
    \retval     none
*/
void enet_est_gcl_para_set(uint8_t addr, enet_GCLConfig_struct *gcl_struct)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(gcl_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x005DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_R1W0;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_GCRR;
    ENET_MTL_EST_GCL_DATA = (uint32_t)(((uint32_t)(gcl_struct->Ctrlconfig) << GCL_GATE_CONTROL_OFFSET) | gcl_struct->Ethtimeinterval);
    ENET_MTL_EST_GCL_CONTROL |= MTL_EST_GCL_CONTROL_ADDR(addr);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < timeout)) {
        timeout --;
    }
}
}

/*!
    \brief      get the related parameter of GCL
    \param[in]  addr: the gcl address
    \param[out] gcl_struct: pointer to a enet_GCLConfig_struct structure which contains
                parameters of GCL
                members of the structure and the member values are shown as below:
                  Ctrlconfig: 0x0 - 0x3
                  Ethtimeinterval: 0x0 - 0xFF FFFF
    \retval     none
*/
void enet_est_gcl_para_get(uint8_t addr, enet_GCLConfig_struct *gcl_struct)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(gcl_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x005EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_ADDR;
    ENET_MTL_EST_GCL_CONTROL &= ~ENET_MTL_EST_GCL_CONTROL_GCRR;
    ENET_MTL_EST_GCL_CONTROL |= (MTL_EST_GCL_CONTROL_ADDR(addr) | ENET_MTL_EST_GCL_CONTROL_R1W0);
    ENET_MTL_EST_GCL_CONTROL |= ENET_GCL_READ_WRITE_START;
    while(((uint32_t)RESET != (ENET_MTL_EST_GCL_CONTROL & ENET_MTL_EST_GCL_CONTROL_SRWO)) && (0U < timeout)) {
        timeout --;
    }
    gcl_struct->Ctrlconfig = (uint8_t)((ENET_MTL_EST_GCL_DATA & BITS(24, 25)) >> GCL_GATE_CONTROL_OFFSET);
    gcl_struct->Ethtimeinterval = (uint32_t)(ENET_MTL_EST_GCL_DATA & BITS(0, 19));
}
}

/*!
    \brief      enable switching to S/W owned list
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_est_gcl_switch_enable(void)
{
    ENET_MTL_EST_CONTROL |= (uint32_t)(ENET_MTL_EST_CONTROL_EEST | ENET_MTL_EST_CONTROL_SSWL);
}

/*!
    \brief      get the S/W owned list
    \param[in]  none
    \param[out] none
    \retval     enet_gcl_enum: GCL_LIST0 or GCL_LIST1
*/
enet_gcl_enum enet_gcl_softwore_list_get(void)
{
    enet_gcl_enum list_num;
    if((uint32_t)RESET != (ENET_MTL_EST_STATUS & ENET_MTL_EST_STATUS_SWOL))
    {
       list_num = GCL_LIST1;
    } else {
       list_num = GCL_LIST0;
    }
    return list_num;
}

/*!
    \brief      get the current gcl slot number
    \param[in]  none
    \param[out] none
    \retval     slot_num: the current gcl slot number
*/
uint8_t enet_gcl_current_slot_get(void)
{
    uint8_t slot_num;
    slot_num = (uint8_t)GET_CURRENT_GCL_NUM(ENET_MTL_EST_STATUS);
    return slot_num;
}

/*!
    \brief      get the BTR error loop count
    \param[in]  none
    \param[out] none
    \retval     err_cnt: the BTR error loop count
*/
uint8_t enet_btr_error_loop_get(void)
{
    uint8_t err_cnt;
    err_cnt = (uint8_t)GET_BTR_ERROR_LOOP_COUNT(ENET_MTL_EST_STATUS);
    return err_cnt;
}

/*!
    \brief      clear the queue number that have experienced error
    \param[in]  err: experienced error selection
                only one parameter can be selected which is shown as below
      \arg        SCHEDULE_ERROR: schedule error
      \arg        FRAME_SIZE_ERROR: frame size error
    \param[in]  enet_txq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1
    \param[out] none
    \retval     none
*/
void enet_est_error_queue_clear(enet_est_error_enum err, enet_txq_enum enet_txq)
{

