sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    switch(err) {
    case SCHEDULE_ERROR:
        if(TXQ0 == enet_txq)
        {
            ENET_MTL_EST_SCH_ERROR &= ~ENET_MTL_EST_SCH_ERROR_SEQN;
            ENET_MTL_EST_SCH_ERROR |= ENET_EST_SCHEDULE_ERR_Q0;
        } else {
            ENET_MTL_EST_SCH_ERROR &= ~ENET_MTL_EST_SCH_ERROR_SEQN;
            ENET_MTL_EST_SCH_ERROR |= ENET_EST_SCHEDULE_ERR_Q1;
        }
        break;
    case FRAME_SIZE_ERROR:
        if(TXQ0 == enet_txq)
        {
            ENET_MTL_EST_FRM_SIZE_ERROR &= ~ENET_MTL_EST_FRM_SIZE_ERROR_FEQN;
            ENET_MTL_EST_FRM_SIZE_ERROR |= ENET_EST_FRAME_SIZE_ERR_Q0;
        } else {
            ENET_MTL_EST_FRM_SIZE_ERROR &= ~ENET_MTL_EST_FRM_SIZE_ERROR_FEQN;
            ENET_MTL_EST_FRM_SIZE_ERROR |= ENET_EST_FRAME_SIZE_ERR_Q1;
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      check whether the queue experienced an error
    \param[in]  err: experienced error selection
                only one parameter can be selected which is shown as below
      \arg        SCHEDULE_ERROR: schedule error
      \arg        FRAME_SIZE_ERROR: frame size error
    \param[in]  enet_txq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1
    \param[out] none
    \retval     FlagStatus: RESET / SET
*/
FlagStatus enet_est_error_queue_satus_get(enet_est_error_enum err, enet_txq_enum enet_txq)
{
    FlagStatus status = RESET;

    switch(err) {
    case SCHEDULE_ERROR:
        if(TXQ0 == enet_txq)
        {
            if((uint32_t)RESET !=(ENET_MTL_EST_SCH_ERROR & ENET_EST_SCHEDULE_ERR_Q0)) {
                status = SET;
            } else {
                status = RESET;
            }
        } else {
            if((uint32_t)RESET !=(ENET_MTL_EST_SCH_ERROR & ENET_EST_SCHEDULE_ERR_Q1)) {
                status = SET;
            } else {
                status = RESET;
            }
        }
        break;
    case FRAME_SIZE_ERROR:
        if(TXQ0 == enet_txq)
        {
            if((uint32_t)RESET !=(ENET_MTL_EST_FRM_SIZE_ERROR & ENET_EST_FRAME_SIZE_ERR_Q0)) {
                status = SET;
            } else {
                status = RESET;
            }
        } else {
            if((uint32_t)RESET !=(ENET_MTL_EST_FRM_SIZE_ERROR & ENET_EST_FRAME_SIZE_ERR_Q1)) {
                status = SET;
            } else {
                status = RESET;
            }
        }
        break;
    default:
        break;
    }
    return status;
}

/*!
    \brief      get the first queue number experience HLBF error
    \param[in]  none
    \param[out] none
    \retval     enet_txq: TXQ0 / TXQ1
*/
enet_txq_enum enet_est_first_error_queue_get(void)
{
    enet_txq_enum  enet_txq;
    if((uint32_t)RESET == (ENET_MTL_EST_FRM_SIZE_CAPTURE & ENET_MTL_EST_FRM_SIZE_CAPTURE_HBFQ)) {
        enet_txq = TXQ0;
    } else {
        enet_txq = TXQ1;
    }
    return enet_txq;
}

/*!
    \brief      get the frame size of the first queue which experience HLBF error
    \param[in]  none
    \param[out] none
    \retval     size: the frame size
*/
uint16_t enet_est_error_framesize_get(void)
{
    uint16_t size;
    size = (uint16_t)GET_HLBF_FRAME_SIZE(ENET_MTL_EST_FRM_SIZE_CAPTURE);
    return size;
}

/*!
    \brief      config FPE related parameter
    \param[in]  fpe_struct: pointer to a enet_FPEConfig_struct structure which contains
                parameters of FPE
                members of the structure and the member values are shown as below:
                  FPEenable: 0x0 - 0x1
                  Holdtime: 0x0 - 0xFFFF
                  Holdtime: 0x0 - 0xFFFF
    \param[out] none
    \retval     none
*/
void enet_fpe_advance_time_set(enet_FPEConfig_struct *fpe_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(fpe_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0067U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_FPE_CTRL_STS &= ~ENET_MAC_FPE_CTRL_STS_EFPE;
    ENET_MAC_FPE_CTRL_STS |= (uint32_t)fpe_struct->FPEenable;
    ENET_MTL_FPE_ADVANCE = (uint32_t)(MTL_HOLD_ADVANCE(fpe_struct->Holdtime) | MTL_RELEASE_ADVANCE(fpe_struct->Relasetime));
}
}

/*!
    \brief      get FPE related parameter
    \param[in]  none
    \param[out] fpe_struct: pointer to a enet_FPEConfig_struct structure which contains
                parameters of GCL
                members of the structure and the member values are shown as below:
                  FPEenable: 0x0 - 0x1
                  Holdtime: 0x0 - 0xFFFF
                  Holdtime: 0x0 - 0xFFFF
    \retval     none
*/
void enet_fpe_advance_time_get(enet_FPEConfig_struct *fpe_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(fpe_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0068U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if((uint32_t)RESET != (ENET_MAC_FPE_CTRL_STS & ENET_MAC_FPE_CTRL_STS_EFPE)){
        fpe_struct->FPEenable = ENABLE;
    } else {
        fpe_struct->FPEenable = DISABLE;
    }
    fpe_struct->Holdtime = (uint16_t)GET_HOLD_ADVANCE(ENET_MTL_FPE_ADVANCE);
    fpe_struct->Relasetime = GET_RELEASE_ADVANCE(ENET_MTL_FPE_ADVANCE);
}
}

/*!
    \brief      set the launch expiry time
    \param[in]  mode: the launch expiry time mode
                only one parameter can be selected which is shown as below
      \arg        ENET_TBS_NORMAL_ABSOLUTE_MODE: the launch time value used in time based scheduling is interpreted as an EST offset value
      \arg        ENET_TBS_EST_OFFSET_MODE: the launch time value is used as an absolute value
    \param[in]  offset: the launch expiry offset
    \param[in]  gsn_offset: the launch expiry gsn offset
    \param[out] none
    \retval     none
*/
void enet_launch_expiry_time_set(uint32_t mode, uint32_t offset, uint32_t gsn_offset)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_TBS_MODE(mode)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0069U), ERR_PARAM_INVALID);
    } else if(NOT_LAUNCH_EXPIRY_OFFSET(offset)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0069U), ERR_PARAM_INVALID);
    } else if(NOT_LAUNCH_EXPIRY_GSN_OFFSET(gsn_offset)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0067U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if(ENET_TBS_NORMAL_ABSOLUTE_MODE == mode) {
        ENET_MTL_TBS_CTRL &= ~(ENET_MTL_TBS_CTRL_ESTM | ENET_MTL_TBS_CTRL_LEOS);
        ENET_MTL_TBS_CTRL |= MTL_TBS_CTRL_LEOS(offset);
    } else {
        ENET_MTL_TBS_CTRL &= ~(ENET_MTL_TBS_CTRL_ESTM | ENET_MTL_TBS_CTRL_LEOS | ENET_MTL_TBS_CTRL_LEOV | ENET_MTL_TBS_CTRL_LEGOS);
        ENET_MTL_TBS_CTRL |= ENET_MTL_TBS_CTRL_ESTM | ENET_MTL_TBS_CTRL_LEOV;
        ENET_MTL_TBS_CTRL |= MTL_TBS_CTRL_LEOS(offset)| MTL_TBS_CTRL_LEGOS(gsn_offset);
    }
}
}

/*!
    \brief      set the fetch time
    \param[in]  mode: the fetch time mode
                only one parameter can be selected which is shown as below
      \arg        ENET_TBS_NORMAL_ABSOLUTE_MODE: the launch time value used in time based scheduling is interpreted as an EST offset value
      \arg        ENET_TBS_EST_OFFSET_MODE: the launch time value is used as an absolute value
    \param[in]  offset: the fetch offset
    \param[in]  gsn_offset: the fetch gsn offset
    \param[out] none
    \retval     none
*/
void enet_fetch_time_set(uint32_t mode, uint32_t offset, uint32_t gsn_offset)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_TBS_MODE(mode)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x006AU), ERR_PARAM_INVALID);
    } else if(NOT_FETCH_OFFSET(offset)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x006AU), ERR_PARAM_INVALID);
    } else if(NOT_FETCH_GSN_OFFSET(gsn_offset)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x006AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if(ENET_TBS_NORMAL_ABSOLUTE_MODE == mode) {
        ENET_MTL_TBS_CTRL &= ~ENET_MTL_TBS_CTRL_ESTM;
        ENET_DMA_TBS_CTRL0 &= ~ENET_DMA_TBS_CTRL0_FTOS;
        ENET_DMA_TBS_CTRL0 |= DMA_TBS_CTRL0_FTOS(offset) | ENET_DMA_TBS_CTRL0_FTOV;
    } else {
        ENET_DMA_TBS_CTRL0 &= ~(ENET_DMA_TBS_CTRL0_FTOV | ENET_DMA_TBS_CTRL0_FTOS | ENET_DMA_TBS_CTRL0_FGOS);
        ENET_MTL_TBS_CTRL |= ENET_MTL_TBS_CTRL_ESTM;
        ENET_DMA_TBS_CTRL0 |= DMA_TBS_CTRL0_FTOS(offset)| DMA_TBS_CTRL0_FGOS(gsn_offset) | ENET_DMA_TBS_CTRL0_FTOV;
    }
}
}

/*!
    \brief    get the transmit queue debug state
    \param[in]  enet_txq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1
    \param[in]  state: choose the state of transmit queue debug which users want to check, refer to enet_mtl_txq_state_enum
                only one parameter can be selected which is shown as below
      \arg            TXQ_FIFO_FULL_STATE: MTL Tx status FIFO full status
      \arg            TXQ_NOT_EMPTY_STATE: MTL Tx queue not empty status
      \arg            TXQ_WRITE_CONTROLLER_STATE: MTL Tx queue write controller status
      \arg            TXQ_READ_CONTROLLER_STATE: MTL Tx queue read controller status
      \arg            TXQ_IN_PAUSE_STATE: transmit queue in pause
    \param[out] none
    \retval     transmit queue debug state, the value range shows below:
                  ENET_TXQ_STATUS_FIFO_FULL_DETECT, ENET_TXQ_STATUS_FIFO_FULL_NOT_DETECT,
                  ENET_TXQ_STATUS_FIFO_NOT_EMPTY_DETECT, ENET_TXQ_STATUS_FIFO_NOT_EMPTY_NOT_DETECT,
                  ENET_TXQ_WRITE_CONTROL_DETECT, ENET_TXQ_STATUS_FIFO_NOT_EMPTY_NOT_DETECT,
                  ENET_TXQ_READ_CONTROLLER_STATE_IDLE, ENET_TXQ_READ_CONTROLLER_STATE_READ,ENET_TXQ_READ_CONTROLLER_STATE_WAITING,ENET_TXQ_READ_CONTROLLER_STATE_FLUSHING,
                  ENET_TXQ_IN_PAUSE_DETECT, ENET_TXQ_IN_PAUSE_NOT_DETECT
*/
uint32_t enet_txq_debug_state_get(enet_txq_enum enet_txq, enet_mtl_txq_state_enum state)
{
    uint32_t reval;
    reval = 0U;

     switch(enet_txq) {
    case TXQ0:
    reval = (uint32_t)(ENET_MTL_TXQ0_DEBUG & (uint32_t)state);
        break;
    case TXQ1:
    reval = (uint32_t)(ENET_MTL_TXQ1_DEBUG & (uint32_t)state);
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief     get the count of transmit queue packets
    \param[in]  enet_txq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1

    \param[out] none
    \retval     reval: the number of transmit queue packets
*/
uint32_t enet_txq_packet_count_get(enet_txq_enum enet_txq)
{
    uint32_t reval;
    reval = 0;

    switch(enet_txq) {
    case TXQ0:
    reval = (uint32_t)GET_TXQ_PACKETS_NUMBER(ENET_MTL_TXQ0_DEBUG);
        break;
    case TXQ1:
    reval = (uint32_t)GET_TXQ_PACKETS_NUMBER(ENET_MTL_TXQ1_DEBUG);
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief     get the number of transmit queue status word
    \param[in]  enet_txq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1

    \param[out] none
    \retval     reval: the number of transmit queue status word
*/
uint32_t enet_txq_status_word_num_get(enet_txq_enum enet_txq)
{
    uint32_t reval;
    reval = 0U;

    switch(enet_txq) {
    case TXQ0:
    reval = (uint32_t)GET_TXQ_STATUS_WORD_NUMBER(ENET_MTL_TXQ0_DEBUG);
        break;
    case TXQ1:
    reval = (uint32_t)GET_TXQ_STATUS_WORD_NUMBER(ENET_MTL_TXQ1_DEBUG);
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief    get the receive queue debug state
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1
    \param[in]  state: choose the state of receive queue debug which users want to check, refer to enet_mtl_rxq_state_enum
                only one parameter can be selected which is shown as below
      \arg            RXQ_FILL_LEVEL_STATE: MTL Rx queue fill-level status
      \arg            RXQ_READ_CONTROLLER_STATE: MTL Rx queue read controller state
      \arg            RXQ_WRITE_CONTROLLER_STATE: MTL Rx queue write controller active status
    \param[out] none
    \retval     state of receive queue debug, the value range shows below:
                  ENET_RXQ_EMPTY, ENET_RXQ_FILL_BELOW_DEACTIVATE_THRESHOLD, ENET_RXQ_FILL_ABOVE_ACTIVATE_THRESHOLD, ENET_RXQ_FULL,
                  ENET_RXQ_READ_CONTROLLER_IDLE, ENET_RXQ_READ_CONTROLLER_READING_DATA, ENET_RXQ_READ_CONTROLLER_READING_STATUS,ENET_RXQ_READ_CONTROLLER_FLUSHING,
                  ENET_RXQ_WRITE_CONTROLLER_ACTIVE, ENET_RXQ_WRITE_CONTROLLER_INACTIVE,
*/
uint32_t enet_rxq_debug_state_get(enet_rxq_enum enet_rxq, enet_mtl_rxq_state_enum state)
{
    uint32_t reval;
    reval = 0U;

