sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    switch(enet_rxq) {
    case RXQ0:
    reval = (uint32_t)(ENET_MTL_RXQ0_DEBUG & (uint32_t)state);
        break;
    case RXQ1:
    reval = (uint32_t)(ENET_MTL_RXQ1_DEBUG & (uint32_t)state);
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief     get the count of receive queue packets
    \param[in]  enet_rxq: receive queue selection
                only one parameter can be selected which is shown as below
      \arg        RXQ0: receive queue 0
      \arg        RXQ1: receive queue 1

    \param[out] none
    \retval     reval: the number of receive queue packets
*/
uint32_t enet_rxq_packet_count_get(enet_rxq_enum enet_rxq)
{
    uint32_t reval;
    reval = 0U;

    switch(enet_rxq) {
    case RXQ0:
    reval = (uint32_t)GET_RXQ_PACKETS_NUMBER(ENET_MTL_RXQ0_DEBUG);
        break;
    case RXQ1:
    reval = (uint32_t)GET_RXQ_PACKETS_NUMBER(ENET_MTL_RXQ1_DEBUG);
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief     get the number of average bits per slot
    \param[in]  enet_txq: transmit queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1

    \param[out] none
    \retval     reval: the number of average bits per slot
*/
uint32_t enet_slot_average_bits_get(enet_txq_enum enet_txq)
{
    uint32_t reval;
    reval = 0U;
    switch(enet_txq) {
    case TXQ0:
    reval = (uint32_t)GET_AVER_BITS(ENET_MTL_TXQ0_ETS_STATUS);
        break;
    case TXQ1:
    reval = (uint32_t)GET_AVER_BITS(ENET_MTL_TXQ1_ETS_STATUS);
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief     config the transmit queue 1 ETS control related parameter
    \param[in]  config: the ets configuration of transmit queue 1
                 only one parameter can be selected which is shown as below
      \arg        ENET_CBS_1SLOT: 1 slot
      \arg        ENET_CBS_2SLOT: 2 slot
      \arg        ENET_CBS_4SLOT: 4 slot
      \arg        ENET_CBS_8SLOT: 8 slot
      \arg        ENET_CBS_16SLOT: 16 slot
      \arg        ENET_TXQ1_CREDIT_CONTROL_ENABLE: credit control is enable
      \arg        ENET_TXQ1_CREDIT_CONTROL_DISABLE: credit control is disabled
      \arg        ENET_TXQ1_AV_ALGO_ENABLE: CBS algorithm is enable
      \arg        ENET_TXQ1_AV_ALGO_DISABLE: CBS algorithm is disabled
    \param[out] none
    \retval     none
*/
void enet_txq1_ets_control(uint32_t config)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_TXQ1_ETS_CFG(config)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0071U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch (config) {
        case ENET_TXQ1_CREDIT_CONTROL_ENABLE:
        case ENET_TXQ1_AV_ALGO_ENABLE:
            ENET_MTL_TXQ1_ETS_CONTROL |= config;
            break;
        case ENET_TXQ1_CREDIT_CONTROL_DISABLE:
        case ENET_TXQ1_AV_ALGO_DISABLE:
            ENET_MTL_TXQ1_ETS_CONTROL &= config;
            break;
        case ENET_CBS_1SLOT:
        case ENET_CBS_2SLOT:
        case ENET_CBS_4SLOT:
        case ENET_CBS_8SLOT:
        case ENET_CBS_16SLOT:
            ENET_MTL_TXQ1_ETS_CONTROL &= ~ENET_MTL_TXQ1_ETS_CONTROL_SLC;
            ENET_MTL_TXQ1_ETS_CONTROL |= config;
            break;
        default:
            break;
    }
}
}

/*!
    \brief      set the overhead bytes value
    \param[in]  val: the overhead bytes value(0x00 - 0x3F)
    \param[out] none
    \retval     none
*/
void enet_overhead_value_set(uint8_t val)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_OVERHEAD_BYTES_VALUE(val)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0072U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_EST_EXT_CONTROL &= ~ENET_MTL_EST_EXT_CONTROL_OVHD;
    ENET_MTL_EST_EXT_CONTROL = val;
}
}

/*!
    \brief    configure descriptor to work in enhanced mode
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_desc_select_enhanced_mode(enet_dmach_enum dmach)
{
    if(DMACH0 == dmach) {
        ENET_DMA_CH0_TX_CONTROL |= ENET_DMA_CH_TX_CONTROL_DESE;
    } else {
        ENET_DMA_CH1_TX_CONTROL |= ENET_DMA_CH_TX_CONTROL_DESE;
    }
}

/*!
    \brief    configure descriptor to work in normal mode
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_desc_select_normal_mode(enet_dmach_enum dmach)
{

    if(DMACH0 == dmach) {
        ENET_DMA_CH0_TX_CONTROL &= ~ ENET_DMA_CH_TX_CONTROL_DESE;
    } else {
        ENET_DMA_CH1_TX_CONTROL &= ~ ENET_DMA_CH_TX_CONTROL_DESE;
    }
}

/*!
    \brief    initialize the DMA Tx enhanced descriptors's parameters in ring mode
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_tbs_descriptors_ring_init(enet_dmach_enum dmach)
{
    uint32_t num, count, maxsize;
    uint32_t desc_status = 0U;
    enet_tbs_enhanced_descriptors_struct *desc;
    enet_tbs_enhanced_descriptors_struct *desc_tab;
    uint8_t *buf;

    switch(dmach) {
    case DMACH0: 

        /* save a copy of the DMA Tx descriptors */
        desc_tab = tbs_txdesc_tab;
        buf = &tx_buff[0][0];
        count = ENET_TXBUF_NUM;
        maxsize = ENET_TXBUF_SIZE;

        dma_current_tbs_txdesc = desc_tab;
        ENET_DMA_CH0_TXDESC_RING_LENGTH = (ENET_TXBUF_NUM - 1U);
        ENET_DMA_CH0_TXDESC_ADDRESS = (uint32_t)tbs_txdesc_tab;
        ENET_DMA_CH0_TXDESC_TAIL_POINTER = (uint32_t)tbs_txdesc_tab;
     
