sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    /* configure each descriptor */
    for(num = 0U; num < count; num++) {
        /* get the pointer to the next descriptor of the descriptor table */
        desc = desc_tab + num;

        /* configure descriptors */
        desc->DES0 = (uint32_t)(&buf[num * maxsize]);
        desc->DES3 = desc_status;
        desc->buffer_address = desc->DES0;
    }
    break;
    case DMACH1: 

        /* save a copy of the DMA Tx descriptors */
        desc_tab = tbs_txdesc_tab1;
        buf = &tx_buff1[0][0];
        count = ENET_TXBUF_NUM;
        maxsize = ENET_TXBUF_SIZE;

        dma_current_tbs_txdesc1 = desc_tab;
    
        ENET_DMA_CH1_TXDESC_RING_LENGTH = (ENET_TXBUF_NUM - 1U);
        ENET_DMA_CH1_TXDESC_ADDRESS = (uint32_t)tbs_txdesc_tab1;
        ENET_DMA_CH1_TXDESC_TAIL_POINTER = (uint32_t)tbs_txdesc_tab1;
    /* configure each descriptor */
    for(num = 0U; num < count; num++) {
        /* get the pointer to the next descriptor of the descriptor table */
        desc = desc_tab + num;

        /* configure descriptors */
        desc->DES0 = (uint32_t)(&buf[num * maxsize]);
        desc->DES3 = desc_status;
        desc->buffer_address = desc->DES0;
    }
    break;
    default:
       break;
    }
}

/*!
    \brief    receive a packet data with timestamp values to application buffer, when the DMA is in normal mode
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  bufsize: the size of buffer which is the parameter in function
    \param[out] buffer: pointer to the application buffer
                note -- if the input is NULL, user should copy data in application by himself
    \param[out] timestamp: pointer to the table which stores the timestamp high and low
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_ptpframe_receive_normal_mode(enet_dmach_enum dmach, uint8_t *buffer, uint32_t bufsize, uint32_t timestamp[])
{
    uint32_t offset, size;
    ErrStatus status;
    enet_descriptors_struct *dma_context_rxdesc;
    status = ERROR;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_BUFSIZE(bufsize)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0076U), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(timestamp)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0076U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0: 
    /* the descriptor is busy due to own by the DMA */
    if((uint32_t)RESET != (dma_current_rxdesc->DES3 & ENET_NORMAL_RDES3_WF_OWN)) {
        return status;
    }
     /* get the context descriptor with timestamp information */
     if((enet_descriptors_struct *)(uint32_t)&rxdesc_tab[(ENET_RXBUF_NUM - 1U)] == dma_current_rxdesc) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_context_rxdesc = (enet_descriptors_struct *)(ENET_DMA_CH0_RXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_context_rxdesc = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc + ETH_DMARXDESC_SIZE);
    }
    
    /* if buffer pointer is null, indicates that users has copied data in application */
    if(NULL != buffer) {
        /* if no error occurs, and the frame uses only one descriptor */
        if((((uint32_t)RESET) == (dma_current_rxdesc->DES3 & ENET_NORMAL_RDES3_WF_ES)) &&
                (((uint32_t)RESET) != (dma_current_rxdesc->DES3 & ENET_NORMAL_RDES3_WF_LD)) &&
                (((uint32_t)RESET) != (dma_current_rxdesc->DES3 & ENET_NORMAL_RDES3_WF_FD))) {
            /* get the frame length except CRC */
            size = dma_current_rxdesc->DES3 & ENET_NORMAL_RDES3_WF_PL;
            size = size - 4U;

            /* if is a type frame, and CRC is not included in forwarding frame */
            if(((uint32_t)RESET != (ENET_MAC_CONFIGURATION & ENET_MAC_CONFIGURATION_CST)) && ((uint32_t)RESET != (dma_current_rxdesc->DES3 & ENET_NORMAL_RDES3_WF_LT))) {
                size = size + 4U;
            } else {
              /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
            }

            /* to avoid situation that the frame size exceeds the buffer length */
            if(size > bufsize) {
                return status;
            } else {
              /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
            }

            /* copy data from Rx buffer to application buffer */
            for(offset = 0U; offset < size; offset++) {
                (*(buffer + offset)) = (*(__IO uint8_t *)(uint32_t)((dma_current_rxdesc->buffer_address) + offset));
            }

        } else {
            /* return ERROR */
            return status;
        }
    }

    /* copy the timestamp from the context descriptor. */
    timestamp[0] = dma_context_rxdesc->DES0;
    timestamp[1] = dma_context_rxdesc->DES1;
    
    dma_current_rxdesc->DES0 = dma_current_rxdesc->buffer_address;
    dma_current_rxdesc->DES1 = dma_current_rxdesc->bkp_info;
    
    dma_context_rxdesc->DES0 = dma_context_rxdesc->buffer_address;
    dma_context_rxdesc->DES1 = dma_context_rxdesc->bkp_info;

    /* enable reception, descriptor is owned by DMA */
    dma_current_rxdesc->DES3 = ENET_NORMAL_RDES3_WF_OWN | ENET_NORMAL_RDES3_RF_BUF1V;
    dma_context_rxdesc->DES3 = ENET_NORMAL_RDES3_WF_OWN | ENET_NORMAL_RDES3_RF_BUF1V;
    
    /* If the receive interrupt is enabled, the IOC bit needs to be set */
    if((uint32_t)RESET != (ENET_DMA_CH0_INTERRUPT_ENABLE & ENET_DMA_CH_INTERRUPT_ENABLE_RIE)) {
        dma_current_rxdesc->DES3 |= ENET_NORMAL_RDES3_RF_IOC;
        dma_context_rxdesc->DES3 |= ENET_NORMAL_RDES3_RF_IOC;
    }
    __DMB();
    
    /* update the current RxDMA descriptor pointer to the next decriptor in RxDMA decriptor table */
    /* ring mode */
    if((enet_descriptors_struct *)(uint32_t)&rxdesc_tab[(ENET_RXBUF_NUM - 1U)] == dma_context_rxdesc) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_current_rxdesc = (enet_descriptors_struct *)(ENET_DMA_CH0_RXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_current_rxdesc = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_context_rxdesc + ETH_DMARXDESC_SIZE);
    }
    ENET_DMA_CH0_RXDESC_TAIL_POINTER = (uint32_t)&rxdesc_tab[(ENET_RXBUF_NUM)];
    break;
    
    case DMACH1: 
    /* the descriptor is busy due to own by the DMA */
    if((uint32_t)RESET != (dma_current_rxdesc1->DES3 & ENET_NORMAL_RDES3_WF_OWN)) {
        return status;
    }
     /* get the context descriptor with timestamp information */
     if((enet_descriptors_struct *)(uint32_t)&rxdesc_tab1[(ENET_RXBUF_NUM - 1U)] == dma_current_rxdesc1) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_context_rxdesc = (enet_descriptors_struct *)(ENET_DMA_CH1_RXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_context_rxdesc = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc1 + ETH_DMARXDESC_SIZE);
    }
    
    /* if buffer pointer is null, indicates that users has copied data in application */
    if(NULL != buffer) {
        /* if no error occurs, and the frame uses only one descriptor */
        if((((uint32_t)RESET) == (dma_current_rxdesc1->DES3 & ENET_NORMAL_RDES3_WF_ES)) &&
                (((uint32_t)RESET) != (dma_current_rxdesc1->DES3 & ENET_NORMAL_RDES3_WF_LD)) &&
                (((uint32_t)RESET) != (dma_current_rxdesc1->DES3 & ENET_NORMAL_RDES3_WF_FD))) {
            /* get the frame length except CRC */
            size = dma_current_rxdesc1->DES3 & ENET_NORMAL_RDES3_WF_PL;
            size = size - 4U;

            /* if is a type frame, and CRC is not included in forwarding frame */
            if(((uint32_t)RESET != (ENET_MAC_CONFIGURATION & ENET_MAC_CONFIGURATION_CST)) && ((uint32_t)RESET != (dma_current_rxdesc1->DES3 & ENET_NORMAL_RDES3_WF_LT))) {
                size = size + 4U;
            } else {
              /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
            }

            /* to avoid situation that the frame size exceeds the buffer length */
            if(size > bufsize) {
                return status;
            } else {
              /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
            }

