sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
            /* copy data from Rx buffer to application buffer */
            for(offset = 0U; offset < size; offset++) {
                (*(buffer + offset)) = (*(__IO uint8_t *)(uint32_t)((dma_current_rxdesc1->buffer_address) + offset));
            }

        } else {
            /* return ERROR */
            return status;
        }
    }

    /* copy the timestamp from the context descriptor. */
    timestamp[0] = dma_context_rxdesc->DES0;
    timestamp[1] = dma_context_rxdesc->DES1;
    
    dma_current_rxdesc1->DES0 = dma_current_rxdesc1->buffer_address;
    dma_current_rxdesc1->DES1 = dma_current_rxdesc1->bkp_info;
    
    dma_context_rxdesc->DES0 = dma_context_rxdesc->buffer_address;
    dma_context_rxdesc->DES1 = dma_context_rxdesc->bkp_info;

    /* enable reception, descriptor is owned by DMA */
    dma_current_rxdesc1->DES3 = ENET_NORMAL_RDES3_WF_OWN | ENET_NORMAL_RDES3_RF_BUF1V;
    dma_context_rxdesc->DES3 = ENET_NORMAL_RDES3_WF_OWN | ENET_NORMAL_RDES3_RF_BUF1V;
    
    /* If the receive interrupt is enabled, the IOC bit needs to be set */
    if((uint32_t)RESET != (ENET_DMA_CH1_INTERRUPT_ENABLE & ENET_DMA_CH_INTERRUPT_ENABLE_RIE)) {
        dma_current_rxdesc1->DES3 |= ENET_NORMAL_RDES3_RF_IOC;
        dma_context_rxdesc->DES3 |= ENET_NORMAL_RDES3_RF_IOC;
    }
    __DMB();
    
    /* update the current RxDMA descriptor pointer to the next decriptor in RxDMA decriptor table */
    /* ring mode */
    if((enet_descriptors_struct *)(uint32_t)&rxdesc_tab1[(ENET_RXBUF_NUM - 1U)] == dma_context_rxdesc) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_current_rxdesc1 = (enet_descriptors_struct *)(ENET_DMA_CH1_RXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_current_rxdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_context_rxdesc + ETH_DMARXDESC_SIZE);
    }
    ENET_DMA_CH1_RXDESC_TAIL_POINTER = (uint32_t)&rxdesc_tab1[(ENET_RXBUF_NUM)];
    break;
    default:
       break;
    }
    status = SUCCESS;
}
    return status;
}

/*!
    \brief    send data with timestamp values in application buffer as a transmit packet, when the DMA is in normal mode
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  buffer: pointer on the application buffer
                note -- if the input is NULL, user should copy data in application by himself
    \param[in]  length: the length of frame data to be transmitted
    \param[out] timestamp: pointer to the table which stores the timestamp high and low
                note -- if the input is NULL, timestamp is ignored
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_ptpframe_transmit_normal_mode(enet_dmach_enum dmach, uint8_t *buffer, uint32_t length, uint32_t timestamp[])
{
    uint32_t offset, timeout;
    uint32_t tdes3_own_flag;
    ErrStatus status;
    status = ERROR;
    timeout = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_BUFSIZE(length)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0077U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0: 
    /* the descriptor is busy due to own by the DMA */
    if((uint32_t)RESET != (dma_current_txdesc->DES3 & ENET_NORMAL_TDES3_WF_OWN)) {
        return status;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

#ifndef FW_DEBUG_ERR_REPORT
    /* only frame length no more than ENET_MAX_FRAME_SIZE is allowed */
    if(length > ENET_MAX_FRAME_SIZE) {
        return status;
    } else {
    
    }
#endif /* FW_DEBUG_ERR_REPORT */
    
    /* if buffer pointer is null, indicates that users has handled data in application */
    if(NULL != buffer) {
        /* copy frame data from application buffer to Tx buffer */
        for(offset = 0U; offset < length; offset++) {
            (*(__IO uint8_t *)(uint32_t)((dma_current_txdesc->buffer_address) + offset)) = (*(buffer + offset));
        }
    }

    /* set the frame length */
    dma_current_txdesc->DES2 = length | ENET_NORMAL_TDES2_RF_TTSE;
    /* set the segment of frame, frame is transmitted in one descriptor */
    dma_current_txdesc->DES3 |= ENET_NORMAL_TDES3_WF_FD | ENET_NORMAL_TDES3_WF_LD;
    /* enable the DMA transmission */
    dma_current_txdesc->DES3 |= ENET_NORMAL_TDES3_WF_OWN;
    /* if timestamp pointer is null, indicates that users don't care timestamp in application */
    dma_current_txdesc->DES0 = dma_current_txdesc->buffer_address ;
    dma_current_txdesc->DES1 = dma_current_txdesc->bkp_info;
    __DMB();
    /* check Tx buffer unavailable flag status */
    if((uint32_t)RESET != (ENET_DMA_CH0_STATUS & ENET_DMA_CH_STATUS_TBU)) {
        /* clear TBU flag */
        ENET_DMA_CH0_STATUS &= ~ENET_DMA_CH_STATUS_TBU;
    }
    ENET_DMA_CH0_TXDESC_TAIL_POINTER = (uint32_t)dma_current_txdesc + sizeof(enet_descriptors_struct);  
    
    if(NULL != timestamp) {
        /* wait for own bit to be clear, a timestamp was captured */
        do {
            tdes3_own_flag = (dma_current_txdesc->DES3 & ENET_NORMAL_TDES3_WF_OWN);
            timeout++;
        } while(((uint32_t)RESET != tdes3_own_flag) && (timeout < ENET_DELAY_TO));

        /* return ERROR due to timeout */
        if(ENET_DELAY_TO == timeout) {
            return status;
        }

         /* clear the ENET_NORMAL_TDES3_WF_TTSS flag */
        dma_current_txdesc->DES3 &= ~ENET_NORMAL_TDES3_WF_TTSS;
        /* get the timestamp value of the transmit frame */
        timestamp[0] = dma_current_txdesc->DES0;
        timestamp[1] = dma_current_txdesc->DES1;
    }

    /* update the current TxDMA descriptor pointer to the next decriptor in TxDMA decriptor table*/
    /* ring mode */
    if((enet_descriptors_struct *)(ENET_DMA_CH0_TXDESC_ADDRESS + (ENET_TXBUF_NUM - 1U) * sizeof(enet_descriptors_struct)) <= dma_current_txdesc) {
        /* if is the last descriptor in table, the next descriptor is the table header */
       dma_current_txdesc = (enet_descriptors_struct *)(ENET_DMA_CH0_TXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
       dma_current_txdesc = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_txdesc + ETH_DMATXDESC_SIZE);
    }

    break;
    case DMACH1: 
    /* the descriptor is busy due to own by the DMA */
    if((uint32_t)RESET != (dma_current_txdesc1->DES3 & ENET_NORMAL_TDES3_WF_OWN)) {
        return status;
    } else {
        /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'is ... else if' chain) */
    }

#ifndef FW_DEBUG_ERR_REPORT
    /* only frame length no more than ENET_MAX_FRAME_SIZE is allowed */
    if(length > ENET_MAX_FRAME_SIZE) {
        return status;
    } else {
    
