sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    }
#endif /* FW_DEBUG_ERR_REPORT */
    
    /* if buffer pointer is null, indicates that users has handled data in application */
    if(NULL != buffer) {
        /* copy frame data from application buffer to Tx buffer */
        for(offset = 0U; offset < length; offset++) {
            (*(__IO uint8_t *)(uint32_t)((dma_current_txdesc1->buffer_address) + offset)) = (*(buffer + offset));
        }
    }

    /* set the frame length */
    dma_current_txdesc1->DES2 = length | ENET_NORMAL_TDES2_RF_TTSE;
    /* set the segment of frame, frame is transmitted in one descriptor */
    dma_current_txdesc1->DES3 |= ENET_NORMAL_TDES3_WF_FD | ENET_NORMAL_TDES3_WF_LD;
    /* enable the DMA transmission */
    dma_current_txdesc1->DES3 |= ENET_NORMAL_TDES3_WF_OWN;
    /* if timestamp pointer is null, indicates that users don't care timestamp in application */
    dma_current_txdesc1->DES0 = dma_current_txdesc1->buffer_address ;
    dma_current_txdesc1->DES1 = dma_current_txdesc1->bkp_info;
    __DMB();
    /* check Tx buffer unavailable flag status */
    if((uint32_t)RESET != (ENET_DMA_CH1_STATUS & ENET_DMA_CH_STATUS_TBU)) {
        /* clear TBU flag */
        ENET_DMA_CH1_STATUS &= ~ENET_DMA_CH_STATUS_TBU;
    }
    ENET_DMA_CH1_TXDESC_TAIL_POINTER = (uint32_t)dma_current_txdesc1 + sizeof(enet_descriptors_struct);  
    
    if(NULL != timestamp) {
        /* wait for own bit to be clear, a timestamp was captured */
        do {
            tdes3_own_flag = (dma_current_txdesc1->DES3 & ENET_NORMAL_TDES3_WF_OWN);
            timeout++;
        } while(((uint32_t)RESET != tdes3_own_flag) && (timeout < ENET_DELAY_TO));

        /* return ERROR due to timeout */
        if(ENET_DELAY_TO == timeout) {
            return status;
        }

         /* clear the ENET_NORMAL_TDES3_WF_TTSS flag */
        dma_current_txdesc1->DES3 &= ~ENET_NORMAL_TDES3_WF_TTSS;
        /* get the timestamp value of the transmit frame */
        timestamp[0] = dma_current_txdesc1->DES0;
        timestamp[1] = dma_current_txdesc1->DES1;
    }

    /* update the current TxDMA descriptor pointer to the next decriptor in TxDMA decriptor table*/
    /* ring mode */
    if((enet_descriptors_struct *)(ENET_DMA_CH1_TXDESC_ADDRESS + (ENET_TXBUF_NUM - 1U) * sizeof(enet_descriptors_struct)) <= dma_current_txdesc1) {
        /* if is the last descriptor in table, the next descriptor is the table header */
       dma_current_txdesc1 = (enet_descriptors_struct *)(ENET_DMA_CH1_TXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
       dma_current_txdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_txdesc1 + ETH_DMATXDESC_SIZE);
    }

    break;
    default:
       break;
    }
    status = SUCCESS;
}
    return status;
}

#if defined (DMACH0_USE_ENHANCED_MODE) || (DMACH1_USE_ENHANCED_MODE)

/*!
    \brief    handle application buffer data to transmit it based on TBS function
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  buffer: pointer to the frame data to be transmitted,
                note -- if the input is NULL, user should handle the data in application by himself
    \param[in]  length: the length of frame data to be transmitted
    \param[in]  launch_time: launch time associated with the packet
    \param[in]  gsn_num: GCL slot number associated with the packet
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_frame_transmit_tbs(enet_dmach_enum dmach, uint8_t *buffer, uint32_t length, uint32_t launch_time, uint32_t gsn_num)
{
    uint32_t offset;
    ErrStatus status;
    status = ERROR;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_BUFSIZE(length)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0078U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{

    switch(dmach) {
    case DMACH0: 
#ifdef DMACH0_USE_ENHANCED_MODE
    /* the descriptor is busy due to own by the DMA */
    if((uint32_t)RESET != (dma_current_tbs_txdesc->DES3 & ENET_NORMAL_TDES3_WF_OWN)) {
        return status;
    }

#ifndef FW_DEBUG_ERR_REPORT
    /* only frame length no more than ENET_MAX_FRAME_SIZE is allowed */
    if(length > ENET_MAX_FRAME_SIZE) {
        return status;
    } else {
    
    }
#endif /* FW_DEBUG_ERR_REPORT */

    /* if buffer pointer is null, indicates that users has handled data in application */
    if(NULL != buffer) {
        /* copy frame data from application buffer to Tx buffer */
        for(offset = 0U; offset < length; offset++) {
            (*(__IO uint8_t *)(uint32_t)((dma_current_tbs_txdesc->DES0) + offset)) = (*(buffer + offset));
        }
    }

    /* set the launch time */
    dma_current_tbs_txdesc->ETDES0 = (launch_time >> 24);
    dma_current_tbs_txdesc->ETDES1 = (launch_time << 8);
    dma_current_tbs_txdesc->ETDES0 |= (gsn_num << 8) | ENET_ENHANCED_ETDES0_LTV;

    /* set the frame length */
    dma_current_tbs_txdesc->DES2 = length;
    /* set the segment of frame, frame is transmitted in one descriptor */
    dma_current_tbs_txdesc->DES3 |= ENET_NORMAL_TDES3_WF_FD | ENET_NORMAL_TDES3_WF_LD;
    /* enable the DMA transmission */
    dma_current_tbs_txdesc->DES3 |= ENET_NORMAL_TDES3_WF_OWN;
    __DSB();
    __ISB();
    __DMB();

    /* check Tx buffer unavailable flag status */
    if((uint32_t)RESET != (ENET_DMA_CH0_STATUS & ENET_DMA_CH_STATUS_TBU)) {
        /* clear TBU flag */
        ENET_DMA_CH0_STATUS &= ~ENET_DMA_CH_STATUS_TBU;
    }
    ENET_DMA_CH0_TXDESC_TAIL_POINTER = (uint32_t)dma_current_tbs_txdesc + sizeof(enet_tbs_enhanced_descriptors_struct);

    /* update the current TxDMA descriptor pointer to the next decriptor in TxDMA decriptor table*/
    /* ring mode */
    if((enet_tbs_enhanced_descriptors_struct *)(ENET_DMA_CH0_TXDESC_ADDRESS + (ENET_TXBUF_NUM-1U) * sizeof(enet_tbs_enhanced_descriptors_struct)) <= dma_current_tbs_txdesc) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_current_tbs_txdesc = (enet_tbs_enhanced_descriptors_struct *)(ENET_DMA_CH0_TXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_current_tbs_txdesc = (enet_tbs_enhanced_descriptors_struct *)(uint32_t)((uint32_t)dma_current_tbs_txdesc + ENET_ENHANCED_DMATXDESC_SIZE);
    }
 #endif /* DMACH0_USE_ENHANCED_MODE */
    break;

    case DMACH1:
#ifdef DMACH1_USE_ENHANCED_MODE
    /* the descriptor is busy due to own by the DMA */
    if((uint32_t)RESET != (dma_current_tbs_txdesc1->DES3 & ENET_NORMAL_TDES3_WF_OWN)) {
        return status;
    }

#ifndef FW_DEBUG_ERR_REPORT
    /* only frame length no more than ENET_MAX_FRAME_SIZE is allowed */
    if(length > ENET_MAX_FRAME_SIZE) {
        return status;
    } else {
    
