sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    }
#endif /* FW_DEBUG_ERR_REPORT */

    /* if buffer pointer is null, indicates that users has handled data in application */
    if(NULL != buffer) {
        /* copy frame data from application buffer to Tx buffer */
        for(offset = 0U; offset < length; offset++) {
            (*(__IO uint8_t *)(uint32_t)((dma_current_tbs_txdesc1->DES0) + offset)) = (*(buffer + offset));
        }
    }

    /* set the launch time */
    dma_current_tbs_txdesc1->ETDES0 = (launch_time >> 24);
    dma_current_tbs_txdesc1->ETDES1 = (launch_time << 8);
    dma_current_tbs_txdesc1->ETDES0 |= (gsn_num << 8) | ENET_ENHANCED_ETDES0_LTV;

    /* set the frame length */
    dma_current_tbs_txdesc1->DES2 = length;
    /* set the segment of frame, frame is transmitted in one descriptor */
    dma_current_tbs_txdesc1->DES3 |= ENET_NORMAL_TDES3_WF_FD | ENET_NORMAL_TDES3_WF_LD;
    /* enable the DMA transmission */
    dma_current_tbs_txdesc1->DES3 |= ENET_NORMAL_TDES3_WF_OWN;
    __DSB();
    __ISB();
    __DMB();

    /* check Tx buffer unavailable flag status */
    if((uint32_t)RESET != (ENET_DMA_CH1_STATUS & ENET_DMA_CH_STATUS_TBU)) {
        /* clear TBU flag */
        ENET_DMA_CH1_STATUS &= ~ENET_DMA_CH_STATUS_TBU;
    }
    ENET_DMA_CH1_TXDESC_TAIL_POINTER = (uint32_t)dma_current_tbs_txdesc1 + sizeof(enet_tbs_enhanced_descriptors_struct);

    /* update the current TxDMA descriptor pointer to the next decriptor in TxDMA decriptor table*/
    /* ring mode */
    if((enet_tbs_enhanced_descriptors_struct *)(ENET_DMA_CH1_TXDESC_ADDRESS + (ENET_TXBUF_NUM-1U) * sizeof(enet_tbs_enhanced_descriptors_struct)) <= dma_current_tbs_txdesc1) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_current_tbs_txdesc1 = (enet_tbs_enhanced_descriptors_struct *)(ENET_DMA_CH1_TXDESC_ADDRESS);
    } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_current_tbs_txdesc1 = (enet_tbs_enhanced_descriptors_struct *)(uint32_t)((uint32_t)dma_current_tbs_txdesc1 + ENET_ENHANCED_DMATXDESC_SIZE);
    }
#endif /* DMACH1_USE_ENHANCED_MODE */
    break;
    default:
       break;
    }
    status = SUCCESS;
}
    return status;
}
#endif /* defined(DMACH0_USE_ENHANCED_MODE || DMACH1_USE_ENHANCED_MODE) */

/*!
    \brief      compute the CRC of a hardware address
    \param[in]  mac: the hardware addresss
    \param[in]  size: the size of mac address
    \param[out] none
    \retval     crc_val: the result of crc value
*/
uint32_t enet_crc_compute(uint8_t *macaddr, uint8_t size)
{
    uint32_t crc_val;
    uint32_t i, j;
    crc_val = 0xFFFFFFFFUL;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(macaddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0079U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    for(i = 0; i < size; i++) {
        crc_val = crc_val ^ macaddr[i];
        for(j = 0; j < 8U; j++) {
            if((crc_val & 0x1U) != 0U) {
                crc_val = (crc_val >> 1U) ^ 0xEDB88320U;
            } else {
                crc_val = (crc_val >> 1U);
            }
        }
    }
}
    return ~crc_val;
}

/*!
    \brief      bitwise reversal on a 32 bit value
    \param[in]  val: the 32 bit value
    \param[out] none
    \retval     rev_val: the result of bitwise reversal
*/
uint32_t enet_value_reverse(uint32_t val)
{
    uint32_t rev_val = 0U;
    uint32_t i;
    for(i = 0U; i < 32U; i++) {
        if((uint32_t)RESET != (val & ((uint32_t)1U << (i & 0x1FU)))) {
            rev_val |= (uint32_t)((uint32_t)1U << ((uint32_t)31U - i));
        }
    }
    return rev_val;
}

/*!
    \brief      set the vlan filter dma selection
    \param[in]  filter: the filter register selection
                only one parameter can be selected which is shown as below
      \arg        MAC_VLAN_TAG_FILTER0: filter register 0
      \arg        MAC_VLAN_TAG_FILTER1: filter register 1
      \arg        MAC_VLAN_TAG_FILTER2: filter register 2
      \arg        MAC_VLAN_TAG_FILTER3: filter register 3
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_vlantag_filter_dmach_select(uint32_t filter, enet_dmach_enum dmach)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT, reg_val;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_MAC_VLAN_TAG_FILTER(filter)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x007BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* read vlan tag filterx value */
    ENET_MAC_VLAN_TAG_CTRL &= ~ENET_MAC_VLAN_TAG_CTRL_OFS;
    ENET_MAC_VLAN_TAG_CTRL |= ENET_MAC_VLAN_TAG_CTRL_CT;
    ENET_MAC_VLAN_TAG_CTRL |= (filter >> 19U) | ENET_MAC_VLAN_TAG_CTRL_OB;
    while(((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_OB))&& (0U < timeout)) {
        timeout --;
    }
    reg_val = ENET_MAC_VLAN_TAG_DATA;
    reg_val &= ~ENET_MAC_VLAN_TAG_DATA_DMACHN;
    reg_val |= ((uint32_t)dmach << 25U) | ENET_MAC_VLAN_TAG_DATA_DMACHEN;
    
    timeout = ENET_OPERATION_TIMEROUT;
    /* write vlan tag filterx  */
    ENET_MAC_VLAN_TAG_DATA = reg_val;
    ENET_MAC_VLAN_TAG_CTRL &= ~ENET_MAC_VLAN_TAG_CTRL_CT;
    ENET_MAC_VLAN_TAG_CTRL |= (filter >> 19U) | ENET_MAC_VLAN_TAG_CTRL_OB;
    while(((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_OB))&& (0U < timeout)) {
        timeout --;
    }
}
}

/*!
    \brief      set up vlan filter feature
    \param[in]  filter: the filter register selection
                only one parameter can be selected which is shown as below
      \arg        MAC_VLAN_TAG_FILTER0: filter register 0
      \arg        MAC_VLAN_TAG_FILTER1: filter register 1
      \arg        MAC_VLAN_TAG_FILTER2: filter register 2
      \arg        MAC_VLAN_TAG_FILTER3: filter register 3
    \param[in]  feature: the vlan filter feature need to write
                only one parameter can be selected which is shown as below
      \arg        ENET_VLANTAGCOMPARISON_INNER: enable inner VLAN tag comparison
      \arg        ENET_SVLANTAGMATCH_ENABLE: enable S-VLAN match for received frames
      \arg        ENET_VLANTAGCOMPARISON_12BIT: 12-bit VLAN comparison
      \arg        ENET_VLANTAGCOMPARISON_ENABLE: VLAN tag enable
      \arg        ENET_VLANTYPECOMPARISON_DISABLE: disable VLAN type comparison
    \param[out] none
    \retval     none
*/
void enet_vlantag_filter_feature_set(uint32_t filter, uint32_t feature)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT, reg_val;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_MAC_VLAN_TAG_FILTER(filter)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x007CU), ERR_PARAM_POINTER);
    } else if(NOT_ENET_VLAN_FILTER_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x007CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* read vlan tag filterx value */
    ENET_MAC_VLAN_TAG_CTRL &= ~ENET_MAC_VLAN_TAG_CTRL_OFS;
    ENET_MAC_VLAN_TAG_CTRL |= ENET_MAC_VLAN_TAG_CTRL_CT;
    ENET_MAC_VLAN_TAG_CTRL |= (filter >> 19U) | ENET_MAC_VLAN_TAG_CTRL_OB;
    while(((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_OB))&& (0U < timeout)) {
        timeout --;
    }
    reg_val = ENET_MAC_VLAN_TAG_DATA;
    reg_val |= feature;
    
    timeout = ENET_OPERATION_TIMEROUT;
    /* write vlan tag filterx  */
    ENET_MAC_VLAN_TAG_DATA = reg_val;
    ENET_MAC_VLAN_TAG_CTRL &= ~(ENET_MAC_VLAN_TAG_CTRL_CT);
    ENET_MAC_VLAN_TAG_CTRL |= (filter >> 19U) | ENET_MAC_VLAN_TAG_CTRL_OB;
    while(((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_OB))&& (0U < timeout)) {
        timeout --;
    }
    
