sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
}
}

/*!
    \brief      set up vlan filter tag ID
    \param[in]  filter: the filter register selection
                only one parameter can be selected which is shown as below
      \arg        MAC_VLAN_TAG_FILTER0: filter register 0
      \arg        MAC_VLAN_TAG_FILTER1: filter register 1
      \arg        MAC_VLAN_TAG_FILTER2: filter register 2
      \arg        MAC_VLAN_TAG_FILTER3: filter register 3
    \param[in]  val: the vlan filter tag ID
    \param[out] none
    \retval     none
*/
void enet_vlantag_filter_vid_set(uint32_t filter, uint32_t val)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT, reg_val;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_MAC_VLAN_TAG_FILTER(filter)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x007DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* read vlan tag filterx value */
    ENET_MAC_VLAN_TAG_CTRL &= ~ENET_MAC_VLAN_TAG_CTRL_OFS;
    ENET_MAC_VLAN_TAG_CTRL |= ENET_MAC_VLAN_TAG_CTRL_CT;
    ENET_MAC_VLAN_TAG_CTRL |= (filter >> 19U) | ENET_MAC_VLAN_TAG_CTRL_OB;
    while(((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_OB))&& (0U < timeout)) {
        timeout --;
    }
    reg_val = ENET_MAC_VLAN_TAG_DATA;
    reg_val &= ~ENET_MAC_VLAN_TAG_DATA_VID;
    reg_val |= val;
    
    timeout = ENET_OPERATION_TIMEROUT;
    /* write vlan tag filterx  */
    ENET_MAC_VLAN_TAG_DATA = reg_val;
    ENET_MAC_VLAN_TAG_CTRL &= ~ENET_MAC_VLAN_TAG_CTRL_CT ;
    ENET_MAC_VLAN_TAG_CTRL |= (filter >> 19U) | ENET_MAC_VLAN_TAG_CTRL_OB;
    while(((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_OB))&& (0U < timeout)) {
        timeout --;
    }
}
}

/*!
    \brief      add an address entry to the hash table filter
    \param[in]  macaddr: the hardware address
    \param[out] none
    \retval     none
*/
void enet_add_dstaddr_hashfilter(uint8_t *macaddr)
{
    uint32_t crc_val;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(macaddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x007EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    crc_val = enet_crc_compute(macaddr, 6U);

    if((uint32_t)RESET == ((enet_value_reverse(crc_val) >> 0x1FU) & 1U)) {
        ENET_MAC_HASH_TABLE_REG0 |= (uint32_t)((uint32_t)1U << ((enet_value_reverse(crc_val) >> 0x1AU) & 0x1FU));
    } else {
        ENET_MAC_HASH_TABLE_REG1 |= (uint32_t)((uint32_t)1U << ((enet_value_reverse(crc_val) >> 0x1AU) & 0x1FU));
    }
}
}

/*!
    \brief      remove an address entry to the hash table filter
    \param[in]  macaddr: the hardware addresss
    \param[out] none
    \retval     none
*/
void enet_remove_dstaddr_hashfilter(uint8_t *macaddr)
{
    uint32_t crc_val;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(macaddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x007FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    crc_val = enet_crc_compute(macaddr, 6U);

    if((uint32_t)RESET == ((enet_value_reverse(crc_val) >> 0x1FU) & 1U)) {
        ENET_MAC_HASH_TABLE_REG0 &= ~(1U << ((enet_value_reverse(crc_val) >> 0x1AU) & 0x1FU));
    } else {
        ENET_MAC_HASH_TABLE_REG1 &= ~(1U << ((enet_value_reverse(crc_val) >> 0x1AU) & 0x1FU));
    }
}
}

/*!
    \brief      add a vlan tag entry to the hash table filter
    \param[in]  tagval: the vlan tag value
    \param[out] none
    \retval     none
*/
void enet_add_vlantag_hashtable(uint32_t tagval)
{
    uint32_t index, crc_val;

    crc_val = enet_crc_compute((uint8_t *)&tagval, 2);

    index = (enet_value_reverse(crc_val) & BITS(28, 31)) >> 28U;


    if((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_ETV)) {
        index = index - 1UL;
    }

    ENET_MAC_VLAN_HASH_TABLE |= ((uint32_t)1U << (index & 0x1FU));
}

/*!
    \brief      remove a vlan tag entry to the hash table filter
    \param[in]  tagval: the vlan tag value
    \param[out] none
    \retval     none
*/
void enet_remove_vlantag_hashtable(uint32_t tagval)
{
    uint32_t index, crc_val;
    crc_val = enet_crc_compute((uint8_t *)&tagval, 2);
    index = (enet_value_reverse(crc_val) & BITS(28, 31)) >> 28U;


    if((uint32_t)RESET != (ENET_MAC_VLAN_TAG_CTRL & ENET_MAC_VLAN_TAG_CTRL_ETV)) {
        index = index - 1UL;
    }

    ENET_MAC_VLAN_HASH_TABLE &= ~((uint32_t)1U << (index & 0xFU));
}

/*!
    \brief      enable flexible Rx parser
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_parser_enable(void)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;

    uint32_t temp_state;
    ENET_MAC_CONFIGURATION &= ~ENET_MAC_CONFIGURATION_RE;
    do {
        temp_state = ENET_MAC_CONFIGURATION & ENET_MAC_CONFIGURATION_RE;
        timeout --;
    } while(((uint32_t)RESET != temp_state) && (0U < timeout)) ;

    ENET_MTL_OPERATION_MODE |= ENET_MTL_OPERATION_MODE_FRPE;
    ENET_MAC_CONFIGURATION |= ENET_MAC_CONFIGURATION_RE;
}

/*!
    \brief      disable flexible Rx parser
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_parser_disable(void)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
    uint32_t temp_state;
    ENET_MAC_CONFIGURATION &= ~ENET_MAC_CONFIGURATION_RE;
    do {
        temp_state = ENET_MAC_CONFIGURATION & ENET_MAC_CONFIGURATION_RE;
        timeout --;
    } while(((uint32_t)RESET != temp_state) && (0U < timeout)) ;

    ENET_MTL_OPERATION_MODE &= ~ENET_MTL_OPERATION_MODE_FRPE;

    ENET_MAC_CONFIGURATION |= ENET_MAC_CONFIGURATION_RE;
}

/*!
    \brief    set the number of entries in the Instruction table
    \param[in]  type: choose the type of entry in the instruction table which users want to check, refer to enet_entry_type_enum
                only one parameter can be selected which is shown as below
      \arg        PARSABLE_ENTRY: parsable entries in the Instruction table
      \arg        VALID_ENTRY: valid entries in the instruction table
    \param[in]  value: the value of entries number
    \param[out] none
    \retval     none
*/
void enet_parser_entry_number_set(enet_entry_type_enum type, uint32_t value)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_ENTRY_NUMBER(value)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0084U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(type) {
    case PARSABLE_ENTRY:
        ENET_MTL_RXP_CONTROL_STATUS &= ~ENET_MTL_RXP_CONTROL_STATUS_NPE;
        ENET_MTL_RXP_CONTROL_STATUS |= MTL_RXP_CONTROL_STATUS_NPE(value);
        break;
    case VALID_ENTRY:
        ENET_MTL_RXP_CONTROL_STATUS &= ~ENET_MTL_RXP_CONTROL_STATUS_NVE;
        ENET_MTL_RXP_CONTROL_STATUS |= MTL_RXP_CONTROL_STATUS_NVE(value);
        break;
    default:
        break;
    }
}
}

/*!
    \brief      config the instruction table entry
    \param[in]  value: the value of instruction table
    \param[in]  addr: the offset address of instruction table
    \param[out] none
    \retval     none
*/
void enet_parser_table_entry_config(uint32_t *value, uint8_t addr)
{
    uint32_t i;
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(value)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0085U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    for(i = 0; i < 4U; i++) {
        /* wait until STARTBUSY bit is clear */
        while((((uint32_t)RESET != (ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS & ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY))) && (0U < timeout)) {
            timeout --;
        }
        ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS = MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR(addr) | ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN;
        ENET_MTL_RXP_INDIRECT_ACC_DATA = value[i];
        ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS |= ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY;
        addr += 1U;
    }
}
}

/*!
    \brief      get the value of instruction table
    \param[in]  addr: the offset address of instruction table
    \param[out] value: the value of instruction table
    \retval     none
*/
void enet_parser_table_entry_get(uint32_t *value, uint32_t addr)
{
    uint32_t i;
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(value)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0086U), ERR_PARAM_POINTER);
    } else if(NOT_ENET_ENTRY_NUMBER(addr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0086U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{

    for(i = 0; i < 4U; i++) {
       
        ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS = MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR(addr);
        ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS &= ~ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN;
        ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS |= ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY;
            /* wait until BUSY bit is clear */
        while(((uint32_t)RESET != (ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS & ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY)) && (0U < timeout)) {
            timeout --;
        }
        value[i] = ENET_MTL_RXP_INDIRECT_ACC_DATA;

        addr += 1U;
    }
}
}

/*!
    \brief    get MTL parser overflow flag
    \param[in]  counter: choose the parser counter, refer to enet_parser_counter_enum
                only one parameter can be selected which is shown as below
      \arg            MTL_PAESER_BYPASS_COUNTER: parsable bypass counter
      \arg            MTL_PAESER_ERROR_COUNTER: parsable error counter
      \arg            MTL_PAESER_DROP_COUNTER: parsable drop counter
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus enet_parser_overflow_flag_get(enet_parser_counter_enum counter)
{
    FlagStatus flag = RESET;
    switch(counter) {
    case MTL_PAESER_BYPASS_COUNTER:
        if((uint32_t)RESET != GET_PARSER_OVERFLOW_FLAG(ENET_MTL_RXP_BYPASS_CNT)) {
            flag = SET;
        } else {
            flag = RESET;
        }
        break;
    case MTL_PAESER_ERROR_COUNTER:
        if((uint32_t)RESET != GET_PARSER_OVERFLOW_FLAG(ENET_MTL_RXP_ERROR_CNT)) {
            flag = SET;
        } else {
            flag = RESET;
        }
        break;
    case MTL_PAESER_DROP_COUNTER:
        if((uint32_t)RESET != GET_PARSER_OVERFLOW_FLAG(ENET_MTL_RXP_DROP_CNT)) {
            flag = SET;
        } else {
            flag = RESET;
        }
        break;
    default:
        break;
    }
    return flag;
}

/*!
    \brief    get MTL parser related count
    \param[in]  counter: choose the parser counter, refer to enet_parser_counter_enum
                only one parameter can be selected which is shown as below
      \arg            MTL_PAESER_BYPASS_COUNTER: parsable bypass counter
      \arg            MTL_PAESER_ERROR_COUNTER: parsable error counter
      \arg            MTL_PAESER_DROP_COUNTER: parsable drop counter
    \param[out] none
    \retval     cnt_val: the value of MTL parser related counter
*/
uint32_t enet_parser_count_get(enet_parser_counter_enum counter)
{
    uint32_t cnt_val;
    cnt_val = 0U;

    switch(counter) {
    case MTL_PAESER_BYPASS_COUNTER:
        cnt_val = GET_PARSER_COUNT(ENET_MTL_RXP_BYPASS_CNT);
        break;
    case MTL_PAESER_ERROR_COUNTER:
        cnt_val = GET_PARSER_COUNT(ENET_MTL_RXP_ERROR_CNT);
        break;
    case MTL_PAESER_DROP_COUNTER:
        cnt_val = GET_PARSER_COUNT(ENET_MTL_RXP_DROP_CNT);
        break;
    default:
        break;
    }
    return cnt_val;
}

/*!
    \brief    select the DMA channel number for the packet that is passed by this L3_L4 filter
    \param[in]  filter: choose the channel number for the packet that is passed by this L3_L4 filter, refer to enet_l3l4_filter_enum
                only one parameter can be selected which is shown as below
      \arg            L3L4_FILTER0: L3/L4 filter 0
      \arg            L3L4_FILTER1: L3/L4 filter 1
      \arg            L3L4_FILTER2: L3/L4 filter 2
      \arg            L3L4_FILTER3: L3/L4 filter 3
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_l3l4_filter_dmach_select(enet_l3l4_filter_enum filter, enet_dmach_enum dmach)
{
    switch(filter) {
    case L3L4_FILTER0:
        ENET_MAC_L3_L4_CONTROL0 |= ENET_MAC_L3_L4_CONTROL_DMCHEN0;
        ENET_MAC_L3_L4_CONTROL0 |= MAC_L3_L4_CONTROL_DMCHN0(dmach);
        break;
    case L3L4_FILTER1:
        ENET_MAC_L3_L4_CONTROL1 |= ENET_MAC_L3_L4_CONTROL_DMCHEN0;
        ENET_MAC_L3_L4_CONTROL1 |= MAC_L3_L4_CONTROL_DMCHN0(dmach);
        break;
    case L3L4_FILTER2:
        ENET_MAC_L3_L4_CONTROL2 |= ENET_MAC_L3_L4_CONTROL_DMCHEN0;
        ENET_MAC_L3_L4_CONTROL2 |= MAC_L3_L4_CONTROL_DMCHN0(dmach);
        break;
    case L3L4_FILTER3:
        ENET_MAC_L3_L4_CONTROL3 |= ENET_MAC_L3_L4_CONTROL_DMCHEN0;
        ENET_MAC_L3_L4_CONTROL3 |= MAC_L3_L4_CONTROL_DMCHN0(dmach);
        break;
    default:
        break;
    }
}

/*!
    \brief    config the L3_L4 filter related function
    \param[in]  filter: choose the channel number for the packet that is passed by this L3_L4 filter, refer to enet_l3l4_filter_enum
                only one parameter can be selected which is shown as below
      \arg            L3L4_FILTER0: L3/L4 filter 0
      \arg            L3L4_FILTER1: L3/L4 filter 1
      \arg            L3L4_FILTER2: L3/L4 filter 2
      \arg            L3L4_FILTER3: L3/L4 filter 3
    \param[in]  function: the related configuration of L3_L4 filter
                only one parameter can be selected which is shown as below
      \arg            ENET_L4_DEST_PORT_NORMAL_MATCH: the layer 4 destination port number field is configurated for matching
      \arg            ENET_L4_DEST_PORT_INVERSE_MATCH: the layer 4 destination port number field is configurated for inverse matching
      \arg            ENET_L4_SRC_PORT_NORMAL_MATCH_ENABLE: the layer 4 source port number field is configurated for matching
      \arg            ENET_L4_SRC_PORT_INVERSE_MATCH_ENABLE: the layer 4 source port number field is configurated for inverse matching
      \arg            ENET_L4_PROTOCOL_MATCH_UDP: the source and destination port number fields of UDP packets are used for matching
      \arg            ENET_L3_DEST_IPADDR_NORMAL_MATCH: the layer 3 IP destination address field is configurated for matching
      \arg            ENET_L3_DEST_IPADDR_INVERSE_MATCH: the layer 3 IP destination address field is configurated for inverse matching
      \arg            ENET_L3_SRC_IPADDR_NORMAL_MATCH: the Layer 3 IP source address field is configurated for matching
      \arg            ENET_L3_SRC_IPADDR_INVERSE_MATCH: the layer 3 IP source address field is configurated for inverse matching
      \arg            ENET_L3_PROTOCOL_MATCH_IPV6: the layer 3 IP source or destination address matching is configurated for IPv6 packets
    \param[in]  status: the status of L3L4_FILTERx
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: enable
      \arg        DISABLE: disable
    \param[out] none
    \retval     none
*/
void enet_l3l4_filter_config(enet_l3l4_filter_enum filter, uint32_t function, ControlStatus status)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_L3_L4_FILTER_CFG(function)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x008AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if(ENABLE == status) {
    switch(filter) {
    case L3L4_FILTER0:
        ENET_MAC_L3_L4_CONTROL0 |= function;
        break;
    case L3L4_FILTER1:
        ENET_MAC_L3_L4_CONTROL1 |= function;
        break;
    case L3L4_FILTER2:
        ENET_MAC_L3_L4_CONTROL2 |= function;
        break;
    case L3L4_FILTER3:
        ENET_MAC_L3_L4_CONTROL3 |= function;
        break;
    default:
        break;
    }
    } else {
        switch(filter) {
    case L3L4_FILTER0:
        ENET_MAC_L3_L4_CONTROL0 &= ~function;
        break;
    case L3L4_FILTER1:
        ENET_MAC_L3_L4_CONTROL1 &= ~function;
        break;
    case L3L4_FILTER2:
        ENET_MAC_L3_L4_CONTROL2 &= ~function;
        break;
    case L3L4_FILTER3:
        ENET_MAC_L3_L4_CONTROL3 &= ~function;
        break;
    default:
        break;
    }
    }
}
}

/*!
    \brief     set the L4 filter port number
    \param[in]  filter: choose the channel number for the packet that is passed by this L3_L4 filter, refer to enet_l3l4_filter_enum
                only one parameter can be selected which is shown as below
      \arg            L3L4_FILTER0: L3/L4 filter 0
      \arg            L3L4_FILTER1: L3/L4 filter 1
      \arg            L3L4_FILTER2: L3/L4 filter 2
      \arg            L3L4_FILTER3: L3/L4 filter 3
    \param[in]  src_port: the source port number of L4 filter
    \param[in]  dst_port: the destinstion port number of L4 filter
    \param[out] none
    \retval     none
*/
void enet_l4_port_num_set(enet_l3l4_filter_enum filter, uint16_t src_port, uint16_t dst_port)
{
    switch(filter) {
    case L3L4_FILTER0:
        ENET_MAC_LAYER4_ADDRESS0 = MAC_LAYER4_ADDRESS_L4DP0(dst_port)|MAC_LAYER4_ADDRESS_L4SP0(src_port);
        break;
    case L3L4_FILTER1:
        ENET_MAC_LAYER4_ADDRESS1 = MAC_LAYER4_ADDRESS_L4DP0(dst_port)|MAC_LAYER4_ADDRESS_L4SP0(src_port);
        break;
    case L3L4_FILTER2:
        ENET_MAC_LAYER4_ADDRESS2 = MAC_LAYER4_ADDRESS_L4DP0(dst_port)|MAC_LAYER4_ADDRESS_L4SP0(src_port);
        break;
    case L3L4_FILTER3:
        ENET_MAC_LAYER4_ADDRESS3 = MAC_LAYER4_ADDRESS_L4DP0(dst_port)|MAC_LAYER4_ADDRESS_L4SP0(src_port);
        break;
    default:
        break;
    }
}

/*!
    \brief     configure L3 filter IPv4 address
    \param[in]  filter: choose the channel number for the packet that is passed by this L3_L4 filter, refer to enet_l3l4_filter_enum
                only one parameter can be selected which is shown as below
      \arg            L3L4_FILTER0: L3/L4 filter 0
      \arg            L3L4_FILTER1: L3/L4 filter 1
      \arg            L3L4_FILTER2: L3/L4 filter 2
      \arg            L3L4_FILTER3: L3/L4 filter 3
    \param[in]  src_ipaddr: the source ipaddr of L3 filter
    \param[in]  dst_ipaddr: the destinstion ipaddr of L3 filter
    \param[out] none
    \retval     none
*/
void enet_l3_ipv4_address_set(enet_l3l4_filter_enum filter, uint8_t src_ipaddr[], uint8_t dst_ipaddr[])
{
    uint32_t src_ip, dst_ip;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(src_ipaddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x008CU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dst_ipaddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x008CU), ERR_PARAM_POINTER);
    } else 
#endif /* FW_DEBUG_ERR_REPORT */
{
    src_ip = ENET_SET_IPV4ADDR(src_ipaddr);
    dst_ip = ENET_SET_IPV4ADDR(dst_ipaddr);
    switch(filter) {
    case L3L4_FILTER0:
        ENET_MAC_LAYER3_ADDR0_REG0 = src_ip;
        ENET_MAC_LAYER3_ADDR1_REG0 = dst_ip;
        break;
    case L3L4_FILTER1:
        ENET_MAC_LAYER3_ADDR0_REG1 = src_ip;
        ENET_MAC_LAYER3_ADDR1_REG1 = dst_ip;
        break;
    case L3L4_FILTER2:
        ENET_MAC_LAYER3_ADDR0_REG2 = src_ip;
        ENET_MAC_LAYER3_ADDR1_REG2 = dst_ip;
        break;
    case L3L4_FILTER3:
        ENET_MAC_LAYER3_ADDR0_REG3 = src_ip;
        ENET_MAC_LAYER3_ADDR1_REG3 = dst_ip;
        break;
    default:
        break;
    }
}
}

/*!
    \brief     configure L3 filter IPv6 address
    \param[in]  filter: choose the channel number for the packet that is passed by this L3_L4 filter, refer to enet_l3l4_filter_enum
                only one parameter can be selected which is shown as below
      \arg            L3L4_FILTER0: L3/L4 filter 0
      \arg            L3L4_FILTER1: L3/L4 filter 1
      \arg            L3L4_FILTER2: L3/L4 filter 2
      \arg            L3L4_FILTER3: L3/L4 filter 3
    \param[in]  ipaddr: the ipv6 addr of L3 filter
    \param[out] none
    \retval     none
*/
void enet_l3_ipv6_address_set(enet_l3l4_filter_enum filter, uint32_t ipaddr[])
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(ipaddr)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x008DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(filter) {
    case L3L4_FILTER0:
        ENET_MAC_LAYER3_ADDR0_REG0 = ipaddr[0];
        ENET_MAC_LAYER3_ADDR1_REG0 = ipaddr[1];
        ENET_MAC_LAYER3_ADDR2_REG0 = ipaddr[2];
        ENET_MAC_LAYER3_ADDR3_REG0 = ipaddr[3];
        break;
    case L3L4_FILTER1:
        ENET_MAC_LAYER3_ADDR0_REG1 = ipaddr[0];
        ENET_MAC_LAYER3_ADDR1_REG1 = ipaddr[1];
        ENET_MAC_LAYER3_ADDR2_REG1 = ipaddr[2];
        ENET_MAC_LAYER3_ADDR3_REG1 = ipaddr[3];
        break;
    case L3L4_FILTER2:
        ENET_MAC_LAYER3_ADDR0_REG2 = ipaddr[0];
        ENET_MAC_LAYER3_ADDR1_REG2 = ipaddr[1];
        ENET_MAC_LAYER3_ADDR2_REG2 = ipaddr[2];
        ENET_MAC_LAYER3_ADDR3_REG2 = ipaddr[3];
        break;
    case L3L4_FILTER3:
        ENET_MAC_LAYER3_ADDR0_REG3 = ipaddr[0];
        ENET_MAC_LAYER3_ADDR1_REG3 = ipaddr[1];
        ENET_MAC_LAYER3_ADDR2_REG3 = ipaddr[2];
        ENET_MAC_LAYER3_ADDR3_REG3 = ipaddr[3];
        break;
    default:
        break;
    }
}
}

