sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
/*!
    \brief    get the bit flag of ENET DMA descriptor
    \param[in]  desc: the descriptor pointer which users want to get flag
    \param[in]  desc_flag: the bit flag of ENET DMA descriptor
                only one parameter can be selected which is shown as below
      \arg        ENET_NORMAL_TDES3_WF_IHE: IP header error
      \arg        ENET_NORMAL_TDES3_WF_DB: deferred
      \arg        ENET_NORMAL_TDES3_WF_UF: underflow error
      \arg        ENET_NORMAL_TDES3_WF_ED: excessive deferral
      \arg        ENET_NORMAL_TDES3_WF_EC: excessive collision
      \arg        ENET_NORMAL_TDES3_WF_LC: late collision
      \arg        ENET_NORMAL_TDES3_WF_NC: no carrier
      \arg        ENET_NORMAL_TDES3_WF_LOC: loss of carrier
      \arg        ENET_NORMAL_TDES3_WF_PCE: IP payload checksum error
      \arg        ENET_NORMAL_TDES3_WF_FF: frame flushed
      \arg        ENET_NORMAL_TDES3_WF_JT: jabber timeout
      \arg        ENET_NORMAL_TDES3_WF_ES: error summary
      \arg        ENET_NORMAL_TDES3_WF_TTSS: transmit timestamp status
      \arg        ENET_NORMAL_TDES3_WF_DE: descriptor error
      \arg        ENET_NORMAL_TDES3_WF_FD: first segment
      \arg        ENET_NORMAL_TDES3_WF_LD: last segment
      \arg        ENET_NORMAL_TDES3_WF_CTXT: context type
      \arg        ENET_NORMAL_TDES3_WF_OWN: own bit
      \arg        ENET_NORMAL_RDES3_WF_ES: error summary
      \arg        ENET_NORMAL_RDES3_WF_DE: dribble bit error
      \arg        ENET_NORMAL_RDES3_WF_RE: receive error
      \arg        ENET_NORMAL_RDES3_WF_OE: overflow error
      \arg        ENET_NORMAL_RDES3_WF_RWT: receive watchdog timeout
      \arg        ENET_NORMAL_RDES3_WF_GP: giant packet
      \arg        ENET_NORMAL_RDES3_WF_CE: CRC error
      \arg        ENET_NORMAL_RDES3_WF_RS0V: receive status RDES0 valid
      \arg        ENET_NORMAL_RDES3_WF_RS1V: receive status RDES1 valid
      \arg        ENET_NORMAL_RDES3_WF_RS2V: receive status RDES2 valid
      \arg        ENET_NORMAL_RDES3_WF_LD: last descriptor
      \arg        ENET_NORMAL_RDES3_WF_FD: first descriptor
      \arg        ENET_NORMAL_RDES3_WF_CTXT: context type
      \arg        ENET_NORMAL_RDES3_WF_OWN: own bit
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus enet_desc_flag_get(enet_descriptors_struct *desc, uint32_t desc_flag)
{
    FlagStatus enet_flag = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(desc)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x008EU), ERR_PARAM_POINTER);
    } else if(NOT_ENET_DESC_FLAG_GET(desc_flag)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x008EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if((uint32_t)RESET != (desc->DES3 & desc_flag)) {
        enet_flag = SET;
    } else {
    
    }
}
    return enet_flag;
}

/*!
    \brief    set the bit flag of ENET DMA descriptor
    \param[in]  desc: the descriptor pointer which users want to set flag
    \param[in]  desc_flag: the bit flag of ENET DMA descriptor
                only one parameter can be selected which is shown as below
      \arg        ENET_NORMAL_TDES3_RF_FD: first segment
      \arg        ENET_NORMAL_TDES3_RF_LD: last segment
      \arg        ENET_NORMAL_TDES3_RF_CTXT: context type
      \arg        ENET_NORMAL_TDES3_RF_OWN: own bit
      \arg        ENET_NORMAL_RDES3_RF_OWN: descriptor available
      \arg        ENET_NORMAL_RDES3_RF_IOC: interrupt on completion
      \arg        ENET_NORMAL_RDES3_RF_BUF1V: buffer 1 address valid
      \arg        ENET_NORMAL_RDES3_RF_BUF2V: buffer 2 address valid
    \param[out] none
    \retval     none
*/
void enet_desc_flag_set(enet_descriptors_struct *desc, uint32_t desc_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(desc)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x008FU), ERR_PARAM_POINTER);
    } else if(NOT_ENET_DESC_FLAG_SET(desc_flag)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x008FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    desc->DES3 |= desc_flag;
}
}

/*!
    \brief    clear the bit flag of ENET DMA descriptor
    \param[in]  desc: the descriptor pointer which users want to clear flag
    \param[in]  desc_flag: the bit flag of ENET DMA descriptor
                only one parameter can be selected which is shown as below
      \arg        ENET_NORMAL_TDES3_RF_FD: first segment
      \arg        ENET_NORMAL_TDES3_RF_LD: last segment
      \arg        ENET_NORMAL_TDES3_RF_CTXT: context type
      \arg        ENET_NORMAL_TDES3_RF_OWN: own bit
      \arg        ENET_NORMAL_RDES3_RF_OWN: descriptor available
      \arg        ENET_NORMAL_RDES3_RF_IOC: interrupt on completion
      \arg        ENET_NORMAL_RDES3_RF_BUF1V: buffer 1 address valid
      \arg        ENET_NORMAL_RDES3_RF_BUF2V: buffer 2 address valid
    \param[out] none
    \retval     none
*/
void enet_desc_flag_clear(enet_descriptors_struct *desc, uint32_t desc_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(desc)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0090U), ERR_PARAM_POINTER);
    } else if(NOT_ENET_DESC_FLAG_SET(desc_flag)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0090U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    desc->DES3 &= ~desc_flag;
}
}

/*!
    \brief    drop current receive frame
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[out] none
    \retval     none
*/
void enet_rxframe_drop(enet_dmach_enum dmach)
{

    switch(dmach) {
    /* enable reception, descriptor is owned by DMA */
    case DMACH0:
        dma_current_rxdesc->DES3 = ENET_NORMAL_RDES3_WF_OWN;
        dma_current_rxdesc->DES0 = (uint32_t)dma_current_rxdesc->buffer_address;
        dma_current_rxdesc->DES3 |= ENET_NORMAL_RDES3_RF_BUF1V;
    
