sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
        /* If the receive interrupt is enabled, the IOC bit needs to be set */
        if((uint32_t)RESET != (ENET_DMA_CH0_INTERRUPT_ENABLE & ENET_DMA_CH_INTERRUPT_ENABLE_RIE)) {
            dma_current_rxdesc->DES3 |= ENET_NORMAL_RDES3_RF_IOC;
        }
        __DSB();
        __ISB();
        __DMB();

        /* update the current RxDMA descriptor pointer to the next decriptor in RxDMA decriptor table */
        /* ring mode */
        if((enet_descriptors_struct *)(uint32_t)&rxdesc_tab[(ENET_RXBUF_NUM - 1U)] == dma_current_rxdesc) {
        /* if is the last descriptor in table, the next descriptor is the table header */
        dma_current_rxdesc = (enet_descriptors_struct *)(ENET_DMA_CH0_RXDESC_ADDRESS);
        } else {
        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
        dma_current_rxdesc = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc + ETH_DMARXDESC_SIZE);
        }
        ENET_DMA_CH0_RXDESC_TAIL_POINTER = (uint32_t)&rxdesc_tab[ENET_RXBUF_NUM];
        break;

    case DMACH1:
        dma_current_rxdesc1->DES3 = ENET_NORMAL_RDES3_WF_OWN;
        dma_current_rxdesc1->DES0 = (uint32_t)dma_current_rxdesc1->buffer_address;
        dma_current_rxdesc1->DES3 |= ENET_NORMAL_RDES3_RF_BUF1V;
    
        /* If the receive interrupt is enabled, the IOC bit needs to be set */
        if((uint32_t)RESET != (ENET_DMA_CH1_INTERRUPT_ENABLE & ENET_DMA_CH_INTERRUPT_ENABLE_RIE)) {
            dma_current_rxdesc1->DES3 |= ENET_NORMAL_RDES3_RF_IOC;
        }
        __DSB();
        __ISB();
        __DMB();

        /* update the current RxDMA descriptor pointer to the next decriptor in RxDMA decriptor table */
        /* ring mode */
        if((enet_descriptors_struct *)(uint32_t)&rxdesc_tab1[(ENET_RXBUF_NUM - 1U)] == dma_current_rxdesc1) {
            /* if is the last descriptor in table, the next descriptor is the table header */
            dma_current_rxdesc1 = (enet_descriptors_struct *)(ENET_DMA_CH1_RXDESC_ADDRESS);
        } else {
                /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                dma_current_rxdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc1 + ETH_DMARXDESC_SIZE);
        }
        ENET_DMA_CH1_RXDESC_TAIL_POINTER = (uint32_t)&rxdesc_tab1[ENET_RXBUF_NUM];
        break;
    default:
        break;
    }
}

/*!
    \brief    enable DMA feature
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  feature: the feature of DMA mode
                one or more parameters can be selected which are shown as below
      \arg        ENET_FLUSH_RXFRAME: RxDMA does flushes frames function
      \arg        ENET_SECONDFRAME_OPT: TxDMA controller operate on second frame function
    \param[out] none
    \retval     none
*/
void enet_dma_feature_enable(enet_dmach_enum dmach, uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_DMA_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0092U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0:
        if(ENET_FLUSH_RXFRAME == feature) {
            ENET_DMA_CH0_RX_CONTROL |= ENET_DMA_CH_RX_CONTROL_RPF;
        } else {
            ENET_DMA_CH0_TX_CONTROL |= ENET_DMA_CH_TX_CONTROL_OSF;
        }
        break;
    case DMACH1:
        if(ENET_FLUSH_RXFRAME == feature) {
            ENET_DMA_CH1_RX_CONTROL |= ENET_DMA_CH_RX_CONTROL_RPF;
        } else {
            ENET_DMA_CH1_TX_CONTROL |= ENET_DMA_CH_TX_CONTROL_OSF;
        }
        break;
    default:
        break;
    }
}
}

/*!
    \brief    disable DMA feature
    \param[in]  dmach: choose the channel of dma process which users want to check, refer to enet_dmach_enum
                only one parameter can be selected which is shown as below
      \arg        DMACH0: dma channel 0
      \arg        DMACH1: dma channel 1
    \param[in]  feature: the feature of DMA mode
                one or more parameters can be selected which are shown as below
      \arg        ENET_FLUSH_RXFRAME: RxDMA does flushes frames function
      \arg        ENET_SECONDFRAME_OPT: TxDMA controller operate on second frame function
    \param[out] none
    \retval     none
*/
void enet_dma_feature_disable(enet_dmach_enum dmach, uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_ENET_DMA_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0093U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(dmach) {
    case DMACH0:
        if(ENET_FLUSH_RXFRAME == feature) {
            ENET_DMA_CH0_RX_CONTROL &= ~ ENET_DMA_CH_RX_CONTROL_RPF;
        } else {
            ENET_DMA_CH0_TX_CONTROL &= ~ ENET_DMA_CH_TX_CONTROL_OSF;
        }
        break;
    case DMACH1:
        if(ENET_FLUSH_RXFRAME == feature) {
            ENET_DMA_CH1_RX_CONTROL &= ~ ENET_DMA_CH_RX_CONTROL_RPF;
        } else {
            ENET_DMA_CH1_TX_CONTROL &= ~ ENET_DMA_CH_TX_CONTROL_OSF;
        }
        break;
    default:
        break;
    }
}
}

/*!
    \brief    wakeup packet filter register pointer reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_pmt_filter_register_pointer_reset(void)
{
    ENET_MAC_PMT_CONTROL_STATUS |= ENET_MAC_PMT_CONTROL_STATUS_RWKFILTRST;
}

/*!
    \brief    get the current value of the wakeup Packet Filter register pointer
    \param[in]  none
    \param[out] none
    \retval     wkp_pointer: the register current pointer
*/
uint32_t enet_pmt_filter_register_pointer_get(void)
{
    uint32_t wkp_pointer;

    wkp_pointer = (uint32_t)GET_MAC_PMT_CONTROL_RWKPTR(ENET_MAC_PMT_CONTROL_STATUS);
    return wkp_pointer;
}

/*!
    \brief    set the remote wakeup packet registers
    \param[in]  pdata: pointer to buffer data which is written to remote wakeup packet registers (8 words total)
    \param[out] none
    \retval     none
*/
void enet_pmt_filter_config(uint32_t pdata[])
{
    uint32_t num;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(pdata)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0096U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    enet_pmt_filter_register_pointer_reset();
    /* configure ENET_MAC_RWFF register */
    for(num = 0U; num < ENET_WAKEUP_PACKET_REGISTER_LENGTH; num++) {
        ENET_MAC_RWK_PACKET_FILTER = pdata[num];
    }
}
}

/*!
    \brief    enable wakeup management features
    \param[in]  feature: the wake up type which is selected
                one or more parameters can be selected which are shown as below
      \arg        MAC_PMT_POWER_DOWN: power down mode
      \arg        MAC_PMT_MAGIC_PACKET_FRAME: enable a wakeup event due to magic packet reception
      \arg        MAC_PMT_WAKE_UP_FRAME: enable a wakeup event due to wakeup frame reception
      \arg        MAC_PMT_WAKE_UP_FRAME_FORWARD: enable remote wakeup frame forwarding
      \arg        MAC_PMT_GLOBAL_UNICAST: any received unicast frame passed filter is considered to be a wakeup frame
    \param[out] none
    \retval     none
*/
void enet_pmt_feature_enable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_PMT_ENABLE_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0097U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_PMT_CONTROL_STATUS |= feature;
}
}

/*!
    \brief    disable wakeup management features
    \param[in]  feature: the wake up type which is selected
                one or more parameters can be selected which are shown as below
      \arg        MAC_PMT_MAGIC_PACKET_FRAME: enable a wakeup event due to magic packet reception
      \arg        MAC_PMT_WAKE_UP_FRAME: enable a wakeup event due to wakeup frame reception
      \arg        MAC_PMT_GLOBAL_UNICAST: any received unicast frame passed filter is considered to be a wakeup frame
    \param[out] none
    \retval     none
*/
void enet_pmt_feature_disable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_PMT_DISABLE_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0098U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_PMT_CONTROL_STATUS &= (~feature);
}
}

/*!
    \brief      set this counter so that the number of clock cycles of CSR clock is 1us
    \param[in]  tick: the tick counter value(0 - 0xFFF)
    \param[out] none
    \retval     none
*/
void enet_eee_ustick_set(uint32_t tick)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_US_TICK(tick)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x0099U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_1US_TIC_COUNTER = (uint32_t)(tick & ENET_MAC_1US_TIC_COUNTER_TIC_1US_CNTR);
}
}

/*!
    \brief      set the value of LPI ralated timers
    \param[in]  type: choose the timer type, refer to enet_lpitimer_enum
                only one parameter can be selected which is shown as below
      \arg        LPI_LS_TIMER: lpi ls timer
      \arg        LPI_TW_TIMER: lpi tw timer
      \arg        LPI_ENTRY_TIMER: lpi entry timer
    \param[in]  val: the timer value(in milliseconds)
    \param[out] none
    \retval     none
*/
void enet_eee_lpi_timer_set(enet_lpitimer_enum type, uint32_t val)
{
    uint32_t entry_val;
#ifdef FW_DEBUG_ERR_REPORT
    if((type == LPI_LS_TIMER)&& NOT_ENET_LPI_LS_TIMER_VALUE(val)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x009AU), ERR_PARAM_OUT_OF_RANGE);
    } else if((type == LPI_TW_TIMER)&& NOT_ENET_LPI_TW_TIMER_VALUE(val)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x009AU), ERR_PARAM_OUT_OF_RANGE);
    } else if((type == LPI_ENTRY_TIMER)&& NOT_ENET_LPI_ENTRY_TIMER_VALUE(val)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x009AU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    entry_val = val / 8U;
    switch(type) {
    case(LPI_TW_TIMER):
        ENET_MAC_LPI_TIMERS_CONTROL &= ~ENET_MAC_LPI_TIMERS_CONTROL_TWT;
        ENET_MAC_LPI_TIMERS_CONTROL |= MAC_LPI_TIMERS_CONTROL_TWT(val);
        break;
    case(LPI_LS_TIMER):
        ENET_MAC_LPI_TIMERS_CONTROL &= ~ENET_MAC_LPI_TIMERS_CONTROL_LST;
        ENET_MAC_LPI_TIMERS_CONTROL |= MAC_LPI_TIMERS_CONTROL_LST(val);
        break;
    case(LPI_ENTRY_TIMER):
        ENET_MAC_LPI_ENTRY_TIMER &= ~ENET_MAC_LPI_ENTRY_TIMER_LPIET;
        ENET_MAC_LPI_ENTRY_TIMER |= MAC_LPI_ENTRY_TIMER_LPIET(entry_val);
        break;
    default:
        break;
    }
}
}

/*!
    \brief    enable energy efficient ethernet features
    \param[in]  feature: the wake up type which is selected
                only one parameter can be selected which are shown as below
      \arg        ENET_LPI_TXCLK_STOP: LPI Tx Clock Stop Enable
      \arg        ENET_LPI_TIMER: LPI Timer Enable
      \arg        ENET_LPI_TXAUTOMATE: LPI Tx Automate
      \arg        ENET_LPI_PHYLINK_UP: PHY Link Status Enable
      \arg        ENET_LPI_ENABLE: LPI Enable
      \arg        ENET_LPI_TRANSMIT_AUTO_ENTRY: the MAC enters the LPI mode only after all outstanding packetsand pending packets have been transmitted
      \arg        ENET_LPI_TRANSMIT_AUTO_ENTRY_WITH_TIMER: the MAC transmitter enters LPI state only when the complete MAC TX data path is IDLE for a period indicated by the MAC_LPI_Entry_Timer register
    \param[out] none
    \retval     none
*/
void enet_eee_lpi_feature_enable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_LPI_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x009BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_LPI_CONTROL_STATUS |= feature;
}
}

/*!
    \brief    disable energy efficient ethernet features
    \param[in]  feature: the wake up type which is selected
                only one parameter can be selected which are shown as below
      \arg        ENET_LPI_TXCLK_STOP: LPI Tx clock stop enable
      \arg        ENET_LPI_TIMER: LPI timer enable
      \arg        ENET_LPI_TXAUTOMATE: LPI Tx automate
      \arg        ENET_LPI_PHYLINK_UP: phy link status enable
      \arg        ENET_LPI_ENABLE: LPI enable
      \arg        ENET_LPI_TRANSMIT_AUTO_ENTRY: the MAC enters the LPI mode only after all outstanding packetsand pending packets have been transmitted
      \arg        ENET_LPI_TRANSMIT_AUTO_ENTRY_WITH_TIMER: the MAC transmitter enters LPI state only when the complete MAC TX data path is IDLE for a period indicated by the MAC_LPI_Entry_Timer register
    \param[out] none
    \retval     none
*/
void enet_eee_lpi_feature_disable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_LPI_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x009CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_LPI_CONTROL_STATUS &= (~feature);
}
}

/*!
    \brief      get lpi state
    \param[in]  state: lpi state
      \arg        ENET_LPI_RX_STATE: receive LPI state
      \arg        ENET_LPI_TX_STATE: transmit LPI state
      \arg        ENET_LPI_RX_EXIT: receive LPI exit
      \arg        ENET_LPI_RX_ENTRY: receive LPI entry
      \arg        ENET_LPI_TX_EXIT: transmit LPI exit
      \arg        ENET_LPI_TX_ENTRY: transmit LPI entry
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus enet_lpi_status_get(uint16_t state)
{
    FlagStatus flag;
    flag = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_LPI_STATUS(state)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x009DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if(0U != (ENET_MAC_LPI_CONTROL_STATUS & state)) {
        flag = SET;
    } else {
        flag = RESET;
    }
}
    return flag;
}

/*!
    \brief    get LPI related counter
    \param[in]  counter: MSC counters which is selected, refer to enet_lpi_counter_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_TX_LPI_USEC_COUNTER_VAL: transmit LPI microseconds counter
      \arg        ENET_TX_LPI_TRAN_COUNTER_VAL: transmit LPI transition counter
      \arg        ENET_RX_LPI_USEC_COUNTER_VAL: receive LPI microseconds counter
      \arg        ENET_RX_LPI_TRAN_COUNTER_VAL: receive LPI transition counter
    \param[out] none
    \retval     the LPI counter value
*/
uint32_t enet_lpi_counters_get(enet_lpi_counter_enum counter)
{
    uint32_t reval;

    reval = REG32((ENET + (uint32_t)counter));

    return reval;
}

/*!
    \brief    reset the MAC statistics counters
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_mmc_counters_reset(void)
{
    /* reset all counters */
    ENET_MMC_CONTROL |= ENET_MMC_CONTROL_CNTRST;
}

/*!
    \brief    enable the MAC statistics counter features
    \param[in]  feature: the feature of MAC statistics counter
                one or more parameters can be selected which are shown as below
      \arg        ENET_MMC_DROPPED_BROADCAST_UPDATE: update MMC counters for dropped broadcast packets
      \arg        ENET_MMC_COUNTER_STOP_ROLLOVER: counter stop rollover
      \arg        ENET_MMC_RESET_ON_READ: reset on read
      \arg        ENET_MMC_COUNTERS_FREEZE: MMC counter freeze
    \param[out] none
    \retval     none
*/
void enet_mmc_feature_enable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_MMC_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00A0U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MMC_CONTROL |= feature;
}
}

/*!
    \brief    disable the MAC statistics counter features
    \param[in]  feature: the feature of MAC statistics counter
                one or more parameters can be selected which are shown as below
      \arg        ENET_MMC_DROPPED_BROADCAST_UPDATE: update MMC counters for dropped broadcast packets
      \arg        ENET_MSC_COUNTER_STOP_ROLLOVER: counter stop rollover
      \arg        ENET_MSC_RESET_ON_READ: reset on read
      \arg        ENET_MSC_COUNTERS_FREEZE: MSC counter freeze
    \param[out] none
    \retval     none
*/
void enet_mmc_feature_disable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_MMC_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00A1U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MMC_CONTROL &= (~feature);
}
}

/*!
    \brief    configure MAC statistics counters preset mode
    \param[in]  mode: MMC counters preset mode, refer to enet_mmc_preset_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MMC_PRESET_NONE: do not preset MMC counter
      \arg        ENET_MMC_PRESET_HALF: preset all MMC counters to almost-half(0x7FFF FFF0) value
      \arg        ENET_MMC_PRESET_FULL: preset all MMC counters to almost-full(0xFFFF FFF0) value
    \param[out] none
    \retval     none
*/
void enet_mmc_counters_preset_config(enet_mmc_preset_enum mode)
{
    ENET_MMC_CONTROL &= ENET_MMC_PRESET_MASK;
    ENET_MMC_CONTROL |= (uint32_t)mode;
}

