sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
/*!
    \brief    get MAC statistics counter
    \param[in]  counter: MSC counters which is selected, refer to enet_mmc_counter_enum
                only one parameter can be selected which is shown as below
      \arg        ENET_MMC_TX_OCTET_COUNT_GOOD_BAD: ethernet transmit octet count good bad counter
      \arg        ENET_MMC_TX_PACKET_COUNT_GOOD_BAD:  ethernet transmit packet count good bad counter
      \arg        ENET_MMC_TX_BROADCAST_PACKETS_GOOD: ethernet transmit broadcast packets good counter
      \arg        ENET_MMC_TX_MULTICAST_PACKETS_GOOD: ethernet transmit multicast packets good counter
      \arg        ENET_MMC_TX_64OCTETS_PACKETS_GOOD_BAD: ethernet transmit 64 octet packets good bad counter
      \arg        ENET_MMC_TX_65TO127OCTETS_PACKETS_GOOD_BAD: ethernet transmit 65 to 127 octet packets good bad counter
      \arg        ENET_MMC_TX_128TO255OCTETS_PACKETS_GOOD_BAD: ethernet transmit 128 to 255 octet packets good bad counter
      \arg        ENET_MMC_TX_256TO511OCTETS_PACKETS_GOOD_BAD: ethernet transmit 256 to 511 octet packets good bad counter
      \arg        ENET_MMC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD: ethernet transmit 512 to 1023 octet packets good bad counter
      \arg        ENET_MMC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD: ethernet transmit 1024 to max octet packets good bad counter
      \arg        ENET_MMC_TX_UNICAST_PACKETS_GOOD_BAD: ethernet transmit unicast packets good bad counter
      \arg        ENET_MMC_TX_MULTICAST_PACKETS_GOOD_BAD: ethernet transmit multicast packets good bad counter
      \arg        ENET_MMC_TX_BROADCAST_PACKETS_GOOD_BAD: ethernet transmit broadcast packets good bad counter
      \arg        ENET_MMC_TX_UNDERFLOW_ERROR_PACKETS: ethernet transmit underflow error packets counter
      \arg        ENET_MMC_TX_SINGLE_COLLISION_GOOD_PACKETS: ethernet transmit single collision good packets counter
      \arg        ENET_MMC_TX_MULTIPLE_COLLISION_GOOD_PACKETS: ethernet transmit multiple collision good packets counter
      \arg        ENET_MMC_TX_DEFERRED_PACKETS: ethernet transmit deferred packets counter
      \arg        ENET_MMC_TX_LATE_COLLISION_PACKETS: ethernet transmit late collision packets counter
      \arg        ENET_MMC_TX_EXCESSIVE_COLLISION_PACKETS: ethernet transmit excessive collision packets counter
      \arg        ENET_MMC_TX_CARRIER_ERROR_PACKETS: ethernet transmit carrier error packets counter
      \arg        ENET_MMC_TX_OCTET_COUNT_GOOD: ethernet transmit octet count good counter
      \arg        ENET_MMC_TX_PACKET_COUNT_GOOD: ethernet transmit packet count good counter
      \arg        ENET_MMC_TX_EXCESSIVE_DEFERRAL_ERROR: ethernet transmit excessive deferral error counter
      \arg        ENET_MMC_TX_PAUSE_PACKETS: ethernet transmit pause packets counter
      \arg        ENET_MMC_TX_VLAN_PACKETS_GOOD: ethernet transmit vlan packets good counter
      \arg        ENET_MMC_TX_OSIZE_PACKETS_GOOD: ethernet transmit oversize packets good counter
      \arg        ENET_MMC_RX_PACKETS_COUNT_GOOD_BAD: ethernet receive packet count good bad counter
      \arg        ENET_MMC_RX_OCTET_COUNT_GOOD_BAD: ethernet receive octet count good bad counter
      \arg        ENET_MMC_RX_OCTET_COUNT_GOOD: ethernet receive octet count good counter
      \arg        ENET_MMC_RX_BROADCAST_PACKETS_GOOD: ethernet receive broadcast packets good counter
      \arg        ENET_MMC_RX_MULTICAST_PACKETS_GOOD: ethernet receive multicast packets good counter
      \arg        ENET_MMC_RX_CRC_ERROR_PACKETS: ethernet receive crc error packets counter
      \arg        ENET_MMC_RX_ALIGNMENT_ERROR_PACKETS: ethernet receive alignment error packets counter
      \arg        ENET_MMC_RX_RUNT_ERROR_PACKETS: ethernet receive runt error packets counter
      \arg        ENET_MMC_RX_JABBER_ERROR_PACKETS: ethernet receive jabber error packets counter
      \arg        ENET_MMC_RX_UNDERSIZE_PACKETS_GOOD: ethernet receive undersize packets good counter
      \arg        ENET_MMC_RX_OVERSIZE_PACKETS_GOOD: ethernet receive oversize packets good counter
      \arg        ENET_MMC_RX_64OCTETS_PACKETS_GOOD_BAD: ethernet receive 64 octet packets good bad counter
      \arg        ENET_MMC_RX_65TO127OCTETS_PACKETS_GOOD_BAD: ethernet receive 65 to 127 octet packets good bad counter
      \arg        ENET_MMC_RX_128TO255OCTETS_PACKETS_GOOD_BAD: ethernet receive 128 to 255 octet packets good bad counter
      \arg        ENET_MMC_RX_256TO511OCTETS_PACKETS_GOOD_BAD: ethernet receive 256 to 511 octet packets good bad counter
      \arg        ENET_MMC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD: ethernet receive 512 to 1023 octet packets good bad counter
      \arg        ENET_MMC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD: ethernet receive 1024 to max octet packets good bad counter
      \arg        ENET_MMC_RX_UNICAST_PACKETS_GOOD: ethernet receive unicast packets good counter
      \arg        ENET_MMC_RX_LENGTH_ERROR_PACKETS: ethernet receive length error packets counter
      \arg        ENET_MMC_RX_OUT_OF_RANGE_TYPE_PACKETS: ethernet receive out of range type packets counter
      \arg        ENET_MMC_RX_PAUSE_PACKETS: ethernet receive pause packets counter
      \arg        ENET_MMC_RX_FIFO_OVERFLOW_PACKETS: ethernet receive fifo overflow packets counter
      \arg        ENET_MMC_RX_VLAN_PACKETS_GOOD_BAD: ethernet receive vlan packets good bad counter
      \arg        ENET_MMC_RX_WATCHDOG_ERROR_PACKETS: ethernet receive watchdog error packets counter
      \arg        ENET_MMC_RX_RECEIVE_ERROR_PACKETS: ethernet receive error packets counter
      \arg        ENET_MMC_RX_CONTROL_PACKETS_GOOD: ethernet receive control packets good counter
      \arg        ENET_MMC_TX_LPI_USEC_CNTR: ethernet transmit LPI microseconds counter
      \arg        ENET_MMC_TX_LPI_TRAN_CNTR: ethernet transmit LPI transition counter
      \arg        ENET_MMC_RX_LPI_USEC_CNTR: ethernet receive LPI microseconds counter
      \arg        ENET_MMC_RX_LPI_TRAN_CNTR: ethernet receive LPI transition counter
      \arg        ENET_MMC_RXIPV4_GOOD_PACKETS: ethernet receive ipv4 good packets counter
      \arg        ENET_MMC_RXIPV4_HEADER_ERROR_PACKETS: ethernet receive ipv4 header error packets counter
      \arg        ENET_MMC_RXIPV4_NO_PAYLOAD_PACKETS: ethernet receive ipv4 no payload packets counter
      \arg        ENET_MMC_RXIPV4_FRAGMENTED_PACKETS: ethernet receive ipv4 fragmented packets counter
      \arg        ENET_MMC_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS: ethernet receive ipv4 udp checksum disabled packets counter
      \arg        ENET_MMC_RXIPV6_GOOD_PACKETS: ethernet receive ipv6 good packets counter
      \arg        ENET_MMC_RXIPV6_HEADER_ERROR_PACKETS: ethernet receive ipv6 header error packets counter
      \arg        ENET_MMC_RXIPV6_NO_PAYLOAD_PACKETS: ethernet receive ipv6 no payload packets counter
      \arg        ENET_MMC_RXUDP_GOOD_PACKETS: ethernet receive udp good packets counter
      \arg        ENET_MMC_RXUDP_ERROR_PACKETS: ethernet receive udp error packets counter
      \arg        ENET_MMC_RXTCP_GOOD_PACKETS: ethernet receive tcp good packets counter
      \arg        ENET_MMC_RXTCP_ERROR_PACKETS: ethernet receive tcp error packets counter
      \arg        ENET_MMC_RXICMP_GOOD_PACKETS: ethernet receive icmp good packets counter
      \arg        ENET_MMC_RXICMP_ERROR_PACKETS: ethernet receive icmp error packets counter
      \arg        ENET_MMC_RXIPV4_GOOD_OCTETS: ethernet receive ipv4 good octets counter
      \arg        ENET_MMC_RXIPV4_HEADER_ERROR_OCTETS: ethernet receive ipv4 header error octets counter
      \arg        ENET_MMC_RXIPV4_NO_PAYLOAD_OCTETS: ethernet receive ipv4 no payload octets counter
      \arg        ENET_MMC_RXIPV4_FRAGMENTED_OCTETS: ethernet receive ipv4 fragmented octets counter
      \arg        ENET_MMC_RXIPV4_UDP_CHECKSUM_DISABLED_OCTETS: ethernet receive ipv4 udp checksum disabled octets counter
      \arg        ENET_MMC_RXIPV6_GOOD_OCTETS: ethernet receive ipv6 good octets counter
      \arg        ENET_MMC_RXIPV6_HEADER_ERROR_OCTETS: ethernet receive ipv6 header error octets counter
      \arg        ENET_MMC_RXIPV6_NO_PAYLOAD_OCTETS: ethernet receive ipv6 no payload octets counter
      \arg        ENET_MMC_RXUDP_GOOD_OCTETS: ethernet receive udp good octets counter
      \arg        ENET_MMC_RXUDP_ERROR_OCTETS: ethernet receive udp error octets counter
      \arg        ENET_MMC_RXTCP_GOOD_OCTETS: ethernet receive tcp good octets counter
      \arg        ENET_MMC_RXTCP_ERROR_OCTETS: ethernet receive tcp error octets counter
      \arg        ENET_MMC_RXICMP_GOOD_OCTETS: ethernet receive icmp good octets counter
      \arg        ENET_MMC_RXICMP_ERROR_OCTETS: ethernet receive icmp error octets counter
      \arg        ENET_MMC_MMC_FPE_TX_FRAGMENT: ethernet MMC FPE transmit fragment counter
      \arg        ENET_MMC_MMC_TX_HOLD_REQ: ethernet MMC FPE hold request counter
      \arg        ENET_MMC_RX_PACKETS_ASSEMBLY_ERR: ethernet MMC receive packets assembly error counter
      \arg        ENET_MMC_RX_PACKETS_SMD_ERR: ethernet MMC receive packets SMD error counter
      \arg        ENET_MMC_RX_PACKETS_ASSEMBLY_OK: ethernet MMC receive packets assembly ok counter
      \arg        ENET_MMC_RX_FPE_FRAGMENT: ethernet MMC receive FPE fragment counter
    \param[out] none
    \retval     the MMC counter value
*/
uint32_t enet_mmc_counters_get(enet_mmc_counter_enum counter)
{
    uint32_t reval;
    reval = REG32((ENET + (uint32_t)counter));
    return reval;
}

/*!
    \brief      enable the PTP features
    \param[in]  feature: the feature of ENET PTP mode
                one or more parameters can be selected which are shown as below
      \arg        ENET_RXTX_TIMESTAMP: timestamp function for transmit and receive frames
      \arg        ENET_PRESENTATION_TIMESTAMP: presentation time generation function
      \arg        ENET_ALL_RX_TIMESTAMP: all received frames are taken snapshot
      \arg        ENET_NONTYPE_FRAME_SNAPSHOT: take snapshot when received non type frame
      \arg        ENET_IPV6_FRAME_SNAPSHOT: take snapshot for IPv6 frame
      \arg        ENET_IPV4_FRAME_SNAPSHOT: take snapshot for IPv4 frame
      \arg        ENET_PTP_FRAME_USE_MACADDRESS_FILTER: use MAC address to filter the PTP frame
      \arg        ENET_TX_TIMESTAMP_OVERWRITE:  transmit timestamp status mode
      \arg        ENET_AV8021_AS_MODE: AV 802.1AS mode-  the MAC processes only untagged PTP over Ethernet packets
    \param[out] none
    \retval     none
*/
void enet_ptp_feature_enable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_PTP_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00A4U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_TIMESTAMP_CONTROL |= feature;
}
}

/*!
    \brief      disable the PTP features
    \param[in]  feature: the feature of ENET PTP mode
                one or more parameters can be selected which are shown as below
      \arg        ENET_RXTX_TIMESTAMP: timestamp function for transmit and receive frames
      \arg        ENET_PRESENTATION_TIMESTAMP: presentation time generation function
      \arg        ENET_ALL_RX_TIMESTAMP: all received frames are taken snapshot
      \arg        ENET_NONTYPE_FRAME_SNAPSHOT: take snapshot when received non type frame
      \arg        ENET_IPV6_FRAME_SNAPSHOT: take snapshot for IPv6 frame
      \arg        ENET_IPV4_FRAME_SNAPSHOT: take snapshot for IPv4 frame
      \arg        ENET_PTP_FRAME_USE_MACADDRESS_FILTER: use MAC address to filter the PTP frame
      \arg        ENET_TX_TIMESTAMP_OVERWRITE:  transmit timestamp status mode
      \arg        ENET_AV8021_AS_MODE: AV 802.1AS mode-  the MAC processes only untagged PTP over Ethernet packets
    \param[out] none
    \retval     none
*/
void enet_ptp_feature_disable(uint32_t feature)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_PTP_FEATURE(feature)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00A5U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_TIMESTAMP_CONTROL &= ~feature;
}
}

/*!
    \brief    configure the PTP timestamp function
    \param[in]  func: the function of PTP timestamp
                only one parameter can be selected which is shown as below
      \arg        ENET_CKNT_END_TO_END_0: type of end-to-end transparent clock node type for timestamp
      \arg        ENET_CKNT_ORDINARY_BOUNDARY_SLAVE: type of ordinary or boundary slave clock node type for timestamp
      \arg        ENET_CKNT_ORDINARY_BOUNDARY_MASTER: type of ordinary or boundary master clock node type for timestamp
      \arg        ENET_CKNT_END_TO_END_PEER_DELAY: type of End-to-End Transparent with support for peer delay clock node type for timestamp
      \arg        ENET_CKNT_ORDINARY_BOUNDARY_SLAVE_PEER_TO_PEER: type of Ordinary or Boundary Slave with support for peer delay mechanism or Peer to Peer Transpare clock node type for timestamp
      \arg        ENET_CKNT_ORDINARY_BOUNDARY_MASTER_PEER_DELAY: type of Ordinary or BoundaryMaster with support for peer delay clock node type for timestamp
      \arg        ENET_CKNT_END_TO_END: type of end-to-end transparent clock node type for timestamp
      \arg        ENET_CKNT_PEER_TO_PEER: type of peer-to-peer transparent clock node type for timestamp
      \arg        ENET_PTP_ADDEND_UPDATE: addend register update
      \arg        ENET_PTP_SYSTIME_UPDATE: timestamp update
      \arg        ENET_PTP_SYSTIME_INIT: timestamp initialize
      \arg        ENET_PTP_FINEMODE: the system timestamp uses the fine method for updating
      \arg        ENET_PTP_COARSEMODE: the system timestamp uses the coarse method for updating
      \arg        ENET_SUBSECOND_DIGITAL_ROLLOVER: digital rollover mode
      \arg        ENET_SUBSECOND_BINARY_ROLLOVER: binary rollover mode
      \arg        ENET_SNOOPING_PTP_VERSION_2: version 2
      \arg        ENET_SNOOPING_PTP_VERSION_1: version 1
      \arg        ENET_EVENT_TYPE_MESSAGES_SNAPSHOT: only event type messages are taken snapshot
      \arg        ENET_ALL_TYPE_MESSAGES_SNAPSHOT: all type messages are taken snapshot except announce,
                                                   management and signaling message
      \arg        ENET_MASTER_NODE_MESSAGE_SNAPSHOT: snapshot is only take for master node message
      \arg        ENET_SLAVE_NODE_MESSAGE_SNAPSHOT: snapshot is only taken for slave node message
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_ptp_timestamp_function_config(enet_ptp_function_enum func)
{
    uint32_t temp_config, temp_state, timeout;
    ErrStatus enet_state;
    timeout = 0U;

    enet_state = SUCCESS;
    switch(func) {
    case ENET_CKNT_END_TO_END_0:
    case ENET_CKNT_END_TO_END_PEER_DELAY:
        ENET_MAC_TIMESTAMP_CONTROL &= ~(ENET_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL | ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA);
        ENET_MAC_TIMESTAMP_CONTROL |= (uint32_t)func;
        break;
    case ENET_CKNT_ORDINARY_BOUNDARY_SLAVE:
    case ENET_CKNT_ORDINARY_BOUNDARY_MASTER:
    case ENET_CKNT_ORDINARY_BOUNDARY_SLAVE_PEER_TO_PEER:
    case ENET_CKNT_ORDINARY_BOUNDARY_MASTER_PEER_DELAY:
        ENET_MAC_TIMESTAMP_CONTROL &= ~(ENET_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL | ENET_MAC_TIMESTAMP_CONTROL_TSMSTRENA | ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA);
        ENET_MAC_TIMESTAMP_CONTROL |= (uint32_t)func;
        break;
    case ENET_CKNT_END_TO_END:
    case ENET_CKNT_PEER_TO_PEER:
        ENET_MAC_TIMESTAMP_CONTROL &= ~ENET_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL;
        ENET_MAC_TIMESTAMP_CONTROL |= (uint32_t)func;
        break;
    case ENET_ALL_TYPE_MESSAGES_SNAPSHOT:
        ENET_MAC_TIMESTAMP_CONTROL &= ~ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA;
        break;
    case ENET_PTP_ADDEND_UPDATE:
        /* this bit must be read as zero before application set it */
        do {
            temp_state = ENET_MAC_TIMESTAMP_CONTROL & ENET_MAC_TIMESTAMP_CONTROL_TSADDREG;
            timeout++;
        } while(((uint32_t)RESET != temp_state) && (timeout < ENET_DELAY_TO));
        /* return ERROR due to timeout */
        if(ENET_DELAY_TO == timeout) {
            enet_state = ERROR;
        } else {
            ENET_MAC_TIMESTAMP_CONTROL |= ENET_MAC_TIMESTAMP_CONTROL_TSADDREG;
        }
        break;
    case ENET_PTP_SYSTIME_UPDATE:
        /* both the TSUPDT and TSINIT bits must be read as zero before application set this bit */
        do {
            temp_state = ENET_MAC_TIMESTAMP_CONTROL & (ENET_MAC_TIMESTAMP_CONTROL_TSUPDT | ENET_MAC_TIMESTAMP_CONTROL_TSINIT);
            timeout++;
        } while(((uint32_t)RESET != temp_state) && (timeout < ENET_DELAY_TO));
        /* return ERROR due to timeout */
        if(ENET_DELAY_TO == timeout) {
            enet_state = ERROR;
        } else {
            ENET_MAC_TIMESTAMP_CONTROL |= ENET_MAC_TIMESTAMP_CONTROL_TSUPDT;
        }
        break;
    case ENET_PTP_SYSTIME_INIT:
        /* this bit must be read as zero before application set it */
        do {
            temp_state = ENET_MAC_TIMESTAMP_CONTROL & ENET_MAC_TIMESTAMP_CONTROL_TSINIT;
            timeout++;
        } while(((uint32_t)RESET != temp_state) && (timeout < ENET_DELAY_TO));
        /* return ERROR due to timeout */
        if(ENET_DELAY_TO == timeout) {
            enet_state = ERROR;
        } else {
            ENET_MAC_TIMESTAMP_CONTROL |= ENET_MAC_TIMESTAMP_CONTROL_TSINIT;
        }
        break;
    default:
        temp_config = (uint32_t)func & (~BIT(31));
        if((uint32_t)RESET != ((uint32_t)func & BIT(31))) {
            ENET_MAC_TIMESTAMP_CONTROL |= temp_config;
        } else {
            ENET_MAC_TIMESTAMP_CONTROL &= ~temp_config;
        }
        break;
    }
    return enet_state;
}

/*!
    \brief    configure system time subsecond increment value
    \param[in]  subsecond: the value will be added to the subsecond value of system time(0x0 - 0xFF)
    \param[in]  nanosubsecond: the value will be added to the nanosubsecond value of system time(0x0 - 0xFF)
    \param[out] none
    \retval     none
*/
void enet_ptp_subsecond_increment_config(uint8_t subsecond, uint8_t nanosubsecond)
{
    ENET_MAC_SUB_SECOND_INCREMENT = PTP_SUB_SECOND_INCREMENT_SSINC(subsecond) | PTP_SUB_SECOND_INCREMENT_SNSINC(nanosubsecond);
}

/*!
    \brief    adjusting the clock frequency only in fine update mode
    \param[in]  add: the value will be added to the accumulator register to achieve time synchronization
    \param[out] none
    \retval     none
*/
void enet_ptp_timestamp_addend_config(uint32_t add)
{
    ENET_MAC_TIMESTAMP_ADDEND = add;
}

/*!
    \brief    initialize or add/subtract to second of the system time
    \param[in]  sign: timestamp update positive or negative sign
                only one parameter can be selected which is shown as below
      \arg        ENET_PTP_ADD_TO_TIME: timestamp update value is added to system time
      \arg        ENET_PTP_SUBSTRACT_FROM_TIME: timestamp update value is subtracted from system time
    \param[in]  secondHi: initializing or adding/subtracting to second of the system time
    \param[in]  second: initializing or adding/subtracting to second of the system time
    \param[in]  subsecond: the current subsecond of the system time
                with 0.46 ns accuracy if required accuracy is 20 ns
    \param[out] none
    \retval     none
*/
void enet_ptp_timestamp_update_config(uint32_t sign, uint16_t secondHi, uint32_t second, uint32_t subsecond)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_PTP_SIGN(sign)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00A9U), ERR_PARAM_INVALID);
    } else if(NOT_ENET_NANOSECOND_VALUE(subsecond)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00A9U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS = secondHi;
    ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE = second;
    ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE = sign | MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(subsecond);
}
}

/*!
    \brief    get the current system time
    \param[in]  none
    \param[out] systime_struct: pointer to a enet_ptp_systime_struct structure which contains
                parameters of PTP system time
                members of the structure and the member values are shown as below:
                  Hisecond: 0x0 - 0xFFFF
                  second: 0x0 - 0xFFFF FFFF
                  subsecond: 0x0 - 0x7FFF FFFF
    \retval     none
*/
void enet_ptp_system_time_get(enet_ptp_systime_struct *systime_struct)
{
    uint32_t temp_hisec, temp_sec, temp_subs;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(systime_struct)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00AAU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    /* get the value of sysytem time registers */
    temp_hisec = (uint32_t)ENET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS;
    temp_sec = (uint32_t)ENET_MAC_SYSTEM_TIME_SECONDS;
    temp_subs = (uint32_t)ENET_MAC_SYSTEM_TIME_NANOSECONDS;

