sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    /* get sysytem time and construct the enet_ptp_systime_struct structure */
    systime_struct->secondHi = temp_hisec;
    systime_struct->second = temp_sec;
    systime_struct->subsecond = GET_PTP_SYSTIME_TSSSS(temp_subs);
}
}

/*!
    \brief      configure the PPS output frequency
    \param[in]  freq: PPS output frequency,
                only one parameter can be selected which is shown as below
      \arg        ENET_PPSOFC_1HZ: PPS output 1Hz frequency
      \arg        ENET_PPSOFC_2HZ: PPS output 2Hz frequency
      \arg        ENET_PPSOFC_4HZ: PPS output 4Hz frequency
      \arg        ENET_PPSOFC_8HZ: PPS output 8Hz frequency
      \arg        ENET_PPSOFC_16HZ: PPS output 16Hz frequency
      \arg        ENET_PPSOFC_32HZ: PPS output 32Hz frequency
      \arg        ENET_PPSOFC_64HZ: PPS output 64Hz frequency
      \arg        ENET_PPSOFC_128HZ: PPS output 128Hz frequency
      \arg        ENET_PPSOFC_256HZ: PPS output 256Hz frequency
      \arg        ENET_PPSOFC_512HZ: PPS output 512Hz frequency
      \arg        ENET_PPSOFC_1024HZ: PPS output 1024Hz frequency
      \arg        ENET_PPSOFC_2048HZ: PPS output 2048Hz frequency
      \arg        ENET_PPSOFC_4096HZ: PPS output 4096Hz frequency
      \arg        ENET_PPSOFC_8192HZ: PPS output 8192Hz frequency
      \arg        ENET_PPSOFC_16384HZ: PPS output 16384Hz frequency
      \arg        ENET_PPSOFC_32768HZ: PPS output 32768Hz frequency
    \param[out] none
    \retval     none
*/
void enet_ptp_pps_output_frequency_config(uint32_t freq)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_PPS_FREQ(freq)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00ABU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD;
    ENET_MAC_PPS_CONTROL |= freq;
}
}

/*!
    \brief      configure the PPS single pulse output
    \param[in]  pps: choose the channel of pps out which users want to check, refer to enet_pps_enum
                only one parameter can be selected which is shown as below
      \arg        PPS0: PPS 0
      \arg        PPS1: PPS 1
      \arg        PPS2: PPS 2
      \arg        PPS3: PPS 3
    \param[in]  second: the second of start time
    \param[in]  nanosubsecond: the nanosecond of start time
    \param[in]  width: the width of pluse
    \param[in]  interrupt: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void enet_flexible_pps_singlepulse_output(enet_pps_enum pps, uint32_t second, uint32_t nanosubsecond, uint32_t width, ControlStatus interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_NANOSECOND_VALUE(nanosubsecond)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00ACU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS_OUTPUT_MODE;
    switch(pps) {
    case PPS0:

        ENET_MAC_PPS_CONTROL &= ~(ENET_MAC_PPS_CONTROL_TRGTMODSEL0 | ENET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD);
        if(ENABLE == interrupt) {
            ENET_MAC_PPS_CONTROL |= ENET_PPS0_GENERATE_INT_AND_OUTPUT;
        } else {
            ENET_MAC_PPS_CONTROL |= ENET_PPS0_GENERATE_OUTPUT_ONLY;
        }
        ENET_MAC_PPS0_TARGET_TIME_SECONDS = second;
        ENET_MAC_PPS0_TARGET_TIME_NANOSECONDS = nanosubsecond;
        ENET_MAC_PPS0_WIDTH = width;
        ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS0_START_SINGLE_PULSE;
        break;
    case PPS1:

        ENET_MAC_PPS_CONTROL &= ~(ENET_MAC_PPS_CONTROL_TRGTMODSEL1 | ENET_MAC_PPS_CONTROL_PPSCMD1);
        if(ENABLE == interrupt) {
            ENET_MAC_PPS_CONTROL |= ENET_PPS1_GENERATE_INT_AND_OUTPUT;
        } else {
            ENET_MAC_PPS_CONTROL |= ENET_PPS1_GENERATE_OUTPUT_ONLY;
        }
        ENET_MAC_PPS1_TARGET_TIME_SECONDS = second;
        ENET_MAC_PPS1_TARGET_TIME_NANOSECONDS = nanosubsecond;
        ENET_MAC_PPS1_WIDTH = width;
        ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS1_START_SINGLE_PULSE;
        break;
    case PPS2:

        ENET_MAC_PPS_CONTROL &= ~(ENET_MAC_PPS_CONTROL_TRGTMODSEL2 | ENET_MAC_PPS_CONTROL_PPSCMD2);
        if(ENABLE == interrupt) {
            ENET_MAC_PPS_CONTROL |= ENET_PPS2_GENERATE_INT_AND_OUTPUT;
        } else {
            ENET_MAC_PPS_CONTROL |= ENET_PPS2_GENERATE_OUTPUT_ONLY;
        }
        ENET_MAC_PPS2_TARGET_TIME_SECONDS = second;
        ENET_MAC_PPS2_TARGET_TIME_NANOSECONDS = nanosubsecond;
        ENET_MAC_PPS2_WIDTH = width;
        ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS2_START_SINGLE_PULSE;
        break;
    case PPS3:

        ENET_MAC_PPS_CONTROL &= ~(ENET_MAC_PPS_CONTROL_TRGTMODSEL3 | ENET_MAC_PPS_CONTROL_PPSCMD3);
        if(ENABLE == interrupt) {
            ENET_MAC_PPS_CONTROL |= ENET_PPS3_GENERATE_INT_AND_OUTPUT;
        } else {
            ENET_MAC_PPS_CONTROL |= ENET_PPS3_GENERATE_OUTPUT_ONLY;
        }
        ENET_MAC_PPS3_TARGET_TIME_SECONDS = second;
        ENET_MAC_PPS3_TARGET_TIME_NANOSECONDS = nanosubsecond;
        ENET_MAC_PPS3_WIDTH = width;
        ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS3_START_SINGLE_PULSE;
        break;
    default:
        break;
    }
    
}
}

/*!
    \brief      configure the PPS train pulse output
    \param[in]  pps: choose the channel of pps out which users want to check, refer to enet_pps_enum
                only one parameter can be selected which is shown as below
      \arg        PPS0: PPS 0
      \arg        PPS1: PPS 1
      \arg        PPS0: PPS 2
      \arg        PPS1: PPS 3
    \param[in]  second: the second of start time
    \param[in]  nanosubsecond: the nanosecond of start time
    \param[in]  width: the width of pluse
    \param[in]  interval: the interval of pluse
    \param[in]  interrupt: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void enet_flexible_pps_trainpulse_output(enet_pps_enum pps, uint32_t second, uint32_t nanosubsecond, uint32_t width, uint32_t interval,
        ControlStatus interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_NANOSECOND_VALUE(nanosubsecond)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00ADU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS_OUTPUT_MODE;
    switch(pps) {
    case PPS0:
        ENET_MAC_PPS_CONTROL &= ~(ENET_MAC_PPS_CONTROL_TRGTMODSEL0 | ENET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD);
        if(ENABLE == interrupt) {
            ENET_MAC_PPS_CONTROL |= ENET_PPS0_GENERATE_INT_AND_OUTPUT;
        } else {
            ENET_MAC_PPS_CONTROL |= ENET_PPS0_GENERATE_OUTPUT_ONLY;
        }
        ENET_MAC_PPS0_TARGET_TIME_SECONDS = second;
        ENET_MAC_PPS0_TARGET_TIME_NANOSECONDS = nanosubsecond;
        ENET_MAC_PPS0_INTERVAL = interval;
        ENET_MAC_PPS0_WIDTH = width;
        ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS0_START_PULSE_TRAIN;
        break;

    case PPS1:
        ENET_MAC_PPS_CONTROL &= ~(ENET_MAC_PPS_CONTROL_TRGTMODSEL1 | ENET_MAC_PPS_CONTROL_PPSCMD1);
        if(ENABLE == interrupt) {
            ENET_MAC_PPS_CONTROL |= ENET_PPS1_GENERATE_INT_AND_OUTPUT;
        } else {
            ENET_MAC_PPS_CONTROL |= ENET_PPS1_GENERATE_OUTPUT_ONLY;
        }
        ENET_MAC_PPS1_TARGET_TIME_SECONDS = second;
        ENET_MAC_PPS1_TARGET_TIME_NANOSECONDS = nanosubsecond;
        ENET_MAC_PPS1_WIDTH = width;
        ENET_MAC_PPS1_INTERVAL = interval;
        ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS1_START_PULSE_TRAIN;
        break;

    case PPS2:
        ENET_MAC_PPS_CONTROL &= ~(ENET_MAC_PPS_CONTROL_TRGTMODSEL2 | ENET_MAC_PPS_CONTROL_PPSCMD2);
        if(ENABLE == interrupt) {
            ENET_MAC_PPS_CONTROL |= ENET_PPS2_GENERATE_INT_AND_OUTPUT;
        } else {
            ENET_MAC_PPS_CONTROL |= ENET_PPS2_GENERATE_OUTPUT_ONLY;
        }
        ENET_MAC_PPS2_TARGET_TIME_SECONDS = second;
        ENET_MAC_PPS2_TARGET_TIME_NANOSECONDS = nanosubsecond;
        ENET_MAC_PPS2_WIDTH = width;
        ENET_MAC_PPS2_INTERVAL = interval;
        ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS2_START_PULSE_TRAIN;
        break;

    case PPS3:
        ENET_MAC_PPS_CONTROL &= ~(ENET_MAC_PPS_CONTROL_TRGTMODSEL3 | ENET_MAC_PPS_CONTROL_PPSCMD3);
        if(ENABLE == interrupt) {
            ENET_MAC_PPS_CONTROL |= ENET_PPS3_GENERATE_INT_AND_OUTPUT;
        } else {
            ENET_MAC_PPS_CONTROL |= ENET_PPS3_GENERATE_OUTPUT_ONLY;
        }
        ENET_MAC_PPS3_TARGET_TIME_SECONDS = second;
        ENET_MAC_PPS3_TARGET_TIME_NANOSECONDS = nanosubsecond;
        ENET_MAC_PPS3_WIDTH = width;
        ENET_MAC_PPS3_INTERVAL = interval;
        ENET_MAC_PPS_CONTROL |= ENET_FLEXIBLE_PPS3_START_PULSE_TRAIN;
        break;
    default:
        break;
    }
}
}

/*!
    \brief      configure the PPS output related command
    \param[in]  pps: choose the channel of pps out which users want to check, refer to enet_pps_enum
                only one parameter can be selected which is shown as below
      \arg        PPS0: PPS 0
      \arg        PPS1: PPS 1
      \arg        PPS0: PPS 2
      \arg        PPS1: PPS 3
    \param[in]  stopsecond: the second of stop time, only be useful when the command is configured as ENET_FLEXIBLE_PPSx_STOP_PULSE_TRAIN_AT_TIME(x = 0, 1, 2, 3)
    \param[in]  stopnanosubsecond: the nanosecond of stop time, only be useful when the command is configured as ENET_FLEXIBLE_PPSx_STOP_PULSE_TRAIN_AT_TIME(x = 0, 1, 2, 3)
    \param[in]  command: PPS output command,
                only one parameter can be selected which is shown as below
      \arg        ENET_FLEXIBLE_PPS0_START_SINGLE_PULSE: generates single pulse rising at the start point
      \arg        ENET_FLEXIBLE_PPS0_START_PULSE_TRAIN: generates the train of pulses rising at the start point
      \arg        ENET_FLEXIBLE_PPS0_CANCEL_START: cancels the start single pulse and start pulse train commands
      \arg        ENET_FLEXIBLE_PPS0_STOP_PULSE_TRAIN_AT_TIME: stops the train of pulses after the time programmed in the Target Time registers elapses
      \arg        ENET_FLEXIBLE_PPS0_STOP_PULSE_TRAIN_NOW: immediately stops the train of pulses
      \arg        ENET_FLEXIBLE_PPS0_CANCEL_STOP_PULSE_TRAIN: cancels the stop pulse train at time command if the programmed stop time has not elapsed

      \arg        ENET_FLEXIBLE_PPS1_START_SINGLE_PULSE: generates single pulse rising at the start point
      \arg        ENET_FLEXIBLE_PPS1_START_PULSE_TRAIN: generates the train of pulses rising at the start point
      \arg        ENET_FLEXIBLE_PPS1_CANCEL_START: cancels the start single pulse and start pulse train commands
      \arg        ENET_FLEXIBLE_PPS1_STOP_PULSE_TRAIN_AT_TIME: stops the train of pulses after the time programmed in the Target Time registers elapses
      \arg        ENET_FLEXIBLE_PPS1_STOP_PULSE_TRAIN_NOW: immediately stops the train of pulses
      \arg        ENET_FLEXIBLE_PPS1_CANCEL_STOP_PULSE_TRAIN: cancels the stop pulse train at time command if the programmed stop time has not elapsed

      \arg        ENET_FLEXIBLE_PPS2_START_SINGLE_PULSE: generates single pulse rising at the start point
      \arg        ENET_FLEXIBLE_PPS2_START_PULSE_TRAIN: generates the train of pulses rising at the start point
      \arg        ENET_FLEXIBLE_PPS2_CANCEL_START: cancels the start single pulse and start pulse train commands
      \arg        ENET_FLEXIBLE_PPS2_STOP_PULSE_TRAIN_AT_TIME: stops the train of pulses after the time programmed in the Target Time registers elapses
      \arg        ENET_FLEXIBLE_PPS2_STOP_PULSE_TRAIN_NOW: immediately stops the train of pulses
      \arg        ENET_FLEXIBLE_PPS2_CANCEL_STOP_PULSE_TRAIN: cancels the stop pulse train at time command if the programmed stop time has not elapsed

      \arg        ENET_FLEXIBLE_PPS3_START_SINGLE_PULSE: generates single pulse rising at the start point
      \arg        ENET_FLEXIBLE_PPS3_START_PULSE_TRAIN: generates the train of pulses rising at the start point
      \arg        ENET_FLEXIBLE_PPS3_CANCEL_START: cancels the start single pulse and start pulse train commands
      \arg        ENET_FLEXIBLE_PPS3_STOP_PULSE_TRAIN_AT_TIME: stops the train of pulses after the time programmed in the Target Time registers elapses
      \arg        ENET_FLEXIBLE_PPS3_STOP_PULSE_TRAIN_NOW: immediately stops the train of pulses
      \arg        ENET_FLEXIBLE_PPS3_CANCEL_STOP_PULSE_TRAIN: cancels the stop pulse train at time command if the programmed stop time has not elapsed
    \param[out] none
    \retval     none
*/
void enet_flexible_pps_command_config(enet_pps_enum pps, uint32_t stopsecond, uint32_t stopnanosubsecond, uint32_t command)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_NANOSECOND_VALUE(stopnanosubsecond)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00AEU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_ENET_PPS_COMMAND(command)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00AEU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(pps) {
    case PPS0:
        ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD;
        if(ENET_FLEXIBLE_PPS0_STOP_PULSE_TRAIN_AT_TIME == command) {
            ENET_MAC_PPS0_TARGET_TIME_SECONDS = stopsecond;
            ENET_MAC_PPS0_TARGET_TIME_NANOSECONDS = stopnanosubsecond;
            ENET_MAC_PPS_CONTROL |= command;
        } else {
            ENET_MAC_PPS_CONTROL |= command;
        }
        break;
    case PPS1:
        ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCMD1;
        if(ENET_FLEXIBLE_PPS1_STOP_PULSE_TRAIN_AT_TIME == command) {
            ENET_MAC_PPS1_TARGET_TIME_SECONDS = stopsecond;
            ENET_MAC_PPS1_TARGET_TIME_NANOSECONDS = stopnanosubsecond;
            ENET_MAC_PPS_CONTROL |= command;
        } else {
            ENET_MAC_PPS_CONTROL |= command;
        }
        break;
    case PPS2:
        ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCMD2;
        if(ENET_FLEXIBLE_PPS2_STOP_PULSE_TRAIN_AT_TIME == command) {
            ENET_MAC_PPS2_TARGET_TIME_SECONDS = stopsecond;
            ENET_MAC_PPS2_TARGET_TIME_NANOSECONDS = stopnanosubsecond;
            ENET_MAC_PPS_CONTROL |= command;
        } else {
            ENET_MAC_PPS_CONTROL |= command;
        }
        break;
    case PPS3:
        ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCMD3;
        if(ENET_FLEXIBLE_PPS3_STOP_PULSE_TRAIN_AT_TIME == command) {
            ENET_MAC_PPS3_TARGET_TIME_SECONDS = stopsecond;
            ENET_MAC_PPS3_TARGET_TIME_NANOSECONDS = stopnanosubsecond;
            ENET_MAC_PPS_CONTROL |= command;
        } else {
            ENET_MAC_PPS_CONTROL |= command;
        }
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the value of presentation time
    \param[in]  mcgr: choose the instances of media clock which users want to check, refer to enet_mcgr_enum
                only one parameter can be selected which is shown as below
      \arg        MCGR0: MCGR 0
      \arg        MCGR1: MCGR 1
      \arg        MCGR0: MCGR 2
      \arg        MCGR1: MCGR 3
    \param[in]  seconds: the time seconds value
    \param[out] none
    \retval     none
*/
void enet_mcgr_present_time_set(enet_mcgr_enum mcgr, uint32_t seconds)
{
    switch(mcgr) {
    case MCGR0:
        ENET_MAC_PPS0_TARGET_TIME_SECONDS = seconds;
        break;
    case MCGR1:
        ENET_MAC_PPS1_TARGET_TIME_SECONDS = seconds;
        break;
    case MCGR2:
        ENET_MAC_PPS2_TARGET_TIME_SECONDS = seconds;
        break;
    case MCGR3:
        ENET_MAC_PPS3_TARGET_TIME_SECONDS = seconds;
        break;
    default:
        break;
    }
}

/*!
    \brief      set the value of current presentation time
    \param[in]  nanoseconds: the time nanoseconds value
    \param[out] none
    \retval     none
*/
uint32_t enet_mcgr_current_present_time_get(void)
{
    return ENET_MAC_PRESN_TIME_NS;
}

/*!
    \brief     configure the update value of presentation time
    \param[in]  nanosubsecond: the value will be updated to the nanosubsecond value of presentation time(0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     none
*/
void enet_mcgr_present_time_update(uint32_t nanosubsecond)
{
    ENET_MAC_PRESN_TIME_UPDT = MAC_PRESN_TIME_UPDT_MPTU(nanosubsecond);
}

/*!
    \brief      configure the mcgr related command
    \param[in]  pps: choose the instances of media clock which users want to check, refer to enet_mcgr_enum
                only one parameter can be selected which is shown as below
      \arg        MCGR0: MCGR 0
      \arg        MCGR1: MCGR 1
      \arg        MCGR0: MCGR 2
      \arg        MCGR1: MCGR 3
    \param[in]  mode: the mode of media clock,
                only one parameter can be selected which is shown as below
      \arg        ENET_MCGR0_OPERATION_NONE: MCGR operation is not carried out
      \arg        ENET_MCGR0_CAPTURE_RISING: capture the presentation time at the rising edge
      \arg        ENET_MCGR0_CAPTURE_FALLING: capture the presentation time at the falling edge
      \arg        ENET_MCGR0_CAPTURE_BOTH: capture the presentation time at both edgesenen
      \arg        ENET_MCGR0_OUTPUT_TOGGLE: toggle output on compare
      \arg        ENET_MCGR0_OUTPUT_LOW: pulse output low on compare for one PTP-clock cycle
      \arg        ENET_MCGR0_OUTPUT_HIGH: pulse output high on compare for one PTP-clock cycle

      \arg        ENET_MCGR1_OPERATION_NONE: MCGR operation is not carried out
      \arg        ENET_MCGR1_CAPTURE_RISING: capture the presentation time at the rising edge
      \arg        ENET_MCGR1_CAPTURE_FALLING: capture the presentation time at the falling edge
      \arg        ENET_MCGR1_CAPTURE_BOTH: capture the presentation time at both edgesenen
      \arg        ENET_MCGR1_OUTPUT_TOGGLE: toggle output on compare
      \arg        ENET_MCGR1_OUTPUT_LOW: pulse output low on compare for one PTP-clock cycle
      \arg        ENET_MCGR1_OUTPUT_HIGH: pulse output high on compare for one PTP-clock cycle

      \arg        ENET_MCGR2_OPERATION_NONE: MCGR operation is not carried out
      \arg        ENET_MCGR2_CAPTURE_RISING: capture the presentation time at the rising edge
      \arg        ENET_MCGR0_CAPTURE_FALLING: capture the presentation time at the falling edge
      \arg        ENET_MCGR0_CAPTURE_BOTH: capture the presentation time at both edgesenen
      \arg        ENET_MCGR0_OUTPUT_TOGGLE: toggle output on compare
      \arg        ENET_MCGR0_OUTPUT_LOW: pulse output low on compare for one PTP-clock cycle
      \arg        ENET_MCGR0_OUTPUT_HIGH: pulse output high on compare for one PTP-clock cycle

