sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
      \arg        ENET_MCGR0_OPERATION_NONE: MCGR operation is not carried out
      \arg        ENET_MCGR0_CAPTURE_RISING: capture the presentation time at the rising edge
      \arg        ENET_MCGR0_CAPTURE_FALLING: capture the presentation time at the falling edge
      \arg        ENET_MCGR0_CAPTURE_BOTH: capture the presentation time at both edgesenen
      \arg        ENET_MCGR0_OUTPUT_TOGGLE: toggle output on compare
      \arg        ENET_MCGR0_OUTPUT_LOW: pulse output low on compare for one PTP-clock cycle
      \arg        ENET_MCGR0_OUTPUT_HIGH: pulse output high on compare for one PTP-clock cycle
    \param[out] none
    \retval     none
*/
void enet_mcgr_media_clock_config(enet_mcgr_enum mcgr, uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_MCGR_MODE(mode)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00B2U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    switch(mcgr) {
    case MCGR0:
        ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD;
        ENET_MAC_PPS_CONTROL |= (mode | ENET_MAC_PPS_CONTROL_MCGREN0);
        break;
    case MCGR1:
        ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCMD1;
        ENET_MAC_PPS_CONTROL |= (mode | ENET_MAC_PPS_CONTROL_MCGREN1);
        break;
    case MCGR2:
        ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCMD2;
        ENET_MAC_PPS_CONTROL |= (mode | ENET_MAC_PPS_CONTROL_MCGREN2);
        break;
    case MCGR3:
        ENET_MAC_PPS_CONTROL &= ~ENET_MAC_PPS_CONTROL_PPSCMD3;
        ENET_MAC_PPS_CONTROL |= (mode | ENET_MAC_PPS_CONTROL_MCGREN3);
        break;
    default:
        break;
    }
}
}

/*!
    \brief      set the timestamp asymmetry correction value
    \param[in]  type: timestamp type selection
                only one parameter can be selected which is shown as below
      \arg        TIMESTAMP_EGRESS: timestamp egress
      \arg        TIMESTAMP_INGRESS: timestamp ingress
    \param[in]  val: the asymmetry correction value(0x0 - 0xFFFFFFFF)
    \param[out] none
    \retval     none
*/
void enet_timestamp_asym_correction_set(enet_timestamp_type_enum type, uint32_t val)
{
    switch(type) {
    case TIMESTAMP_EGRESS:
        ENET_MAC_TIMESTAMP_EGRESS_ASYM_CORR &= ~ENET_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC;
        ENET_MAC_TIMESTAMP_EGRESS_ASYM_CORR = val;
        break;
    case TIMESTAMP_INGRESS:
        ENET_MAC_TIMESTAMP_INGRESS_ASYM_CORR &= ~ENET_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC;
        ENET_MAC_TIMESTAMP_INGRESS_ASYM_CORR = val;
        break;
    default:
        break;
    }
}

/*!
    \brief      set the timestamp correction value
    \param[in]  type: timestamp type selection
                only one parameter can be selected which is shown as below
      \arg        TIMESTAMP_EGRESS: timestamp egress
      \arg        TIMESTAMP_INGRESS: timestamp ingress
    \param[in]  nanosecond: the time nanoseconds value(0x0000 - 0xFFFFFFFF)
    \param[in]  nanosubsecond: the time nanosubsecond value(0x00 - 0xFF)
    \param[out] none
    \retval     none
*/
void enet_timestamp_correction_value_set(enet_timestamp_type_enum type, uint32_t nanosecond, uint8_t nanosubsecond)
{
    switch(type) {
    case TIMESTAMP_EGRESS:
        ENET_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND &= ~ENET_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC;
        ENET_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND = nanosecond;
        ENET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC &= ~ENET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS;
        ENET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC = MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS(nanosubsecond);
        break;
    case TIMESTAMP_INGRESS:
        ENET_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND &= ~ENET_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC;
        ENET_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND = nanosecond;
        ENET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC &= ~ENET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS;
        ENET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC = MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS(nanosubsecond);
        break;
    default:
        break;
    }
}

/*!
    \brief      set the timestamp latency value
    \param[in]  type: timestamp type selection
                only one parameter can be selected which is shown as below
      \arg        TIMESTAMP_EGRESS: timestamp egress
      \arg        TIMESTAMP_INGRESS: timestamp ingress
    \param[in]  latency: the nanosecond or subnanosecond portion of the latency selection
      \arg        LATENCY_NANOSECOND: nanosecond
      \arg        LATENCY_SUBNANOSECOND: subnanosecond
    \param[out] none
    \retval     uint16_t: the latency value
*/
uint16_t enet_timestamp_asym_latency_get(enet_timestamp_type_enum type, enet_timestamp_latency_enum latency)
{
    uint16_t ret_val = 0;
    switch(type) {
    case TIMESTAMP_EGRESS:
        if(LATENCY_NANOSECOND ==  latency) {
            ret_val = (uint16_t)((ENET_MAC_TIMESTAMP_EGRESS_LATENCY & ENET_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS) >> 16);
        } else {
            ret_val = (uint16_t)((ENET_MAC_TIMESTAMP_EGRESS_LATENCY & ENET_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS) >> 8);
        }
        break;
    case TIMESTAMP_INGRESS:
        if(LATENCY_NANOSECOND ==  latency) {
            ret_val = (uint16_t)((ENET_MAC_TIMESTAMP_INGRESS_LATENCY & ENET_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS) >> 16);
        } else {
            ret_val = (uint16_t)((ENET_MAC_TIMESTAMP_INGRESS_LATENCY & ENET_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS) >> 8);
        }
        break;
    default:
        break;
    }
    return ret_val;
}

/*!
    \brief     writing to the per queue/channel VLAN inclusion
    \param[in]  enet_vlantype_enum: vlan type selection
                only one parameter can be selected which is shown as below
      \arg        CVLAN: C-VLAN
      \arg        SVLAN: S-VLAN
    \param[in]  vlantag: the value will be updated to the VLAN tag(0x0000 - 0xFFFF)
    \param[in]  enet_txq: transmit queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1
    \param[out] none
    \retval     none
*/
void enet_queue_based_vlan_write(enet_vlantype_enum vlantype, uint16_t vlantag, enet_txq_enum queue)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;

