sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
    /* wait until BUSY bit is clear */
    while(((ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_BUSY) != (uint32_t)RESET) && (0U < timeout)) {
        timeout --;
    }
     ENET_MAC_VLAN_INCL |= ENET_MAC_VLAN_INCL_CBTI;

    while((ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_CBTI) == 0U){
    };
     ENET_MAC_VLAN_INCL |= ((uint32_t)queue << 24);
     ENET_MAC_VLAN_INCL |= ENET_MAC_VLAN_INCL_RDWR;
     ENET_MAC_VLAN_INCL &= ~(ENET_MAC_VLAN_INCL_CSVL | ENET_MAC_VLAN_INCL_VLT);

     ENET_MAC_VLAN_INCL |= (((uint32_t)vlantype << 19) | MAC_VLAN_INCL_VLT(vlantag));

    /* wait until BUSY bit is clear */
    timeout = ENET_OPERATION_TIMEROUT;
    while(((ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_BUSY) != (uint32_t)RESET) && (0U < timeout)) {
        timeout --;
    }
    ENET_MAC_VLAN_INCL &= ~ENET_MAC_VLAN_INCL_RDWR;
}

/*!
    \brief     read the type of the queue/channel VLAN
    \param[in]  enet_txq: transmit queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1
    \param[out] none
    \retval     enet_vlantype_enum: CVLAN or SVLAN
*/
enet_vlantype_enum enet_queue_based_vlan_type_read(enet_txq_enum queue)
{
    uint32_t timeout = ENET_OPERATION_TIMEROUT;
    enet_vlantype_enum vlantype;

/* wait until BUSY bit is clear */
    while(((ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_BUSY) != (uint32_t)RESET) && (0U < timeout)) {
        timeout --;
    }
    ENET_MAC_VLAN_INCL |= ENET_MAC_VLAN_INCL_CBTI;

    if(TXQ0 == queue) {
        ENET_MAC_VLAN_INCL &= ~ENET_MAC_VLAN_INCL_ADDR;
    } else {
        ENET_MAC_VLAN_INCL |= ENET_MAC_VLAN_INCL_ADDR;
    }
    ENET_MAC_VLAN_INCL &= ~ENET_MAC_VLAN_INCL_RDWR;
    /* wait until BUSY bit is clear */
    timeout = ENET_OPERATION_TIMEROUT;
    while(((ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_BUSY) != (uint32_t)RESET) && (0U < timeout)) {
        timeout --;
    }
    if((uint32_t)RESET != (ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_CSVL)){
        vlantype = SVLAN;
    } else {
        vlantype = CVLAN;
    }
    return vlantype;
}

/*!
    \brief     read the vlan tag of the queue/channel VLAN
    \param[in]  enet_txq: transmit queue selection
                only one parameter can be selected which is shown as below
      \arg        TXQ0: transmit queue 0
      \arg        TXQ1: transmit queue 1
    \param[out] none
    \retval     vlantag: vlan tag
*/
uint16_t enet_queue_based_vlan_tagvid_read(enet_txq_enum queue)
{
    uint16_t vlantag;

    while((ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_BUSY) != (uint32_t)RESET){
    };
    ENET_MAC_VLAN_INCL |= ENET_MAC_VLAN_INCL_CBTI;

    if(TXQ0 == queue) {
        ENET_MAC_VLAN_INCL &= ~ENET_MAC_VLAN_INCL_ADDR;
    } else {
        ENET_MAC_VLAN_INCL |= ENET_MAC_VLAN_INCL_ADDR;
    }
    ENET_MAC_VLAN_INCL &= ~ENET_MAC_VLAN_INCL_RDWR;
    /* wait until BUSY bit is clear */
    while((ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_BUSY) != (uint32_t)RESET) {
    }
    vlantag = (uint16_t)(ENET_MAC_VLAN_INCL & ENET_MAC_VLAN_INCL_VLT);
    
    return vlantag;
}

/*!
    \brief     select the MTL ECC memory
    \param[in]  memory: the memory type
                only one parameter can be selected which is shown as below
      \arg        ENET_MTL_ECC_SELECT_TX_MEM: MTL Tx memory
      \arg        ENET_MTL_ECC_SELECT_RX_MEM: MTL Rx memory
      \arg        ENET_MTL_ECC_SELECT_EST_MEM: MTL EST memory
      \arg        ENET_MTL_ECC_SELECT_RXP_MEM: MTL RXP memory
    \param[out] none
    \retval     none
*/
void enet_ecc_memory_select(uint32_t memory)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_ECC_MEMORY(memory)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00B9U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_ECC_ERR_STS_RCTL &= ~ENET_MTL_ECC_ERR_STS_RCTL_EMS;
    ENET_MTL_ECC_ERR_STS_RCTL |= memory;
}
}

/*!
    \brief     set the ECC error status related configuration
    \param[in]  config: the ECC error status related configuration
                only one parameter can be selected which is shown as below
      \arg        ENET_MTL_ECC_ERR_STATUS_READ_ENABLE: MTL ECC error status read enable
      \arg        ENET_MTL_UNCORRECTABLE_ERR_STATUS_CLEAR: clear unCorrectable error status
      \arg        ENET_MTL_CORRECTABLE_ERR_STATUS_CLEAR: clear Correctable error status
    \param[out] none
    \retval     none
*/
void enet_ecc_status_clear_read(uint32_t config)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_ECC_ERR_STATUS_CFG(config)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00BAU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_ECC_ERR_STS_RCTL &= ~(ENET_MTL_ECC_ERR_STS_RCTL_EESRE|ENET_MTL_ECC_ERR_STS_RCTL_CCES|ENET_MTL_ECC_ERR_STS_RCTL_CUES);
    ENET_MTL_ECC_ERR_STS_RCTL |= config;
}
}

/*!
    \brief     get the MTL ECC error address
    \param[in]  type: the type of error address status
                only one parameter can be selected which is shown as below
      \arg        ENET_MTL_UNCORRECTABLE_ERR_ADDRESS: MTL ECC uncorrectable error address status
      \arg        ENET_MTL_CORRECTABLE_ERR_ADDRESS: MTL ECC correctable error address status
    \param[out] none
    \retval     err_addr: the MTL ECC error address
*/
uint16_t enet_ecc_error_address_get(uint32_t type)
{
    uint16_t err_addr;
    err_addr = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_ECC_ERR_ADDRESS(type)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00BBU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if(ENET_MTL_UNCORRECTABLE_ERR_ADDRESS == type) {
        err_addr = (uint16_t)GET_UNCORRECTABLE_ERR_ADDRESS(ENET_MTL_ECC_ERR_ADDR_STATUS);
    } else {
        err_addr = (uint16_t)GET_CORRECTABLE_ERR_ADDRESS(ENET_MTL_ECC_ERR_ADDR_STATUS);
    }
}
    return err_addr;
}

/*!
    \brief     get the MTL ECC error counter
    \param[in]  type: the type of error address counter
                only one parameter can be selected which is shown as below
      \arg        ENET_MTL_UNCORRECTABLE_ERR_COUNT: MTL ECC uncorrectable error counter status
      \arg        ENET_MTL_CORRECTABLE_ERR_COUNT: MTL ECC correctable error counter status
    \param[out] none
    \retval     err_cnt: the MTL ECC error counter
*/
uint16_t enet_ecc_error_count_get(uint32_t type)
{
    uint16_t err_cnt;
    err_cnt = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_ECC_ERR_COUNT(type)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00BCU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    if(ENET_MTL_UNCORRECTABLE_ERR_COUNT == type) {
        err_cnt = (uint16_t)GET_UNCORRECTABLE_ERR_COUNT(ENET_MTL_ECC_ERR_CNTR_STATUS);
    } else {
        err_cnt = (uint16_t)GET_CORRECTABLE_ERR_COUNT(ENET_MTL_ECC_ERR_CNTR_STATUS);
    }

