sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.c
}
    return err_cnt;
}

/*!
    \brief     set the MTL error injection mode
    \param[in]  mode: the MTL error injection mode
                only one parameter can be selected which is shown as below
      \arg        ENET_ERR_INJTECTION_ON_ECC_PARITY: indicate error injection on ECC/Parity bits
      \arg        ENET_ERR_INJTECTION_ON_DATA: indicate error injection on data
    \param[out] none
    \retval     none
*/
void enet_error_injection_mode_set(uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_MTL_ERR_INJECTION_MODE(mode)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00BDU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_DPP_ECC_EIC &= ~ENET_MTL_DPP_ECC_EIC_EIM;
    ENET_MTL_DPP_ECC_EIC |= mode;
}
}

/*!
    \brief     get the bit location of error injection
    \param[in]  none
    \param[out] none
    \retval     bit_location: the bit location of error injection
*/
uint16_t enet_error_injection_location_get(void)
{
    uint16_t bit_location;
    bit_location = (uint16_t)MTL_DPP_ECC_EIC_BLEI(ENET_MTL_DPP_ECC_EIC);
    return bit_location;
}

/*!
    \brief     set the MTL error injection configuration
    \param[in]  mode: the MTL error injection configuration
                only one parameter can be selected which is shown as below
      \arg        ENET_RXP_INSERT_ECC_ERR_1BIT: ECC inject 1-bit error for Rx parser memory
      \arg        ENET_RXP_INSERT_ECC_ERR_2BIT: ECC inject 2-bit error for Rx parser memory
      \arg        ENET_RXP_INSERT_ECC_ADDR_ERR_1BIT: ECC inject 1-bit address error for Rx parser memory
      \arg        ENET_RXP_INSERT_ECC_ADDR_ERR_2BIT: ECC inject 2-bit address error for Rx parser memory
    \param[out] none
    \retval     none
*/
void enet_error_injection_config(uint32_t config)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENET_MTL_ERR_INJECTION_CFG(config)){
        fw_debug_report_err(ENET_MODULE_ID, API_ID(0x00BFU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
{
    ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS &= ~(ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC|ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE|ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE);
    ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS |= config;
}
}

#ifndef USE_DELAY
/*!
    \brief    insert a delay time
    \param[in]  ncount: specifies the delay time length
    \param[out] none
    \param[out] none
*/
static void enet_delay(uint32_t ncount)
{
    __IO uint32_t delay_time;
    delay_time = ncount;
    while(delay_time != 0U){
        delay_time--;
    }
}
#endif /* USE_DELAY */

#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
